Attribute VB_Name = "IQQQ跨码_P展擎0主控"




'########################################################################################
'########################################################################################
'#####################################   QQQ  研究部分   #################################
'########################################################################################
'########################################################################################
'========================================================================================
'========================================================================================
'QQQ：某时版 批处理
'========================================================================================
'========================================================================================
Sub IQQQ展擎主前调_某时版批处理()
'----------------------------------------------------------------------------------------
    Dim 研究日期开始 As Date
    Dim 研究日期结束 As Date
    研究日期开始 = "2017/6/1"
    研究日期结束 = "2017/6/2"
    '------------------------------------------------------------------------------------
    Dim 研究日期 As Date
    For 研究日期 = 研究日期开始 To 研究日期结束
        If 时程结期判断IS类日(研究日期) Then
            Debug.Print 研究日期
            MSG = MSG & vbCrLf & IQQQ展擎主前调正程(研究日期:=研究日期)
        End If
    Next 研究日期
'----------------------------------------------------------------------------------------
    MsgBox MSG, Title:="QQQ 外簿某时版批处理"
End Sub
'========================================================================================
'========================================================================================
'QQQ：某时版
'========================================================================================
'========================================================================================
Sub IQQQ展擎主前调_某时版本簿()
    Dim 研究日期 As Date
    研究日期 = "2019/2/22"
    MSG = IQQQ展擎主前调正程(是否外簿:=False, 研究日期:=研究日期, 参of筛决策剔池:=True, 是否筛频谱:=True)
    MSG = "QQQ研究日期：" & 研究日期 & vbCrLf & MSG
    MsgBox MSG, Title:="QQQ 本簿某时版"
End Sub
Sub IQQQ展擎主前调_某时版()
    Dim 研究日期 As Date
    研究日期 = "2014/7/1"
    MSG = IQQQ展擎主前调正程(研究日期:=研究日期, 参of筛决策剔池:=True, 是否筛频谱:=True)
    MSG = "QQQ研究日期：" & 研究日期 & vbCrLf & MSG
    MsgBox MSG, Title:="QQQ 外簿某时版"
End Sub
'========================================================================================
'########################################################################################
'########################################################################################
'#####################################   QQQ  研究部分   #################################
'########################################################################################
'########################################################################################






'########################################################################################
'########################################################################################
'#####################################   QQQ  花天调用   #################################
'########################################################################################
'########################################################################################
'========================================================================================
'========================================================================================
'QQQ：即时版
'========================================================================================
'========================================================================================
Sub IQQQ展擎主前调_sCCC式决策简按混日机()
    Call IQQQ展擎主前调正程(实结类型:="sCCC", 是否外簿:=False, 是否筛决策:=True, 是否剔黑:=True, 参of筛决策剔池:=True, 参of筛决策详表:=False, 出章模式:="混", 出节模式:="日机")
End Sub
Sub IQQQ展擎主前调_sCCC式决策简按月护日层()
    Call IQQQ展擎主前调正程(实结类型:="sCCC", 是否外簿:=False, 是否筛决策:=True, 是否剔黑:=True, 参of筛决策剔池:=True, 参of筛决策详表:=False, 出章模式:="月护", 出节模式:="日层")
End Sub
Sub IQQQ展擎主前调_sCCC式决策简按月护周波()
    Call IQQQ展擎主前调正程(实结类型:="sCCC", 是否外簿:=False, 是否筛决策:=True, 是否剔黑:=True, 参of筛决策剔池:=True, 参of筛决策详表:=False, 出章模式:="月护", 出节模式:="周地")
End Sub
'========================================================================================
'========================================================================================
'QQQ：即时版
'========================================================================================
'========================================================================================
Sub IQQQ展擎主前调_cCCC式决策简按混日机()
    Call IQQQ展擎主前调正程(实结类型:="cCCC", 是否外簿:=False, 是否筛决策:=True, 是否剔黑:=True, 参of筛决策剔池:=True, 参of筛决策详表:=False, 出章模式:="混", 出节模式:="日机")
End Sub
Sub IQQQ展擎主前调_cCCC式决策简按月护日层()
    Call IQQQ展擎主前调正程(实结类型:="cCCC", 是否外簿:=False, 是否筛决策:=True, 是否剔黑:=True, 参of筛决策剔池:=True, 参of筛决策详表:=False, 出章模式:="月护", 出节模式:="日层")
End Sub
Sub IQQQ展擎主前调_cCCC式决策详按月护日层()
    Call IQQQ展擎主前调正程(实结类型:="cCCC", 是否外簿:=False, 是否筛决策:=True, 是否剔黑:=False, 参of筛决策剔池:=False, 参of筛决策详表:=True, 出章模式:="月护", 出节模式:="日层")
End Sub
Sub IQQQ展擎主前调_cCCC式决策简按月护周波()
    Call IQQQ展擎主前调正程(实结类型:="cCCC", 是否外簿:=False, 是否筛决策:=True, 是否剔黑:=True, 参of筛决策剔池:=True, 参of筛决策详表:=False, 出章模式:="月护", 出节模式:="周地")
End Sub
Sub IQQQ展擎主前调_cCCC式决策详按月护周波()
    Call IQQQ展擎主前调正程(实结类型:="cCCC", 是否外簿:=False, 是否筛决策:=True, 是否剔黑:=False, 参of筛决策剔池:=False, 参of筛决策详表:=True, 出章模式:="月护", 出节模式:="周地", 是否筛市类:=True)
End Sub
'Sub IQQQ展擎主前调_cCCC式细分市类按周层()
'    Call IQQQ展擎主前调正程(实结类型:="cCCC", 是否外簿:=False, 是否剔黑:=False, 是否筛市类:=True, 出节模式:="周层")
'End Sub
'Sub IQQQ展擎主前调_cCCC式细分市类按日层()
'    Call IQQQ展擎主前调正程(实结类型:="cCCC", 是否外簿:=False, 是否剔黑:=False, 是否筛市类:=True, 出节模式:="日层")
'End Sub
Sub IQQQ展擎主前调_cCCC式细分股性()
    Call IQQQ展擎主前调正程(实结类型:="cCCC", 是否外簿:=False, 是否剔黑:=False, 是否筛股性:=True)
End Sub
Sub IQQQ展擎主前调_cCCC式频谱日类视角()
    Call IQQQ展擎主前调正程(实结类型:="cCCC", 是否外簿:=False, 是否剔黑:=False, 是否筛频谱:=True, 参of筛频谱日类:=True)
End Sub
Sub IQQQ展擎主前调_cCCC式频谱周类视角()
    Call IQQQ展擎主前调正程(实结类型:="cCCC", 是否外簿:=False, 是否剔黑:=False, 是否筛频谱:=True, 参of筛频谱日类:=False)
End Sub
Sub IQQQ展擎主前调_cCCC式决策详按月护日层外簿()
    Call IQQQ展擎主前调正程(实结类型:="cCCC", 是否外簿:=True, 是否剔黑:=False, 是否筛决策:=True, 参of筛决策剔池:=False, 参of筛决策详表:=True, 是否筛市类:=True, 是否筛频谱:=True, 出章模式:="月护", 出节模式:="日层")
End Sub
Sub IQQQ展擎主前调_cCCC式决策详按月护周波外簿()
    Call IQQQ展擎主前调正程(实结类型:="cCCC", 是否外簿:=True, 是否剔黑:=False, 是否筛决策:=True, 参of筛决策剔池:=False, 参of筛决策详表:=True, 是否筛市类:=True, 是否筛频谱:=True, 出章模式:="月护", 出节模式:="周地")
End Sub
'========================================================================================
'========================================================================================
'QQQ：实时sSCC版
'========================================================================================
'========================================================================================
Sub IQQQ展擎主前调_sSCC式决策简按混日机()
    Call IQQQ展擎主前调正程(实结类型:="sSCC", 是否外簿:=False, 是否筛决策:=True, 是否剔黑:=True, 参of筛决策剔池:=True, 参of筛决策详表:=False, 出章模式:="混", 出节模式:="日机")
End Sub
Sub IQQQ展擎主前调_sSCC式决策简按月护日层()
    Call IQQQ展擎主前调正程(实结类型:="sSCC", 是否外簿:=False, 是否筛决策:=True, 是否剔黑:=True, 参of筛决策剔池:=True, 参of筛决策详表:=False, 出章模式:="月护", 出节模式:="日层")
End Sub
Sub IQQQ展擎主前调_sSCC式决策详按月护日层()
    Call IQQQ展擎主前调正程(实结类型:="sSCC", 是否外簿:=False, 是否筛决策:=True, 是否剔黑:=False, 参of筛决策剔池:=False, 参of筛决策详表:=True, 出章模式:="月护", 出节模式:="日层")
End Sub
Sub IQQQ展擎主前调_sSCC式决策简按月护周波()
    Call IQQQ展擎主前调正程(实结类型:="sSCC", 是否外簿:=False, 是否筛决策:=True, 是否剔黑:=True, 参of筛决策剔池:=True, 参of筛决策详表:=False, 出章模式:="月护", 出节模式:="周地")
End Sub
Sub IQQQ展擎主前调_sSCC式决策详按月护周波()
    Call IQQQ展擎主前调正程(实结类型:="sSCC", 是否外簿:=False, 是否筛决策:=True, 是否剔黑:=False, 参of筛决策剔池:=False, 参of筛决策详表:=True, 出章模式:="月护", 出节模式:="周地", 是否筛市类:=True)
End Sub
'Sub IQQQ展擎主前调_sSCC式细分市类按周层()
'    Call IQQQ展擎主前调正程(实结类型:="sSCC", 是否外簿:=False, 是否剔黑:=False, 是否筛市类:=True, 出节模式:="周层")
'End Sub
'Sub IQQQ展擎主前调_sSCC式细分市类按日层()
'    Call IQQQ展擎主前调正程(实结类型:="sSCC", 是否外簿:=False, 是否剔黑:=False, 是否筛市类:=True, 出节模式:="日层")
'End Sub
Sub IQQQ展擎主前调_sSCC式细分股性()
    Call IQQQ展擎主前调正程(实结类型:="sSCC", 是否外簿:=False, 是否剔黑:=False, 是否筛股性:=True)
End Sub
Sub IQQQ展擎主前调_sSCC式频谱日类视角()
    Call IQQQ展擎主前调正程(实结类型:="sSCC", 是否外簿:=False, 是否剔黑:=False, 是否筛频谱:=True, 参of筛频谱日类:=True)
End Sub
Sub IQQQ展擎主前调_sSCC式频谱周类视角()
    Call IQQQ展擎主前调正程(实结类型:="sSCC", 是否外簿:=False, 是否剔黑:=False, 是否筛频谱:=True, 参of筛频谱日类:=False)
End Sub
Sub IQQQ展擎主前调_sSCC式决策详按月护日层外簿()
    Call IQQQ展擎主前调正程(实结类型:="sSCC", 是否外簿:=True, 是否剔黑:=False, 是否筛决策:=True, 参of筛决策剔池:=False, 参of筛决策详表:=True, 是否筛市类:=True, 是否筛频谱:=True, 出章模式:="月护", 出节模式:="日层")
End Sub
Sub IQQQ展擎主前调_sSCC式决策详按月护周波外簿()
    Call IQQQ展擎主前调正程(实结类型:="sSCC", 是否外簿:=True, 是否剔黑:=False, 是否筛决策:=True, 参of筛决策剔池:=False, 参of筛决策详表:=True, 是否筛市类:=True, 是否筛频谱:=True, 出章模式:="月护", 出节模式:="周地")
End Sub
'========================================================================================
'========================================================================================
'QQQ：实时sSSC版
'========================================================================================
'========================================================================================
Sub IQQQ展擎主前调_sSSC式决策简按混日机()
    Call IQQQ展擎主前调正程(实结类型:="sSSC", 是否外簿:=False, 是否筛决策:=True, 是否剔黑:=True, 参of筛决策剔池:=True, 参of筛决策详表:=False, 出章模式:="混", 出节模式:="日机")
End Sub
Sub IQQQ展擎主前调_sSSC式决策简按月护日层()
    Call IQQQ展擎主前调正程(实结类型:="sSSC", 是否外簿:=False, 是否筛决策:=True, 是否剔黑:=True, 参of筛决策剔池:=True, 参of筛决策详表:=False, 出章模式:="月护", 出节模式:="日层")
End Sub
Sub IQQQ展擎主前调_sSSC式决策详按月护日层()
    Call IQQQ展擎主前调正程(实结类型:="sSSC", 是否外簿:=False, 是否筛决策:=True, 是否剔黑:=False, 参of筛决策剔池:=False, 参of筛决策详表:=True, 出章模式:="月护", 出节模式:="日层")
End Sub
Sub IQQQ展擎主前调_sSSC式决策简按月护周波()
    Call IQQQ展擎主前调正程(实结类型:="sSSC", 是否外簿:=False, 是否筛决策:=True, 是否剔黑:=True, 参of筛决策剔池:=True, 参of筛决策详表:=False, 出章模式:="月护", 出节模式:="周地")
End Sub
Sub IQQQ展擎主前调_sSSC式决策详按月护周波()
    Call IQQQ展擎主前调正程(实结类型:="sSSC", 是否外簿:=False, 是否筛决策:=True, 是否剔黑:=False, 参of筛决策剔池:=False, 参of筛决策详表:=True, 出章模式:="月护", 出节模式:="周地", 是否筛市类:=True)
End Sub
'Sub IQQQ展擎主前调_sSSC式细分市类按周层()
'    Call IQQQ展擎主前调正程(实结类型:="sSSC", 是否外簿:=False, 是否剔黑:=False, 是否筛市类:=True, 出节模式:="周层")
'End Sub
'Sub IQQQ展擎主前调_sSSC式细分市类按日层()
'    Call IQQQ展擎主前调正程(实结类型:="sSSC", 是否外簿:=False, 是否剔黑:=False, 是否筛市类:=True, 出节模式:="日层")
'End Sub
Sub IQQQ展擎主前调_sSSC式频谱日类视角()
    Call IQQQ展擎主前调正程(实结类型:="sSSC", 是否外簿:=False, 是否剔黑:=False, 是否筛频谱:=True, 参of筛频谱日类:=True)
End Sub
Sub IQQQ展擎主前调_sSSC式频谱周类视角()
    Call IQQQ展擎主前调正程(实结类型:="sSSC", 是否外簿:=False, 是否剔黑:=False, 是否筛频谱:=True, 参of筛频谱日类:=False)
End Sub
Sub IQQQ展擎主前调_sSSC式决策详按月护日层外簿()
    Call IQQQ展擎主前调正程(实结类型:="sSSC", 是否外簿:=True, 是否剔黑:=False, 是否筛决策:=True, 参of筛决策剔池:=False, 参of筛决策详表:=True, 是否筛市类:=True, 是否筛频谱:=True, 出章模式:="月护", 出节模式:="日层")
End Sub
Sub IQQQ展擎主前调_sSSC式决策详按月护周波外簿()
    Call IQQQ展擎主前调正程(实结类型:="sSSC", 是否外簿:=True, 是否剔黑:=False, 是否筛决策:=True, 参of筛决策剔池:=False, 参of筛决策详表:=True, 是否筛市类:=True, 是否筛频谱:=True, 出章模式:="月护", 出节模式:="周地")
End Sub
'========================================================================================
'========================================================================================
'QQQ：实时sSSS版
'========================================================================================
'========================================================================================
Sub IQQQ展擎主前调_sSSS式决策简按混日层()
    Call IQQQ展擎主前调正程(实结类型:="sSSS", 是否外簿:=False, 是否筛决策:=True, 是否剔黑:=True, 参of筛决策剔池:=True, 参of筛决策详表:=False, 出章模式:="混", 出节模式:="日层")
End Sub
Sub IQQQ展擎主前调_sSSS式决策详按月护日层()
    Call IQQQ展擎主前调正程(实结类型:="sSSS", 是否外簿:=False, 是否筛决策:=True, 是否剔黑:=False, 参of筛决策剔池:=False, 参of筛决策详表:=True, 出章模式:="月护", 出节模式:="日层")
End Sub
Sub IQQQ展擎主前调_sSSS式决策简按月护周波()
    Call IQQQ展擎主前调正程(实结类型:="sSSS", 是否外簿:=False, 是否筛决策:=True, 是否剔黑:=True, 参of筛决策剔池:=True, 参of筛决策详表:=False, 出章模式:="月护", 出节模式:="周地")
End Sub
Sub IQQQ展擎主前调_sSSS式决策详按月护周波()
    Call IQQQ展擎主前调正程(实结类型:="sSSS", 是否外簿:=False, 是否筛决策:=True, 是否剔黑:=False, 参of筛决策剔池:=False, 参of筛决策详表:=True, 出章模式:="月护", 出节模式:="周地")
End Sub
'Sub IQQQ展擎主前调_sSSS式细分市类按周层()
'    Call IQQQ展擎主前调正程(实结类型:="sSSS", 是否外簿:=False, 是否剔黑:=False, 是否筛市类:=True, 出节模式:="周层")
'End Sub
'Sub IQQQ展擎主前调_sSSS式细分市类按日层()
'    Call IQQQ展擎主前调正程(实结类型:="sSSS", 是否外簿:=False, 是否剔黑:=False, 是否筛市类:=True, 出节模式:="日层")
'End Sub
Sub IQQQ展擎主前调_sSSS式频谱日类视角()
    Call IQQQ展擎主前调正程(实结类型:="sSSS", 是否外簿:=False, 是否剔黑:=False, 是否筛频谱:=True, 参of筛频谱日类:=True)
End Sub
Sub IQQQ展擎主前调_sSSS式频谱周类视角()
    Call IQQQ展擎主前调正程(实结类型:="sSSS", 是否外簿:=False, 是否剔黑:=False, 是否筛频谱:=True, 参of筛频谱日类:=False)
End Sub
Sub IQQQ展擎主前调_sSSS式决策详按月护日层外簿()
    Call IQQQ展擎主前调正程(实结类型:="sSSS", 是否外簿:=True, 是否剔黑:=False, 是否筛决策:=True, 参of筛决策剔池:=False, 参of筛决策详表:=True, 是否筛市类:=True, 是否筛频谱:=True, 出章模式:="月护", 出节模式:="日层")
End Sub
Sub IQQQ展擎主前调_sSSS式决策详按月护周波外簿()
    Call IQQQ展擎主前调正程(实结类型:="sSSS", 是否外簿:=True, 是否剔黑:=False, 是否筛决策:=True, 参of筛决策剔池:=False, 参of筛决策详表:=True, 是否筛市类:=True, 是否筛频谱:=True, 出章模式:="月护", 出节模式:="周地")
End Sub
'========================================================================================
'########################################################################################
'########################################################################################
'#####################################   QQQ  花天调用   #################################
'########################################################################################
'########################################################################################






'########################################################################################
'########################################################################################
'#####################################   QQQ  花港调用   #################################
'########################################################################################
'########################################################################################
'========================================================================================
'========================================================================================
'QQQ：即时版
'========================================================================================
'========================================================================================
Sub IQQQ展擎主前调_花港cCCC式决策按月护周层()
    Call IQQQ展擎主前调正程(指定花册:=常花港股通, 实结类型:="cCCC", 是否外簿:=False, 是否筛决策:=True, 参of筛决策详表:=False, 出章模式:="月护", 出节模式:="周层")
End Sub
Sub IQQQ展擎主前调_花港cCCC式频谱周类视角()
    Call IQQQ展擎主前调正程(指定花册:=常花港股通, 实结类型:="cCCC", 是否外簿:=False, 是否筛频谱:=True)
End Sub
Sub IQQQ展擎主前调_花港cCCC式外簿()
    Call IQQQ展擎主前调正程(指定花册:=常花港股通, 实结类型:="cCCC", 是否外簿:=True, 参of筛决策剔池:=False, 是否筛频谱:=True)
End Sub
'########################################################################################
'########################################################################################
'#####################################   QQQ  花港调用   #################################
'########################################################################################
'########################################################################################







'########################################################################################
'########################################################################################
'#####################################  QQQ 引擎正程   ###################################
'########################################################################################
'########################################################################################
'========================================================================================
'========================================================================================
'QQQ：设置输出
'========================================================================================
'========================================================================================
Function IQQQ展擎主前调正程( _
          Optional ByVal 指定花册 As String = 常花中股 _
        , Optional ByVal 研究日期 As Date _
        , Optional ByVal 实结类型 As String = "cCCC" _
        , Optional ByVal 是否剔黑 As Boolean = False _
        , Optional ByVal 是否外簿 As Boolean = True _
        , Optional ByVal 是否筛频谱 As Boolean = False _
        , Optional ByVal 参of筛频谱日类 As Boolean = False _
        , Optional ByVal 是否筛决策 As Boolean = False _
        , Optional ByVal 参of筛决策剔池 As Boolean = False _
        , Optional ByVal 参of筛决策详表 As Boolean = False _
        , Optional ByVal 是否筛市类 As Boolean = False _
        , Optional ByVal 是否筛股性 As Boolean = False _
        , Optional ByVal 基色底 As Long = 常色主绿 _
        , Optional ByVal 出章模式 As String = "" _
        , Optional ByVal 出节模式 As String = "周层" _
        , Optional ByRef WB As Workbook _
        ) As String
'========================================================================================
    Dim TT As Long
    TT = Timer
    Dim 计时过程 As Integer
    Dim TTT As Long
'========================================================================================
'运行：生成全息
'========================================================================================
    Dim MSG As String
    MSG = MSG & "【花册】" & 指定花册 & vbCrLf
    MSG = MSG & "【结算类型】" & 实结类型 & vbCrLf
    MSG = MSG & "【是否详简】" & IIf(参of筛决策详表 = True, "详", "简") & vbCrLf
    MSG = MSG & "【出章模式】" & 出章模式 & vbCrLf
    MSG = MSG & "【出节模式】" & 出节模式 & vbCrLf
    '------------------------------------------------------------------------------------
    '生成全息
    '------------------------------------------------------------------------------------
    Dim 谕组 As Variant
    Dim 计数全息 As Integer
    TTT = Timer
    If 是否剔黑 = True Then
        计数全息 = IQQQ跨码据擎_数程生成全息(谕组, 指定花册, 研究日期:=研究日期, 实结类型:=实结类型, 采样列号:=-1)
    Else
        计数全息 = IQQQ跨码据擎_数程生成全息(谕组, 指定花册, 研究日期:=研究日期, 实结类型:=实结类型)
    End If
    MSG = MSG & "【QQQ全息】" & 计数全息 & vbCrLf
    MSG = MSG & ">>QQQ全息耗时：" & CInt(Timer - TT) & vbCrLf
    '------------------------------------------------------------------------------------
    If 计数全息 = 0 Then Exit Function
'========================================================================================
    UTL宏工具_BEGIN
    '====================================================================================
    '设置工簿
    '====================================================================================
    Dim 是否另存 As Boolean
    Dim 是否弹窗 As Boolean
    If 是否外簿 = False Then
            Set WB = ThisWorkbook
            是否另存 = False
            是否弹窗 = True
    Else
        If WB Is Nothing Then
            Set WB = Workbooks.Add
            是否另存 = True
            是否弹窗 = True
        Else    '已指定外部输出文件
            是否另存 = False
            是否弹窗 = False
        End If
    End If
'========================================================================================
'输出：顺序决定工作表的前后关系
'========================================================================================
    '====================================================================================
    '输出：频谱
    '====================================================================================
    If 是否筛频谱 = True Then
            TTT = Timer
            MSG = MSG & "【QQQ输出频谱】" & IIf(参of筛频谱日类 = True, "日类视角", "周类视角") & vbCrLf
            MSG = MSG & IQQQ展擎频谱输出分程(WB, 谕组, 参of筛频谱日类:=参of筛频谱日类, 实结类型:=实结类型)
            MSG = MSG & ">>QQQ输出频谱耗时：" & CInt(Timer - TTT) & vbCrLf
    End If
    '====================================================================================
    '输出：市类
    '注20240222：不要将【市类】合并至【决策】，通过分散降低运行耗时。
    '====================================================================================
    If 是否筛市类 = True Then
            TTT = Timer
            MSG = MSG & "【QQQ筛选市类】" & vbCrLf
            MSG = MSG & IQQQ展擎筛程至A2册按市类(WB, 谕组, 出章模式:=出章模式, 出节模式:=出节模式)
            MSG = MSG & ">>QQQ输出市类耗时：" & CInt(Timer - TTT) & vbCrLf
    End If
    '====================================================================================
    '输出：决策
    '====================================================================================
    If 是否筛决策 = True Then
            TTT = Timer
            MSG = MSG & "【QQQ筛选决策】" & vbCrLf
            '            If 参of筛决策详表 = True Then
            '                MSG = MSG & IQQQ展擎筛程至A2册按市类(WB, 谕组, 出节模式:=出节模式)
            '            End If
            MSG = MSG & IQQQ展擎筛程至A1册按全数据(WB, 谕组, 参of筛决策剔池:=参of筛决策剔池, 参of筛决策详表:=参of筛决策详表, 出章模式:=出章模式, 出节模式:=出节模式)
            MSG = MSG & ">>QQQ输出决策耗时：" & CInt(Timer - TTT) & vbCrLf
    End If
    '====================================================================================
    '输出：股性
    '====================================================================================
    If 是否筛股性 = True Then
            TTT = Timer
            MSG = MSG & "【QQQ筛选股性】" & vbCrLf
            MSG = MSG & IQQQ展擎筛程至A9册按股性(WB, 谕组, 出章模式:=出章模式, 出节模式:=出节模式)
            MSG = MSG & ">>QQQ输出股性耗时：" & CInt(Timer - TTT) & vbCrLf
    End If
    '====================================================================================
    Erase 谕组
'========================================================================================
'保存：外部存档
'========================================================================================
If 是否另存 = True Then
    '------------------------------------------------------------------------------------
    '设置名称
    '------------------------------------------------------------------------------------
    Dim 工簿简称 As String
    Dim 工簿路径 As String
    If 实结类型 Like "SS*" Then
        研究日期 = Now()
    ElseIf 研究日期 = 0 Then
        Dim WS花册 As Worksheet
        If STBASE外簿工具_花册链接(WS花册, 常花中股) = False Then
            UTL宏工具_END
            Exit Function
        End If
        研究日期 = STBASE取据引擎查时戳由花册前结期(WS花册, 基列:=花列甲道)
    End If
    工簿简称 = String(3, 常簿缀市板) & Format$(研究日期, "YYYYMMDD")
    工簿路径 = ThisWorkbook.Path & "\" & 工簿简称 & ".xlsx"
    '------------------------------------------------------------------------------------
    '进行保存
    '------------------------------------------------------------------------------------
    If WB.Name <> ThisWorkbook.Name Then
        MSG = MSG & vbCrLf & PBASE格程工具_表操保存外簿(WB, 工簿简称)
        'WB.Close
        WB.Activate
    End If
    Set WB = Nothing
    '------------------------------------------------------------------------------------
End If
'========================================================================================
'结束
'========================================================================================
    UTL宏工具_END
    '------------------------------------------------------------------------------------
    MSG = MSG & ">>QQQ全部耗时：" & CInt(Timer - TT) & vbCrLf
    IQQQ展擎主前调正程 = MSG
    If 是否弹窗 = True Then
        MsgBox MSG, Title:="QQQ引擎"
    End If
    Debug.Print MSG
'========================================================================================
End Function
'########################################################################################
'########################################################################################
'#####################################  QQQ 引擎正程   ###################################
'########################################################################################
'########################################################################################







