Attribute VB_Name = "IQQQ跨码_P展擎1筛选"
Public Const 常列标签类别 = 位qt代码
Public Const 常列标签计数 = 位谕of日基月局          '位qt在池                '位qt行益
Public Const 常列标签注释 = 位谕of日层联动          '位qt在池        '注意：避免备隐藏





Function IQQQ展擎筛程至A1册按全数据( _
          ByRef WB As Workbook _
        , ByRef 谕组 As Variant _
        , Optional ByVal 参of筛决策剔池 As Boolean = True _
        , Optional ByVal 参of筛决策详表 As Boolean = False _
        , Optional ByVal 出章模式 As String = "" _
        , Optional ByVal 出节模式 As String = "周层" _
        , Optional ByVal 出全是否 As Boolean = True _
        ) As String
'========================================================================================
'验证
'========================================================================================
    Dim 计数谕组 As Integer
    计数谕组 = UBound(谕组, 1) - LBound(谕组, 1) + 1
    If 计数谕组 = 0 Then Exit Function
'    '------------------------------------------------------------------------------------
'    '输出数组：测试
'    '------------------------------------------------------------------------------------
'    Dim WSYM As Worksheet
'    Call PBASE格程工具_表操工表新增(WSYM, "SSS", WB:=ThisWorkbook, 基色底:=常色十红)
'    Call UTL数据转换_集ARR2WS(谕组, WSYM)
'========================================================================================
'声明变量
'========================================================================================
    Dim 本程前缀 As String
    本程前缀 = 常簿缀选日 & "Y"
    '--------------------------------------------------
    Dim MSG As String
    Dim 表名 As String
    Dim CIDL As String
    Dim X  As Integer
    '--------------------------------------------------
    Dim 计码股萎变活 As Integer
    计码股萎变活 = 0
    Dim 计码股萎始终 As Integer
    计码股萎始终 = 0
    Dim 计码股Qb As Integer
    计码股Qb = 0
    Dim 计码股Q8 As Integer
    计码股Q8 = 0
    Dim 计码股Qo As Integer
    计码股Qo = 0
    Dim 计码池黑 As Integer
    计码池黑 = 0
    Dim 计码池内 As Integer
    计码池内 = 0
    Dim 计码池外 As Integer
    计码池外 = 0
    Dim 计码市指 As Integer
    计码市指 = 0
    Dim 计码市基 As Integer
    计码市基 = 0
    Dim 计码股总 As Integer
    计码股总 = 0
    '-----------------------------------------------
    Dim 计码股月尊比柱A As Integer
    计码股月尊比柱A = 0
    Dim 计码股月尊比柱B As Integer
    计码股月尊比柱B = 0
    Dim 计码股月尊比柱C As Integer
    计码股月尊比柱C = 0
    Dim 计码股月尊比柱D As Integer
    计码股月尊比柱D = 0
    '-----------------------------------------------
    Dim 计码股日DJEC之上甲 As Integer
    计码股日DJEC之上甲 = 0
    Dim 计码股日DJEC之上乙 As Integer
    计码股日DJEC之上乙 = 0
    '--------------------------------------------------
    '周层三鳄第二位分布
    Dim 计码三鳄金 As Integer
    计码三鳄金 = 0
    Dim 计码三鳄银 As Integer
    计码三鳄银 = 0
    Dim 计码三鳄嘘 As Integer
    计码三鳄嘘 = 0
    Dim 计码三鳄唏 As Integer
    计码三鳄唏 = 0
    Dim 计码三鳄屎 As Integer
    计码三鳄屎 = 0
    Dim 计码三鳄尿 As Integer
    计码三鳄尿 = 0
    '-----------------------------------------------
'========================================================================================
'定义典
'========================================================================================
    '------------------------------------------------------------------------------------
    '复盘
    '------------------------------------------------------------------------------------
    Dim 典统周复_幅高20 As New Dictionary
    Dim 典统周复_幅高10 As New Dictionary
    Dim 典统周复_幅涨负10 As New Dictionary
    Dim 典统周复_幅涨负20 As New Dictionary
    Dim 典统周复_幅高零 As New Dictionary
    '-----------------------------------------------------------
    Dim 典筛复日_停今甲 As New Dictionary
    Dim 典筛复日_停今乙 As New Dictionary
    Dim 典筛复日_停今丙 As New Dictionary
    Dim 典筛复日_停今丁 As New Dictionary
    Dim 典筛复日_幅涨4 As New Dictionary
    Dim 典筛复日_幅高4 As New Dictionary
    Dim 典筛复日_停十数3 As New Dictionary
    '------------------------------------------------------------------------------------
    '周复盘：区分仨内是否出现过涨停
    '------------------------------------------------------------------------------------
    Dim 典统周复_周单列屎尿嘘甲 As New Dictionary
    Dim 典统周复_周单列屎尿嘘乙 As New Dictionary
    Dim 典统周复_周单列被 As New Dictionary
    Dim 典统周复_周单列唏 As New Dictionary
    Dim 典统周复_周单列银 As New Dictionary
    Dim 典统周复_周单列警 As New Dictionary
    Dim 典统周复_周活龙猪 As New Dictionary
    Dim 典统周复_周活龙管 As New Dictionary
    Dim 典统周复_周活头震 As New Dictionary
    Dim 典统周复_周萎龙猪 As New Dictionary
    Dim 典统周复_周萎龙管 As New Dictionary
    Dim 典统周复_周萎头震 As New Dictionary
    '------------------------------------------------------------------------------------
    '周层
    '------------------------------------------------------------------------------------
    Dim 典集筛已在池持 As New Dictionary
    Dim 典集筛已在池今 As New Dictionary
    Dim 典集筛已在池白 As New Dictionary
    '---------------------------------------
    Dim 典集筛股性非 As New Dictionary
    Dim 典集筛股性微 As New Dictionary
    Dim 典集筛股性萎 As New Dictionary
    Dim 典集筛股性活 As New Dictionary
    '---------------------------------------
    Dim 典集市板Qe As New Dictionary
    Dim 典集市板Qe2 As New Dictionary
    Dim 典集市板ST As New Dictionary
    Dim 典集市板Qb As New Dictionary
    Dim 典集市板Q8 As New Dictionary
    '------------------------------------------------------------------------------------
    '【日机】
    '------------------------------------------------------------------------------------
    Dim 典筛日外月护屎尿嘘例外 As New Dictionary
    Dim 典筛日外月护M2e As New Dictionary
    Dim 典筛日外月护M3v As New Dictionary
    Dim 典筛日外月护余 As New Dictionary
    '---------------------------------------
    Dim 典筛日外月护A3 As New Dictionary
    Dim 典筛日外月护A1 As New Dictionary
    Dim 典筛日外月护A0 As New Dictionary
    Dim 典筛日外月护C6 As New Dictionary
    Dim 典筛日外月护C4 As New Dictionary
    Dim 典筛日外月护C0 As New Dictionary
    '---------------------------------------
    Dim 典筛日外A7低波_日高lt1 As New Dictionary
    Dim 典筛日外A7低波 As New Dictionary
    Dim 典筛日外A7败多 As New Dictionary
    '---------------------------------------
    Dim 典筛日外A7常_渡区再B As New Dictionary
    Dim 典筛日外A7常_渡区再C As New Dictionary
    Dim 典筛日外A7常_渡区再D As New Dictionary
    Dim 典筛日外月护C7初储 As New Dictionary
    Dim 典筛日外月护A7破 As New Dictionary
    '---------------------------------------
    Dim 典筛日外A7常_剔周丘幅80 As New Dictionary
    Dim 典筛日外A7常_汇震正〇 As New Dictionary
    Dim 典筛日外A7常_汇震WJA劫 As New Dictionary
    Dim 典筛日外A7常_汇头WJB劫 As New Dictionary
    '---------------------------------------
    Dim 典筛日外A7常_主区龙管根 As New Dictionary
    Dim 典筛日外A7常_主区龙管余 As New Dictionary
    Dim 典筛日外A7常_主区龙猪首 As New Dictionary
    Dim 典筛日外A7常_主区龙猪地型4 As New Dictionary
    Dim 典筛日外A7常_主区龙猪地型0 As New Dictionary
    Dim 典筛日外A7常_主区龙猪地型1 As New Dictionary
    Dim 典筛日外A7常_主区龙猪地型2 As New Dictionary
    Dim 典筛日外A7常_主区龙猪地型3 As New Dictionary
'========================================================================================
'筛选：微观 筛群周以日阶森为准绳
'========================================================================================
For X = LBound(谕组, 1) To UBound(谕组, 1)
CIDL = 谕组(X, 位qt代码)
If UBCID是代码(CIDL) = False Then
ElseIf 谕组(X, 位qt停牌) = "S" Then                 '提出停牌
ElseIf Len(谕组(X, 位谕of日波BSHR)) = 0 Then   '剔除无属性信息
Else
    '====================================================================================
    '单独列示：池
    '====================================================================================
            If 谕组(X, 位谕of仓持数) > 0 Then
                    典集筛已在池持.Add Item:=X, Key:=CIDL
            'ElseIf (谕组(X, 位qt在池) = 常池名金 Or 谕组(X, 位qt在池) = 常池名银 Or 谕组(X, 位qt在池) = 常池名铜) Then
            '        典集筛已在池白.Add Item:=X, Key:=CIDL
            '        计码池内 = 计码池内 + 1
            End If
            If 谕组(X, 位qt今池) <> "" Then
                    典集筛已在池今.Add Item:=X, Key:=CIDL
            End If
    '====================================================================================
    '统计全市场
    '====================================================================================
            '============================================================================
            '分布：全市场月尊分布
            '============================================================================
            If 谕组(X, 位qt市板) = 常市板指 Then
                    计码市指 = 计码市指 + 1
            ElseIf 谕组(X, 位qt市板) = 常市板基 Then
                    计码市基 = 计码市基 + 1
                    If 谕组(X, 位谕of日段佰均幅高) >= 0.4 Then      '过滤债类产品
                        典集市板Qe.Add Item:=X, Key:=CIDL
                    Else
                        典集市板Qe2.Add Item:=X, Key:=CIDL
                    End If
            ElseIf InStr(谕组(X, 位qt代称), "ST") > 0 Or InStr(谕组(X, 位qt代称), "退") > 0 Then
                        '剔除：ST/退市
                        计码股ST = 计码股ST + 1
                        典集市板ST.Add Item:=X, Key:=CIDL
            Else
                    '-----------------------------------------------
                    计码股总 = 计码股总 + 1
                    '-----------------------------------------------
                    '统计：按月
                    If 谕组(X, 位谕of月道尊比柱) = "A" Then
                        计码股月尊比柱A = 计码股月尊比柱A + 1
                    ElseIf Left(谕组(X, 位谕of月道尊比柱), 1) = "B" Then
                        计码股月尊比柱B = 计码股月尊比柱B + 1
                    ElseIf Left(谕组(X, 位谕of月道尊比柱), 1) = "C" Then
                        计码股月尊比柱C = 计码股月尊比柱C + 1
                    Else
                        计码股月尊比柱D = 计码股月尊比柱D + 1
                    End If
                    '-----------------------------------------------
                    '统计：按日规则
                    If 谕组(X, 位谕of日类BTZE) > 0 And 谕组(X, 位谕of日类BTZC) > 0 Then
                        计码股日DJEC之上甲 = 计码股日DJEC之上甲 + 1
                        If 谕组(X, 位谕of日类BTZB) > 0 Then
                            计码股日DJEC之上乙 = 计码股日DJEC之上乙 + 1
                        End If
                    End If
                    '-----------------------------------------------
                    '统计前置剔除
                    If 谕组(X, 位qt市板) = 常市板票Qb Then
                        计码股Qb = 计码股Qb + 1
                        典集市板Qb.Add Item:=X, Key:=CIDL
                    ElseIf 谕组(X, 位qt市板) = 常市板票Q8 Then
                        计码股Q8 = 计码股Q8 + 1
                        典集市板Q8.Add Item:=X, Key:=CIDL
                    ElseIf 谕组(X, 位qt市板) = 常市板票Qo Then
                        计码股Qo = 计码股Qo + 1
                    ElseIf 谕组(X, 位谕of日段股性) = "12变活" Or 谕组(X, 位谕of日段股性) = "13变活" Then
                        计码股萎变活 = 计码股萎变活 + 1
                    ElseIf 谕组(X, 位谕of日段股性) = "0萎" Or 谕组(X, 位谕of日段股性) = "11蔫" Then
                        计码股萎始终 = 计码股萎始终 + 1
                    End If
                    '-----------------------------------------------
                    '统计：周层三鳄第二位分布
                    Select Case Mid(谕组(X, 位谕of周层三鳄), 2, 1)
                    Case "金"
                        计码三鳄金 = 计码三鳄金 + 1
                    Case "银"
                        计码三鳄银 = 计码三鳄银 + 1
                    Case "嘘"
                        计码三鳄嘘 = 计码三鳄嘘 + 1
                    Case "唏"
                        计码三鳄唏 = 计码三鳄唏 + 1
                    Case "屎"
                        计码三鳄屎 = 计码三鳄屎 + 1
                    Case "尿"
                        计码三鳄尿 = 计码三鳄尿 + 1
                    End Select
                    '-----------------------------------------------
            End If
    '====================================================================================
    '机会筛选：根据各单独条件筛选，参数与筛选条件要根据所在时点进行调整（时者势也）。
    '====================================================================================
    IS是否筛选下周冲高 = False
    If 谕组(X, 位qt市板) = 常市板指 Then
    ElseIf 谕组(X, 位qt市板) = 常市板基 Then
    ElseIf InStr(谕组(X, 位qt代称), "ST") > 0 Or InStr(谕组(X, 位qt代称), "退") > 0 Then
    ElseIf 谕组(X, 位qt市板) = 常市板票Qb Then
    Else
            '============================================================================
            '复盘：用于复盘本周
            '============================================================================
                '------------------------------------------------------------------------
                '复盘周类：涨幅异常
                '------------------------------------------------------------------------
                If 谕组(X, 位谕of周波临高幅) >= 20 Then
                        典统周复_幅高20.Add Item:=X, Key:=CIDL
                ElseIf 谕组(X, 位谕of周波临高幅) >= 10 Then
                        典统周复_幅高10.Add Item:=X, Key:=CIDL
                ElseIf 谕组(X, 位谕of周波临涨幅) <= -20 Then
                        典统周复_幅涨负20.Add Item:=X, Key:=CIDL
                ElseIf 谕组(X, 位谕of周波临涨幅) <= -10 Then
                        典统周复_幅涨负10.Add Item:=X, Key:=CIDL
                End If
                If 谕组(X, 位谕of周层猪操作) = "零高" Then               '操作：检查是否继续下探
                        典统周复_幅高零.Add Item:=X, Key:=CIDL
                End If
                '------------------------------------------------------------------------
                '复盘日类：涨幅异常
                '------------------------------------------------------------------------
                If 谕组(X, 位谕of日波龄BTPR9) >= 1 Then
                            If 谕组(X, 位谕of日波龄BTHR9) >= 3 Then
                                典筛复日_停今甲.Add Item:=X, Key:=CIDL
                            ElseIf 谕组(X, 位谕of日波龄BTHR9) >= 2 Then
                                典筛复日_停今乙.Add Item:=X, Key:=CIDL
                            ElseIf 谕组(X, 位谕of日波龄BTPR9) >= 1 Then
                                典筛复日_停今丙.Add Item:=X, Key:=CIDL
                            Else
                                典筛复日_停今丁.Add Item:=X, Key:=CIDL
                            End If
                Else
                            '------------------------------------------------------------
                            '非剔：剧烈波动
                            '------------------------------------------------------------
                            If 谕组(X, 位谕of日段十停数高) >= 3 Then
                                典筛复日_停十数3.Add Item:=X, Key:=CIDL
                            '------------------------------------------------------------
                            '非剔：用于单列本日较大波动。主要用于观察走势，总结能够预测大涨的规律，用于后续选股。
                            '------------------------------------------------------------
                            ElseIf 谕组(X, 位谕of日波BSPR) >= 4 Then
                                典筛复日_幅涨4.Add Item:=X, Key:=CIDL
                            ElseIf 谕组(X, 位谕of日波BSHR) >= 4 Then
                                典筛复日_幅高4.Add Item:=X, Key:=CIDL
                            End If
                            '------------------------------------------------------------
                End If
            '============================================================================
            '复盘：周机筛选
            '----------------------------------------------------------------------------
            '日类筛选：日机只在【根据周机能够预判下柱为冲高】的情况才适用。其他情况没有意义。
            '重新梳理筛选分类：
            '(1)先要把刚上破DJC、刚上破DJB的找出来。
            '(2)再把（顶，DJB）之间的找出来：对于DTZA≤2看是否入管；其余看顶型与柱排。
            '(3)最后看捡漏机会：是否存在下破DJA，下破DJB，并按周柱排列可以捡漏的机会。
            '============================================================================
                '------------------------------------------------------------------------
                '保证以下：是否过滤涨停
                '------------------------------------------------------------------------
                If 谕组(X, 位谕of日波龄BTPR9) >= 1 And InStr(出节模式, "日") > 0 Then
                    '注20260405：区分输出按日类与周类，是否剔除涨停。
                '------------------------------------------------------------------------
                '保证以下：月护符合
                '剔除/C7/C6/C4/C0
                '------------------------------------------------------------------------
                ElseIf InStr(谕组(X, 位谕of日层联动), "屎") > 0 _
                    Or InStr(谕组(X, 位谕of日层联动), "尿") > 0 _
                    Or InStr(谕组(X, 位谕of日层联动), "嘘") > 0 Then
                        If 谕组(X, 位谕of日类BTAB) > 0 Then
                            典统周复_周单列屎尿嘘甲.Add Item:=X, Key:=CIDL
                        ElseIf 谕组(X, 位谕of日类BTZB) > 0 Then
                            典统周复_周单列屎尿嘘乙.Add Item:=X, Key:=CIDL
                        End If
                ElseIf InStr(谕组(X, 位谕of日层联动), "唏") > 0 Then
                            典统周复_周单列唏.Add Item:=X, Key:=CIDL
                ElseIf InStr(谕组(X, 位谕of日层联动), "银") > 0 Then
                            典统周复_周单列银.Add Item:=X, Key:=CIDL
                '------------------------------------------------------------------------
                '以下均为：金银。寻找DXAB转正。
                '根据“日层段”分类，分别筛选（警：丁戊 DXAB负交）（被：丙 下破DJB）
                '------------------------------------------------------------------------
                ElseIf InStr(谕组(X, 位谕of日层联动), "警") > 0 Then        '日层段：丁戊
                            典统周复_周单列警.Add Item:=X, Key:=CIDL
                ElseIf InStr(谕组(X, 位谕of日层联动), "被") > 0 Then        '日层段：丙
                            典统周复_周单列被.Add Item:=X, Key:=CIDL
                '------------------------------------------------------------------------
                '区分：仨内是否出现过涨停
                '------------------------------------------------------------------------
                Else
                    '--------------------------------------------------------------------
                    '分类：仨曾出现涨停
                    '--------------------------------------------------------------------
                    If 谕组(X, 位谕of日段仨停数高) >= 1 Then
                                If InStr(谕组(X, 位谕of周层波型), "龙猪") > 0 Then
                                    典统周复_周活龙猪.Add Item:=X, Key:=CIDL
                                ElseIf InStr(谕组(X, 位谕of周层波型), "龙") > 0 Then
                                    典统周复_周活龙管.Add Item:=X, Key:=CIDL
                                Else
                                    典统周复_周活头震.Add Item:=X, Key:=CIDL
                                End If
                    '--------------------------------------------------------------------
                    '分类：其他
                    '--------------------------------------------------------------------
                    Else
                                If InStr(谕组(X, 位谕of周层波型), "龙猪") > 0 Then
                                    典统周复_周萎龙猪.Add Item:=X, Key:=CIDL
                                ElseIf InStr(谕组(X, 位谕of周层波型), "龙管") > 0 Then
                                    典统周复_周萎龙管.Add Item:=X, Key:=CIDL
                                Else
                                    典统周复_周萎头震.Add Item:=X, Key:=CIDL
                                End If
                    End If
                    '--------------------------------------------------------------------
                End If
            '============================================================================
            '============================================================================
            '复盘：用于筛选“下周冲高”机会。
            '注20260110：不要/（低）波动太小/（败）失败太多/（暴）本周涨幅太大/（/X4/X0）下降趋势/顶部震荡
            '============================================================================
            '============================================================================
                    '--------------------------------------------------------------------
                    '过滤：今池
                    '作用20250309：重点关注并在后续筛选中剔除，提高甄别效率。所有分类按照最有后续希望上涨的种类进行分类和排序，从而避免选到今池后不给与充分重视。
                    '--------------------------------------------------------------------
                    If 谕组(X, 位qt今池) <> "" Then
                    '--------------------------------------------------------------------
                    '剔：特殊形态【特停】
                    '注20241023：剔除【涨停】所包含个股，避免重复包含。以下两个条件已经包含在【涨停】筛选之中。
                    '注20241023：此处选择过滤HR8而不是PR8，主要有两个原因，一个是观察冲高规律；另一个是提醒冲高后要及时止盈。
                    '注20260405：区分输出按日类与周类，是否剔除涨停。
                    '--------------------------------------------------------------------
                    ElseIf 谕组(X, 位谕of日波龄BTPR9) >= 1 And InStr(出节模式, "日") > 0 Then
                            If 谕组(X, 位谕of日波龄BTHR9) >= 2 Then
                            ElseIf 谕组(X, 位谕of日波龄BTPR9) >= 1 Then
                            Else
                                IS是否筛选下周冲高 = True       '衔接：后续筛选下周冲高
                            End If
                    '--------------------------------------------------------------------
                    '过滤：                    '
                    '--------------------------------------------------------------------
                    Else
                            '衔接：后续筛选下周冲高
                            IS是否筛选下周冲高 = True
                    End If
            '============================================================================
            '【接力筛选】下柱冲高
            '============================================================================
            If IS是否筛选下周冲高 = True Then
                '------------------------------------------------------------------------
                '剔：不符合，不认为是机会
                '注20260110：要符合WXAB在日类的展开DXCD＞0，以及基本要求WJC在日类的展开DXZE＞0。
                '------------------------------------------------------------------------
                    '--------------------------------------------------------------------
                    '过滤破线：DJE
                    '--------------------------------------------------------------------
                    If (InStr(谕组(X, 位谕of周层三鳄), "屎") > 0 Or InStr(谕组(X, 位谕of周层三鳄), "尿") > 0 Or InStr(谕组(X, 位谕of周层三鳄), "嘘") > 0) _
                    And 谕组(X, 位谕of周类BTZB) > 0 Then
                                    典筛日外月护屎尿嘘例外.Add Item:=X, Key:=CIDL
                    '--------------------------------------------------------------------
                    '过滤破线：DJE
                    '--------------------------------------------------------------------
                    ElseIf 谕组(X, 位谕of日类BTZE) < 0 Then
                    '--------------------------------------------------------------------
                    '过滤破线：DJD
                    '注20250120：将BTZE<0与BTZD<0统一为BTZD<0，作为这种方案，用于发现潜在的备选。
                    '--------------------------------------------------------------------
                    ElseIf 谕组(X, 位谕of日类BTZD) < 0 Then
                '------------------------------------------------------------------------
                '过滤：按月阶
                '------------------------------------------------------------------------
                    '--------------------------------------------------------------------
                    '单列：潜在上升趋势
                    '注20261010：要将B1与B0分别，在底部会有多次震荡，B1的等级要比B0高很多。
                    '--------------------------------------------------------------------
                    ElseIf InStr(谕组(X, 位谕of周道月势), "A3") > 0 Or 谕组(X, 位谕of周基月局) = "1e" Then
                                    '应属于主升，但存续时间非常短。故统一提取出来，作为潜在主升。
                                    典筛日外月护A3.Add Item:=X, Key:=CIDL
                    ElseIf InStr(谕组(X, 位谕of周道月势), "A1") > 0 Then
                                    典筛日外月护A1.Add Item:=X, Key:=CIDL
                    ElseIf InStr(谕组(X, 位谕of周道月势), "A0") > 0 Then
                                    典筛日外月护A0.Add Item:=X, Key:=CIDL
                    '--------------------------------------------------------------------
                    '单列：下降趋势中的反弹，没有参与的必要。
                    '--------------------------------------------------------------------
                    ElseIf InStr(谕组(X, 位谕of周道月势), "C0") > 0 Then
                                    典筛日外月护C0.Add Item:=X, Key:=CIDL
                    ElseIf InStr(谕组(X, 位谕of周道月势), "C4") > 0 Then
                                    典筛日外月护C4.Add Item:=X, Key:=CIDL
                    ElseIf InStr(谕组(X, 位谕of周道月势), "C6") > 0 Then
                                    典筛日外月护C6.Add Item:=X, Key:=CIDL
                    '--------------------------------------------------------------------
                    '单列：非A7、非C7
                    '--------------------------------------------------------------------
                    ElseIf InStr(谕组(X, 位谕of周道月势), "A7") = 0 And InStr(谕组(X, 位谕of周道月势), "C7") = 0 Then
                                If 谕组(X, 位谕of周基月局) = "2e" Then
                                    典筛日外月护M2e.Add Item:=X, Key:=CIDL
                                ElseIf 谕组(X, 位谕of周基月局) = "3v" Or 谕组(X, 位谕of周基月局) = "4v" Then
                                    典筛日外月护M3v.Add Item:=X, Key:=CIDL
                                Else
                                    典筛日外月护余.Add Item:=X, Key:=CIDL
                                End If
                    '--------------------------------------------------------------------
                    '单列：C7潜在顶部震荡。
                    '注20260320：此处将所有C7集中，因为WXBC劫仅有极少会成为“主升”，所以在此处集中。从而，即使是<低波><败多>，也不包含WXBC情况。
                    '--------------------------------------------------------------------
                    ElseIf InStr(谕组(X, 位谕of周道月势), "C7") > 0 Then
                                    典筛日外月护C7初储.Add Item:=X, Key:=CIDL
                                    '注20260303：因存续时间较短，且已经区分地型，不再对（储初）区分是否为龙。
                    ElseIf InStr(谕组(X, 位谕of周层界), "破") > 0 Then
                                    典筛日外月护A7破.Add Item:=X, Key:=CIDL
                '------------------------------------------------------------------------
                '注：以下都是（月护为A7）
                '------------------------------------------------------------------------
                '单列：不适用于“下周冲高”。包含/（低）波动太小/（败）失败太多/（暴）本周涨幅太大。
                '------------------------------------------------------------------------
                    '--------------------------------------------------------------------
                    '剔除：低波（不活跃）
                    '孙类：周均高幅太小。没有操作空间，不适合日类操作。
                    '孙类：日均高幅太小。没有操作空间，不适合日类操作。
                    '--------------------------------------------------------------------
                    ElseIf 谕组(X, 位谕of周波均高幅十) <= 3 Then
                                    典筛日外A7低波.Add Item:=X, Key:=CIDL
                    ElseIf 谕组(X, 位谕of日段十均幅高) <= 1.2 Then
                                    '过滤日波动过小，没有操作意义。
                                    典筛日外A7低波_日高lt1.Add Item:=X, Key:=CIDL
                    '--------------------------------------------------------------------
                    '剔除：败多（用于过滤周波动较小的情况，除非有较明确走势，否则不应参与）
                    '剔除（单列只用于个别选择进入长期池，只在周末进行筛选不用于每日筛选）
                    '历史高幅：涉及股性，可能多次出现不冲高情况。
                    '--------------------------------------------------------------------
                    ElseIf 谕组(X, 位谕of周波类) = "2败多" Then
                                    典筛日外A7败多.Add Item:=X, Key:=CIDL
                '------------------------------------------------------------------------
                '注：以下都是（月护为A7）（周波动率大于3%）
                '------------------------------------------------------------------------
                '单列：边角料
                '注20260110：所有WXBC劫已包含在(C7)之中。
                '------------------------------------------------------------------------
                    '--------------------------------------------------------------------
                    '剔除：偏离较大
                    '--------------------------------------------------------------------
                    ElseIf 谕组(X, 位谕of周类BTZC) > 0 And 谕组(X, 位谕of周层盈丘幅) > 80 Then              '操作：检查是否继续上冲
                                典筛日外A7常_剔周丘幅80.Add Item:=X, Key:=CIDL
                    '--------------------------------------------------------------------
                    '单列：过渡期，为经历WJB劫后始终未触顶
                    '注20260303：因存续时间较短，且已经区分地型，不再对（再）区分是否为龙。
                    '--------------------------------------------------------------------
                    ElseIf InStr(谕组(X, 位谕of周层波型), "再B") > 0 Then
                                典筛日外A7常_渡区再B.Add Item:=X, Key:=CIDL
                    ElseIf InStr(谕组(X, 位谕of周层波型), "再C") > 0 Then
                                典筛日外A7常_渡区再C.Add Item:=X, Key:=CIDL
                    ElseIf InStr(谕组(X, 位谕of周层波型), "再") > 0 Then
                                典筛日外A7常_渡区再D.Add Item:=X, Key:=CIDL
                    ElseIf InStr(谕组(X, 位谕of周层波型), "震负") > 0 Or InStr(谕组(X, 位谕of周层波型), "头") > 0 Then
                                典筛日外A7常_汇头WJB劫.Add Item:=X, Key:=CIDL   '包含：震负芽（/W3h/W3u）头负芽（/W2I/W2i）头正芽。包含虽经过WJB劫，但较长时间未触顶的情况。
                '------------------------------------------------------------------------
                '注：以下都是（月护为A7）（周波动率大于3%）(主)
                '------------------------------------------------------------------------
                    '--------------------------------------------------------------------
                    '单列：“头”肯定是前面经历了WJB劫。“震”肯定是前面经历了WXZA劫，或WXZB劫（W3h/W3u）。
                    '--------------------------------------------------------------------
                    ElseIf InStr(谕组(X, 位谕of周层波型), "震正芽") > 0 Or InStr(谕组(X, 位谕of周层波型), "震正根") > 0 Then
                                典筛日外A7常_汇震WJA劫.Add Item:=X, Key:=CIDL   '包含：震正芽、震正根
                    '--------------------------------------------------------------------
                    '单列：离顶。代表很可能属于【震荡】。
                    '--------------------------------------------------------------------
                    ElseIf InStr(谕组(X, 位谕of周层波型), "震") > 0 Then
                                典筛日外A7常_汇震正〇.Add Item:=X, Key:=CIDL
                                '注20250520：：可能属于地型杂，或“帐篷”。仍可能属于阶梯上升过程，仅优于WXZA劫。
                    ElseIf InStr(谕组(X, 位谕of周层波型), "龙管根") > 0 Then
                                典筛日外A7常_主区龙管根.Add Item:=X, Key:=CIDL
                    ElseIf InStr(谕组(X, 位谕of周层波型), "龙管") > 0 Then
                                典筛日外A7常_主区龙管余.Add Item:=X, Key:=CIDL
                    '--------------------------------------------------------------------
                    '单列：/存在WXZA劫（存在上冲动力）/合顶初（属于机会较多情况）。WXZA劫是很可能处于经过高点后的震荡，所以一定要把“蛀”放在“首”之前进行过滤。
                    '注20260520：不再对“首”进行过滤，将其放回各自地型考虑。实质上是，减少顶的重要性，增加地型的重要性。
                    '--------------------------------------------------------------------
                    'ElseIf InStr(谕组(X, 位谕of周层波型), "首") > 0 Then
                    '            典筛日外A7常_主区龙猪首.Add Item:=X, Key:=CIDL
                    '--------------------------------------------------------------------
                    '单列：地型（前四柱是否存在异常柱/跌连/跌吞）
                    '--------------------------------------------------------------------
                    ElseIf InStr(谕组(X, 位谕of周层波型), "_4") > 0 Then
                                典筛日外A7常_主区龙猪地型4.Add Item:=X, Key:=CIDL
                    Else
                        If InStr(谕组(X, 位谕of周层波型), "_0") > 0 Then
                                典筛日外A7常_主区龙猪地型0.Add Item:=X, Key:=CIDL
                        ElseIf InStr(谕组(X, 位谕of周层波型), "_1") > 0 Then
                                典筛日外A7常_主区龙猪地型1.Add Item:=X, Key:=CIDL
                        ElseIf InStr(谕组(X, 位谕of周层波型), "_2") > 0 Then
                                典筛日外A7常_主区龙猪地型2.Add Item:=X, Key:=CIDL
                        ElseIf InStr(谕组(X, 位谕of周层波型), "_3") > 0 Then
                                典筛日外A7常_主区龙猪地型3.Add Item:=X, Key:=CIDL
                        End If
                    End If
                '------------------------------------------------------------------------
            End If
            '============================================================================
    End If
    '====================================================================================
    '整体漏斗：周层
    '====================================================================================
            '============================================================================
            '主程序
            '============================================================================
            '----------------------------------------------------------------------------
            '剔除：池
            '注意20230101：仅排除（/池持/池黑/池金银非），非排斥性展示（/池今）
            '----------------------------------------------------------------------------
                    If 参of筛决策剔池 = True And 谕组(X, 位谕of仓持数) > 0 Then
                    ElseIf 参of筛决策剔池 = True And 谕组(X, 位qt在池) = 常池名黑 Then
                    'ElseIf 参of筛决策剔池 = True And (谕组(X, 位qt在池) = 常池名金 Or 谕组(X, 位qt在池) = 常池名银 Or 谕组(X, 位qt在池) = 常池名铜) Then
            '----------------------------------------------------------------------------
            '剔除：市类
            '注意20230101：由于池持也可能包含基金，所以此处仅用于剔除，统计计数放到外部逻辑。
            '注意20240221：已经移至[筛市类]
            '----------------------------------------------------------------------------
                    ElseIf 谕组(X, 位qt市板) = 常市板指 Then
                    ElseIf 谕组(X, 位qt市板) = 常市板基 Then
                    '注20240222：提取不在任何指数基金成分中的股票。现阶段ST退市风险太大，单独列示，不进行买卖操作。
                    ElseIf InStr(谕组(X, 位qt代称), "ST") > 0 Or InStr(谕组(X, 位qt代称), "退") > 0 Then
                    ElseIf 谕组(X, 位qt市板) = 常市板票Qb Then
            '----------------------------------------------------------------------------
            '筛选类别：【非】【新】【萎】【活】
            '【非】20240222：提取不在任何指数基金成分中的股票。现阶段ST退市风险太大，单独列示，不进行买卖操作。
            '【新】20220612：由于科创板与其他短时期上市的股票，无法用按周规律进行甄别，可以单独列示按日分析。
            '【萎】20230101：按照【日均高】过滤，而不要按照【周均高】。用于剔除低波动长期蓝筹股。
            '【活】
            '----------------------------------------------------------------------------
                    ElseIf 谕组(X, 位qt成分) = "N" Then
                            典集筛股性非.Add Item:=X, Key:=CIDL
                    ElseIf 谕组(X, 位qt成分) = "It" Then
                            典集筛股性微.Add Item:=X, Key:=CIDL
                    ElseIf 谕组(X, 位qt市板) = 常市板票Q8 Or 谕组(X, 位qt市板) = 常市板票Qo Then
                            典集筛股性活.Add Item:=X, Key:=CIDL
                    Else
                        If 谕组(X, 位谕of日段股性) = "12变活" Or 谕组(X, 位谕of日段股性) = "13变活" _
                        Or 谕组(X, 位谕of日段股性) = "0萎" Or 谕组(X, 位谕of日段股性) = "11蔫" Then
                            典集筛股性萎.Add Item:=X, Key:=CIDL
                        Else
                            典集筛股性活.Add Item:=X, Key:=CIDL
                        End If
                    End If
    '====================================================================================
End If
Next
'========================================================================================
'统计
'========================================================================================
'        MSG = MSG & "计码股ST：" & 计码股ST & vbCrLf
'        MSG = MSG & "计码股总剔：" & 计码股总 & vbCrLf
'        MSG = MSG & "计码股Qb：" & 计码股Qb & vbCrLf
'        MSG = MSG & "计码股Qo：" & 计码股Q8 & "  " & 计码股Qo & vbCrLf
'        MSG = MSG & "计码股萎：" & 计码股萎变活 & "  " & 计码股萎始终 & vbCrLf
'        MSG = MSG & "计码股月尊：" & 计码股月尊比柱A & "  " & 计码股月尊比柱B & "  " & 计码股月尊比柱C & "  " & 计码股月尊比柱D & vbCrLf
'        MSG = MSG & "计码股日DJECB：" & 计码股日DJEC之上乙 & "  " & 计码股日DJEC之上甲 & "  " & 计码股总 & vbCrLf
        MSG = MSG & "计码三鳄：" & 计码三鳄金 & "金 " & 计码三鳄银 & "银 " & 计码三鳄唏 & "唏 " & 计码三鳄嘘 & "嘘 " & (计码三鳄尿 + 计码三鳄屎) & "屎尿" & vbCrLf
'========================================================================================
'类别：市板
'========================================================================================
    '------------------------------------------------------------------------------------
    表名 = 常市板基
    Call IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:=出章模式, 出节模式:=出节模式, 出全是否:=参of筛决策详表, 是否建表:=True, 章色:=常色主黑, 典码输出:=典集市板Qe, 章签:=表名)
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of周德横类, 强序:=xlAscending, 区隐:=区隐, 区色:=常色三灰, 章色:=常色一灰, 典码输出:=典集市板Qe2, 章签:=表名 & "低波", 区释:="")
    WB.Sheets(表名).Columns(位qt代称).ColumnWidth = 15
    '------------------------------------------------------------------------------------
    表名 = "Qst"
    Call IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:=出章模式, 出节模式:=出节模式, 出全是否:=参of筛决策详表, 是否建表:=True, 典码输出:=典集市板ST, 章色:=常色三灰, 章签:=表名)
    表名 = 常市板票Q8
    Call IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:=出章模式, 出节模式:=出节模式, 出全是否:=参of筛决策详表, 是否建表:=True, 典码输出:=典集市板Q8, 章色:=常色三灰, 章签:=表名)
    表名 = 常市板票Qb
    Call IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:=出章模式, 出节模式:=出节模式, 出全是否:=参of筛决策详表, 是否建表:=True, 典码输出:=典集市板Qb, 章色:=常色三灰, 章签:=表名)
'========================================================================================
'类别：周层
'========================================================================================
'If 参of筛决策详表 = True Then
'    MSG = MSG & "筛按周层：" & vbCrLf
'    表名 = ".非"
'    Call IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:=出章模式, 出节模式:=出节模式, 出全是否:=参of筛决策详表, 是否建表:=True, 典码输出:=典集筛股性非, 章色:=常色四靛, 章签:="【股性】非")
'    表名 = ".俩"
'    Call IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:=出章模式, 出节模式:=出节模式, 出全是否:=参of筛决策详表, 是否建表:=True, 典码输出:=典集筛股性微, 章色:=常色四靛, 章签:="【股性】微")
'    表名 = ".活"
'    Call IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:=出章模式, 出节模式:=出节模式, 出全是否:=参of筛决策详表, 是否建表:=True, 典码输出:=典集筛股性活, 章色:=常色四靛, 章签:="【股性】活")
'    表名 = ".萎"
'    Call IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:=出章模式, 出节模式:=出节模式, 出全是否:=参of筛决策详表, 是否建表:=True, 典码输出:=典集筛股性萎, 章色:=常色四靛, 章签:="【股性】萎")
'End If
'========================================================================================
'类别：筛选机会
'========================================================================================
    '====================================================================================
    '周波：月阶
    '剔除（单列只用于个别选择进入长期池，不用于每日筛选）
    '====================================================================================
        表名 = ".M310"
        Call IQQQ展擎出程至页(WB, 表名, 是否建表:=True, 章色:=常色六橙, 章签:=表名)
        '--------------------------------------------------------------------------------
        '单列：升势初期，包括月护/A3/B1。很可能形成主升。
        '--------------------------------------------------------------------------------
        Call IQQQ展擎出程至页(WB, 表名, 是否建表:=False, 章色:=常色二橙, 章签:="升主WXCD正交@坐公交战法")
        Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="周地", 出全是否:=True, 节色:=常色主黄, 典码输出:=典筛日外月护A3, 节签:="单列【月护A3】WXCD正交.可能是主升")
        Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="周地", 出全是否:=True, 节色:=常色主黄, 典码输出:=典筛日外月护A1, 节签:="单列【月护A1】WXCD正交.可能是主升")
        '--------------------------------------------------------------------------------
        '单列：底部震荡，勿参与，包括/B0/X0。WXCD负交，可能形成主升，但更大概率是底部震荡诱多；最好等待WXCD正交后重仓介入。
        '--------------------------------------------------------------------------------
        Call IQQQ展擎出程至页(WB, 表名, 是否建表:=False, 章色:=常色二橙, 章签:="底震@可参与")
        Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="周地", 出全是否:=True, 节色:=常色主黄, 典码输出:=典筛日外月护A0, 节签:="单列【月护A0】由阴转阳.可能是主升开始")
        Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="周地", 出全是否:=True, 节色:=常色主黄, 典码输出:=典筛日外月护C0, 节签:="单列【月护C0】底部震荡")
        '--------------------------------------------------------------------------------
        '单列：下降趋势中的震荡，勿参与，包括/X0/X4/C6。
        '--------------------------------------------------------------------------------
        Call IQQQ展擎出程至页(WB, 表名, 是否建表:=False, 章色:=常色二橙, 章签:="降诱@勿参与")
        Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="周地", 出全是否:=True, 节色:=常色主黄, 典码输出:=典筛日外月护C6, 节签:="单列【月护C6】下降趋势震荡")
        Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="周地", 出全是否:=True, 节色:=常色主黄, 典码输出:=典筛日外月护C4, 节签:="单列【月护C4】下降趋势震荡")
        '--------------------------------------------------------------------------------
        '月护余
        '--------------------------------------------------------------------------------
        Call IQQQ展擎出程至页(WB, 表名, 是否建表:=False, 章色:=常色二橙, 章签:="余")
        'WJC之下上破WJB：应已经历abc浪，并贴附于WJA，即将上破WJC。可在之前上破WJB或WXAB正交。
        Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="周地", 出全是否:=True, 节色:=常色主黄, 典码输出:=典筛日外月护屎尿嘘例外, 节签:="单列【月护余】屎尿屁.WJB之上")
        Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="周地", 出全是否:=True, 节色:=常色主黄, 典码输出:=典筛日外月护余, 节签:="单列【月护余】")
    '====================================================================================
    '类别：外池
    '注20260321：代表可能是顶部，其中“再”更有可能处于主升过程。
    '====================================================================================
        表名 = ".M7顶"
        Call IQQQ展擎出程至页(WB, 表名, 是否建表:=True, 章色:=常色十橙, 章签:=表名)
        '--------------------------------------------------------------------------------
        '单列：顶部嫌疑。渡区（再储初）：_龙猪&龙管&震&头
        '--------------------------------------------------------------------------------
        '（1）WXAC劫：包含A7（再）
        Call IQQQ展擎出程至页(WB, 表名, 是否建表:=False, 章色:=常色六灰, 章签:="【顶部嫌疑.再】月阶7.再D。不太可能再次形成主升")
        Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="周地", 出全是否:=True, 节色:=常色五黄, 典码输出:=典筛日外A7常_汇头WJB劫, 节签:="【外常再】汇.头WJB劫（长时间未触顶）")  '包含：虽经过WJB劫，但较长时间未触顶的情况。
        Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="周地", 出全是否:=True, 节色:=常色六紫, 典码输出:=典筛日外A7常_渡区再D, 节签:="【A7常.渡再】【再D】龙&震&头")
        '--------------------------------------------------------------------------------
        '单列：顶部嫌疑。WXBC劫
        '--------------------------------------------------------------------------------
        '（2）WXBC劫突破：包含C7（储初）。机会不大
        Call IQQQ展擎出程至页(WB, 表名, 是否建表:=False, 章色:=常色六灰, 章签:="【顶部嫌疑.初】月阶7.WXBC劫")
        Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="周地", 出全是否:=True, 节色:=常色六绿, 典码输出:=典筛日外月护C7初储, 节签:="【C7常.渡初】【初储】龙&震&头")
        '--------------------------------------------------------------------------------
        '单列：顶部嫌疑。破线
        '--------------------------------------------------------------------------------
        Call IQQQ展擎出程至页(WB, 表名, 是否建表:=False, 章色:=常色六灰, 章签:="【顶部嫌疑.破】月阶7.破线")
        '（1）WXZB劫：包含C7（破）
        Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="周地", 出全是否:=True, 节色:=常色主黄, 典码输出:=典筛日外月护A7破, 节签:="【月护7】【破】")
        '（2）WXBC劫破线：包含M2e（储）
        Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="周地", 出全是否:=True, 节色:=常色主黄, 典码输出:=典筛日外月护M2e, 节签:="【月护7】M2e")
        Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="周地", 出全是否:=True, 节色:=常色主黄, 典码输出:=典筛日外月护M3v, 节签:="【月护7】M3v")
    '====================================================================================
    '类别：外池
    '本页包含：（WXCD＞0）（高均＞3）（高幅超过3的个数＞5）（主）
    '====================================================================================
        表名 = ".M7主"
        Call IQQQ展擎出程至页(WB, 表名, 是否建表:=True, 章色:=常色十橙, 章签:=表名)
        '--------------------------------------------------------------------------------
        '单列：主区_龙猪，根据<周地型>分类。WJA之上四柱内完美排列。
        '--------------------------------------------------------------------------------
        '单列：首合顶。注20260118：“首”为前期包含/WXZA/WXZB劫，但已经历较长蓄力。
        Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="周地", 出全是否:=True, 节色:=常色十橙, 典码输出:=典筛日外A7常_主区龙猪首, 节签:="【A7常.主】龙猪.主首合顶")     '初合顶，必然前面经历离顶，包括（①从层再过渡②经历过WXZA劫③在WJA之上长久横盘）。所以此类别与“蛀（WXZA劫）”“头（WXZB劫）”更为接近。
        '单列：各种地型。
        Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="周层", 出全是否:=True, 节色:=常色主黄, 典码输出:=典筛日外A7常_主区龙猪地型0, 节签:="【A7常.主】龙猪.<周地型>含0")
        Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="周层", 出全是否:=True, 节色:=常色主黄, 典码输出:=典筛日外A7常_主区龙猪地型1, 节签:="【A7常.主】龙猪.<周地型>含1（跌吞）") '前4柱有WJA之上跌吞
        Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="周层", 出全是否:=True, 节色:=常色主黄, 典码输出:=典筛日外A7常_主区龙猪地型2, 节签:="【A7常.主】龙猪.<周地型>含2（跌连）") '前4柱有WJA之上跌连
        Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="周层", 出全是否:=True, 节色:=常色主黄, 典码输出:=典筛日外A7常_主区龙猪地型3, 节签:="【A7常.主】龙猪.<周地型>含3（其他）")     '其他
        '--------------------------------------------------------------------------------
        '单列：周层界主区.非龙猪
        '单列：可能下破WJA或围绕WJA震荡。很可能处于WXAB丘的尾部，需要判断是否属于下降趋势。
        '注20260126：“震”与“头”两者性质完全不同。“震”为WXAB之上经历WXZA震荡，属于波段的尾部；而“头”属于刚上破WJB，很可能形成新的波段。所以两者不要放在一起，而要区分开来。
        '--------------------------------------------------------------------------------
        Call IQQQ展擎出程至页(WB, 表名, 是否建表:=False, 章色:=常色六灰, 章签:="剔【主非龙猪】WJA之上")
        '注20260510：已经过最高点开始滑落（可能包含WJA之上跌连等调整导致t顶＜-2）。应放在<龙管>之前，比下破WJA要更有可能属于主升中的调整。
        Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="周地", 出全是否:=True, 节色:=常色五黄, 典码输出:=典筛日外A7常_汇震正〇, 节签:="【A7常.主】汇.震正〇")
        Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="周地", 出全是否:=True, 节色:=常色七黄, 典码输出:=典筛日外A7常_主区龙管余, 节签:="【A7常.主】龙管（WJA之上）")    '很可能已经过最高点
        Call IQQQ展擎出程至页(WB, 表名, 是否建表:=False, 章色:=常色六灰, 章签:="剔【主非龙猪】WJA劫")
        '注20260510：包含：震正芽、震正根。要区分（主升过程中的WXZA劫）与（震荡过程中的WXZA劫），明确选择（主升过程中的WXZA劫）。
        Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="周层", 出全是否:=True, 节色:=常色主黄, 典码输出:=典筛日外A7常_主区龙猪地型4, 节签:="【A7常.主】龙猪.<周地型>含4暂4蛀")     '前4柱中有WXZA劫
        Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="周地", 出全是否:=True, 节色:=常色七黄, 典码输出:=典筛日外A7常_主区龙管根, 节签:="【A7常.主】龙管根")    '很可能已经过最高点
        Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="周地", 出全是否:=True, 节色:=常色五黄, 典码输出:=典筛日外A7常_汇震WJA劫, 节签:="【A7常.主】汇.震WJA劫")
        '--------------------------------------------------------------------------------
        '单列：主升中的大调整。渡区（再）：_龙猪&龙管&震&头
        '--------------------------------------------------------------------------------
        '（1）/WXZB/WXAB劫突破：包含A7（再）
        Call IQQQ展擎出程至页(WB, 表名, 是否建表:=False, 章色:=常色六灰, 章签:="【主升尾部嫌疑.再】月阶7.再B&再C。有可能再次形成主升")
        Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="周地", 出全是否:=True, 节色:=常色六紫, 典码输出:=典筛日外A7常_渡区再B, 节签:="【A7常.渡再】【再B】龙&震&头")
        Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="周地", 出全是否:=True, 节色:=常色六紫, 典码输出:=典筛日外A7常_渡区再C, 节签:="【A7常.渡再】【再C】龙&震&头")
        '--------------------------------------------------------------------------------
        '剔除：暴。周丘幅过大
        '--------------------------------------------------------------------------------
        Call IQQQ展擎出程至页(WB, 表名, 是否建表:=False, 章色:=常色六灰, 章签:="【主升尾部嫌疑.暴】月阶7.（暴）偏离太大")
        MSG = MSG & IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="周地", 出全是否:=True, 节色:=常色八红, 典码输出:=典筛日外A7常_剔周丘幅80, 节签:="【A7常.主】单列丘偏＞80%")
        '--------------------------------------------------------------------------------
        '剔除（单列只用于个别选择进入长期池，不用于每日筛选）
        '单列：历史败多。股性差，多次不冲高。（高幅超过3的个数≤5）。
        '单列：（外池周机）低均。股性萎靡
        '--------------------------------------------------------------------------------
        Call IQQQ展擎出程至页(WB, 表名, 是否建表:=False, 章色:=常色六灰, 章签:="不适用于“下周冲高”。包含/（低）波动太小/（败）失败太多。只在周末筛选，周中无需查看。")
        Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="周地", 出全是否:=True, 节色:=常色主黄, 典码输出:=典筛日外A7败多, 节签:="剔【A7败多】失败太多")
        Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="周地", 出全是否:=True, 节色:=常色主黄, 典码输出:=典筛日外A7低波_日高lt1, 节签:="剔【A7低波】日级别.十均高≤1.2")
        Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="周地", 出全是否:=True, 节色:=常色主黄, 典码输出:=典筛日外A7低波, 节签:="剔【A7低波】周级别.波动太小")
'========================================================================================
'类别：复盘
'========================================================================================
    '================================================================================
    '类别：今池
    '================================================================================
        表名 = 常簿缀选日 & 常池名今
        Call IQQQ展擎出程至页(WB, 表名, 是否建表:=True, 章色:=常色八橙, 章签:=表名)
        Call IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:=出章模式, 出节模式:=出节模式, 出全是否:=True, 典码输出:=典集筛已在池今, 章色:=常色八红, 章签:="【今池】")
    '================================================================================
    '针对日类：
    '================================================================================
        表名 = ".复日"
        Call IQQQ展擎出程至页(WB, 表名, 是否建表:=True, 章色:=常色八灰, 章签:="复日盘")
        '--------------------------------------------------------------------------------
        '剔：涨停。注20242023：针对涨停以及冲高回落。
        '--------------------------------------------------------------------------------
        Call IQQQ展擎出程至页(WB, 表名, 是否建表:=False, 章色:=常色六灰, 章签:="剔【涨停】针对HR≥9")
        MSG = MSG & IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="日层", 出全是否:=True, 节色:=常色十红, 典码输出:=典筛复日_停今甲, 节签:="【今涨停】三板")
        MSG = MSG & IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="日层", 出全是否:=True, 节色:=常色十红, 典码输出:=典筛复日_停今乙, 节签:="【今涨停】两板")
        MSG = MSG & IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:="月护", 出节模式:="周地", 出全是否:=True, 典码输出:=典筛复日_停今丙, 章色:=常色八红, 章签:="【今涨停】首板已封")
        MSG = MSG & IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:="月护", 出节模式:="周地", 出全是否:=True, 典码输出:=典筛复日_停今丁, 章色:=常色八红, 章签:="【今涨停】首板未封")
        '--------------------------------------------------------------------------------
        '剔：十日涨停数多
        '--------------------------------------------------------------------------------
        Call IQQQ展擎出程至页(WB, 表名, 是否建表:=False, 章色:=常色六灰, 章签:="未剔【十停数≥3】")
        MSG = MSG & IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:="月护", 出节模式:="周地", 出全是否:=True, 典码输出:=典筛复日_停十数3, 章色:=常色八红, 章签:="【日冲】十日涨停数≥3")
        '--------------------------------------------------------------------------------
        '剔：本日涨幅较多
        '--------------------------------------------------------------------------------
        Call IQQQ展擎出程至页(WB, 表名, 是否建表:=False, 章色:=常色六灰, 章签:="未剔【本日涨幅较大】")
        MSG = MSG & IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:="月护", 出节模式:="周地", 出全是否:=True, 典码输出:=典筛复日_幅涨4, 章色:=常色八红, 章签:="【日冲】涨幅≥4")
        MSG = MSG & IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:="月护", 出节模式:="周地", 出全是否:=True, 典码输出:=典筛复日_幅高4, 章色:=常色八红, 章签:="【日冲】高幅≥4")
    '================================================================================
    '针对日类：复周
    '================================================================================
        表名 = ".复周"
        Call IQQQ展擎出程至页(WB, 表名, 是否建表:=True, 章色:=常色八灰, 章签:="复周盘")
        '--------------------------------------------------------------------------------
        '捡漏机会：本周败。周临高幅≤3
        '周机。根据临高幅与临涨幅：用于周一二三四捡漏。
        '--------------------------------------------------------------------------------
        Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="周层", 出全是否:=True, 节色:=常色主黄, 典码输出:=典统周复_幅高零, 节签:="【单列】【周临高幅＜0%】")
        '--------------------------------------------------------------------------------
        '剔：统计周涨幅
        '--------------------------------------------------------------------------------
        Call IQQQ展擎出程至页(WB, 表名, 是否建表:=False, 章色:=常色六灰, 章签:="【周波动】针对周级别")
        MSG = MSG & IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="周层", 出全是否:=True, 节色:=常色五黄, 典码输出:=典统周复_幅涨负20, 节签:="【本周】涨幅≤-20")
        MSG = MSG & IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="周层", 出全是否:=True, 节色:=常色五黄, 典码输出:=典统周复_幅涨负10, 节签:="【本周】涨幅≤-10")
        MSG = MSG & IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="周层", 出全是否:=True, 节色:=常色主黄, 典码输出:=典统周复_幅高20, 节签:="【本周】高幅≥20")
        MSG = MSG & IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="周层", 出全是否:=True, 节色:=常色主黄, 典码输出:=典统周复_幅高10, 节签:="【本周】高幅≥10")
    '================================================================================
    '针对日类：复周按日
    '================================================================================
        表名 = ".复波A"
        Call IQQQ展擎出程至页(WB, 表名, 是否建表:=True, 章色:=常色四红, 章签:="复周波按日")
        '--------------------------------------------------------------------------------
        Call IQQQ展擎出程至页(WB, 表名, 是否建表:=False, 章色:=常色六灰, 章签:="龙猪")
        Call IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:="日乾", 出节模式:="日层", 出全是否:=True, 典码输出:=典统周复_周活龙猪, 章色:=常色八黄, 章签:="复金(甲乙丙己).周活.龙猪（主升）")
        Call IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:="日乾", 出节模式:="日层", 出全是否:=True, 典码输出:=典统周复_周萎龙猪, 章色:=常色八绿, 章签:="复金(甲乙丙己).周萎.龙猪（主升）")
        '--------------------------------------------------------------------------------
        Call IQQQ展擎出程至页(WB, 表名, 是否建表:=False, 章色:=常色六灰, 章签:="龙管")
        Call IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:="日乾", 出节模式:="日层", 出全是否:=True, 典码输出:=典统周复_周活龙管, 章色:=常色四黄, 章签:="复金(甲乙丙己).周活.龙管")
        Call IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:="日乾", 出节模式:="日层", 出全是否:=True, 典码输出:=典统周复_周萎龙管, 章色:=常色四绿, 章签:="复金(甲乙丙己).周萎.龙管")
        '--------------------------------------------------------------------------------
        Call IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:="日乾", 出节模式:="日层", 出全是否:=True, 典码输出:=典统周复_周活头震, 章色:=常色二绿, 章签:="复金(甲乙丙己).周活.头震")
        Call IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:="日乾", 出节模式:="日层", 出全是否:=True, 典码输出:=典统周复_周萎头震, 章色:=常色二黄, 章签:="复金(甲乙丙己).周萎.头震")
    '================================================================================
    '针对日类：复周按日
    '================================================================================
        表名 = ".复波B"
        Call IQQQ展擎出程至页(WB, 表名, 是否建表:=True, 章色:=常色四红, 章签:="复周波按日")
        '--------------------------------------------------------------------------------
        Call IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:="日乾", 出节模式:="日层", 出全是否:=True, 典码输出:=典统周复_周单列银, 章色:=常色二红, 章签:="复单列.银")
        Call IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:="日乾", 出节模式:="日层", 出全是否:=True, 典码输出:=典统周复_周单列唏, 章色:=常色二红, 章签:="复单列.唏")
        Call IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:="日乾", 出节模式:="日层", 出全是否:=True, 典码输出:=典统周复_周单列屎尿嘘甲, 章色:=常色二绿, 章签:="复单列.屎尿嘘DXAB>0")
        Call IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:="日乾", 出节模式:="日层", 出全是否:=True, 典码输出:=典统周复_周单列屎尿嘘乙, 章色:=常色二绿, 章签:="复单列.屎尿嘘DXZB>0")
        '--------------------------------------------------------------------------------
        Call IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:="日乾", 出节模式:="日层", 出全是否:=True, 典码输出:=典统周复_周单列被, 章色:=常色二红, 章签:="复单列.被")
        Call IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:="日乾", 出节模式:="日层", 出全是否:=True, 典码输出:=典统周复_周单列警, 章色:=常色二红, 章签:="复单列.警（日=丁戊）")
'========================================================================================
'类别：在池
'========================================================================================
        'MSG = MSG & "计码池内：" & vbCrLf
        '================================================================================
        '类别：池周
        '================================================================================
        Call IQQQ乾坤分布基程花天sSCC_仓宝周(WB)
        '================================================================================
        '类别：池持
        '================================================================================
        Call IQQQ乾坤分布基程花天sSCC_仓宝合(WB)
'========================================================================================
'返回
'========================================================================================
        IQQQ展擎筛程至A1册按全数据 = MSG
'========================================================================================
End Function




Function IQQQ展擎筛程至A2册按市类( _
          ByRef WB As Workbook _
        , ByRef 谕组 As Variant _
        , Optional ByVal 章色 As Long = 常色四灰 _
        , Optional ByVal 出章模式 As String = "" _
        , Optional ByVal 出节模式 As String = "周层" _
        , Optional ByVal 出全是否 As Boolean = True _
        ) As String
'========================================================================================
'准备: 谕组
'========================================================================================
    If VBA.IsEmpty(谕组) = True Then Exit Function
    '------------------------------------------------------------------------------------
    Dim 计数谕组 As Integer
    计数谕组 = UBound(谕组, 1) - LBound(谕组, 1) + 1
    '------------------------------------------------------------------------------------
    Dim 典集谕组 As New Dictionary
    Call UTL数据转换_集组码2典码位(典码位:=典集谕组, 组码:=谕组)
'========================================================================================
'输入：谕组
'========================================================================================
    '------------------------------------------------------------------------------------
    '准备花天
    '------------------------------------------------------------------------------------
    Dim 组花册 As Variant
    Dim WS花天 As Worksheet
    If STBASE外簿工具_花册链接(WS花天, 常花中股) = False Then
        Debug.Print "花册链接失败，无法继续"
        Exit Function
    End If
    Call UTL数据转换_集WS2ARR(组花册, WS花天, 始行:=2, 始列:=1, 总列:=花宽全道)
'========================================================================================
'制作典集
'========================================================================================
    Dim 典集市板Qi As New Dictionary
    Dim 典集市板Qi2 As New Dictionary
    Dim 典集市板Qe As New Dictionary
    Dim 典集市板Qe2 As New Dictionary
    '---------------------------------------
    Dim 典集市板ST As New Dictionary
    Dim 典集市板Q8 As New Dictionary
    Dim 典集市板Qb As New Dictionary
    Dim 典集成分上证50 As New Dictionary
    Dim 典集成分沪深300 As New Dictionary
    Dim 典集成分中证500 As New Dictionary
    Dim 典集成分中证1000 As New Dictionary
    Dim 典集成分中证2000 As New Dictionary
    Dim 典集成分创业板50 As New Dictionary
    Dim 典集成分MSCI中国 As New Dictionary
    Dim 典集成分非 As New Dictionary
'========================================================================================
'输出
'========================================================================================
    Dim CIDL As String
    Dim X As Integer
    For X = LBound(组花册, 1) To UBound(组花册, 1)
            CIDL = 组花册(X, 位列花天CIDL)
            定位谕组行号 = 典集谕组(CIDL)
            '----------------------------------------------------------------------------
            If 组花册(X, 位列花天是否上证50) <> "" Then 典集成分上证50.Add Item:=定位谕组行号, Key:=CIDL
            If 组花册(X, 位列花天是否中股300) <> "" Then 典集成分沪深300.Add Item:=定位谕组行号, Key:=CIDL
            If 组花册(X, 位列花天是否中证500) <> "" Then 典集成分中证500.Add Item:=定位谕组行号, Key:=CIDL
            If 组花册(X, 位列花天是否中证1000) <> "" Then 典集成分中证1000.Add Item:=定位谕组行号, Key:=CIDL
            If 组花册(X, 位列花天是否中证2000) <> "" Then 典集成分中证2000.Add Item:=定位谕组行号, Key:=CIDL
            If 组花册(X, 位列花天是否创业板50) <> "" Then 典集成分创业板50.Add Item:=定位谕组行号, Key:=CIDL
            '----------------------------------------------------------------------------
            If 组花册(X, 位列花天是否MSCI中国) <> "" Then 典集成分MSCI中国.Add Item:=定位谕组行号, Key:=CIDL
            '----------------------------------------------------------------------------
            If 组花册(X, 位列花天是否成分) = "N" Then
                If InStr(组花册(X, 位列花天代称), "ST") > 0 Or InStr(组花册(X, 位列花天代称), "退") > 0 Then
                    典集市板ST.Add Item:=X, Key:=CIDL
                Else
                    典集成分非.Add Item:=定位谕组行号, Key:=CIDL
                End If
            End If
            '----------------------------------------------------------------------------
            If 组花册(X, 位列花天市板) = 常市板指 Then
                    If 谕组(定位谕组行号, 位谕of日段佰均幅高) >= 0.3 Then      '过滤债类产品
                        典集市板Qi.Add Item:=X, Key:=CIDL
                    Else
                        典集市板Qi2.Add Item:=X, Key:=CIDL
                    End If
            ElseIf 组花册(X, 位列花天市板) = 常市板基 Then
                    If 谕组(定位谕组行号, 位谕of日段佰均幅高) >= 0.4 Then      '过滤债类产品
                        典集市板Qe.Add Item:=X, Key:=CIDL
                    Else
                        典集市板Qe2.Add Item:=X, Key:=CIDL
                    End If
            ElseIf 组花册(X, 位列花天市板) = 常市板票Q8 Then
                    典集市板Q8.Add Item:=X, Key:=CIDL
            ElseIf 组花册(X, 位列花天市板) = 常市板票Qb Then
                    典集市板Qb.Add Item:=X, Key:=CIDL
            End If
            '----------------------------------------------------------------------------
    Next
'========================================================================================
'输出：市板
'========================================================================================
    Dim MSG As String
    MSG = MSG & "筛按市类分布：" & vbCrLf
    Dim 表名 As String
    '====================================================================================
    '宽基指数
    '====================================================================================
    '------------------------------------------------------------------------------------
    '剔除
    '------------------------------------------------------------------------------------
'    表名 = 常簿缀选日 & "非"
'    MSG = MSG & IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:=出章模式,出节模式:=出节模式, 是否建表:=True, 章色:=常色四灰, 典码输出:=典集成分非, 章签:=表名)
    '------------------------------------------------------------------------------------
'    表名 = "It"
'    MSG = MSG & IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:=出章模式, 出节模式:=出节模式, 是否建表:=True, 章色:=常色四灰, 典码输出:=典集成分中证2000, 章签:=表名)
'    表名 = "Im"
'    MSG = MSG & IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:=出章模式, 出节模式:=出节模式, 是否建表:=True, 章色:=常色四灰, 典码输出:=典集成分中证1000, 章签:=表名)
'    表名 = "IC"
'    MSG = MSG & IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:=出章模式, 出节模式:=出节模式, 是否建表:=True, 章色:=常色四灰, 典码输出:=典集成分中证500, 章签:=表名)
'    表名 = "IF"
'    MSG = MSG & IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:=出章模式, 出节模式:=出节模式, 是否建表:=True, 章色:=常色四灰, 典码输出:=典集成分沪深300, 章签:=表名)
'    表名 = "IH"
'    MSG = MSG & IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:=出章模式, 出节模式:=出节模式, 是否建表:=True, 章色:=常色四灰, 典码输出:=典集成分上证50, 章签:=表名)
    '====================================================================================
    '指数&基金
    '====================================================================================
    表名 = 常市板指
    MSG = MSG & IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:=出章模式, 出节模式:=出节模式, 是否建表:=True, 章色:=常色二灰, 典码输出:=典集市板Qi, 章签:=表名)
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of周德横类, 强序:=xlAscending, 区隐:=区隐, 区色:=常色三灰, 章色:=常色二灰, 典码输出:=典集市板Qi2, 章签:=表名 & "低波", 区释:="")
    表名 = 常市板基
    MSG = MSG & IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:=出章模式, 出节模式:=出节模式, 是否建表:=True, 章色:=常色二灰, 典码输出:=典集市板Qe, 章签:=表名)
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of周德横类, 强序:=xlAscending, 区隐:=区隐, 区色:=常色三灰, 章色:=常色二灰, 典码输出:=典集市板Qe2, 章签:=表名 & "低波", 区释:="")
    WB.Sheets(表名).Columns(位qt代称).ColumnWidth = 15
    '====================================================================================
    '特殊板块
    '====================================================================================
'    表名 = 常簿缀选日 & "MSCI"
'    MSG = MSG & IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组,出章模式:=出章模式, 出节模式:=出节模式, 是否建表:=True, 章色:=常色主黑, 典码输出:=典集成分MSCI中国, 章签:=表名)
    '------------------------------------------------------------------------------------
    表名 = "Qst"     '注20240222：现阶段ST退市风险太大，单独列示，不进行买卖操作。
    MSG = MSG & IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:=出章模式, 出节模式:=出节模式, 是否建表:=True, 章色:=常色二灰, 典码输出:=典集市板ST, 章签:=表名)
    表名 = 常市板票Q8
    MSG = MSG & IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:=出章模式, 出节模式:=出节模式, 是否建表:=True, 章色:=常色二灰, 典码输出:=典集市板Q8, 章签:=表名)
    表名 = 常市板票Qb
    MSG = MSG & IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:=出章模式, 出节模式:=出节模式, 是否建表:=True, 章色:=常色二灰, 典码输出:=典集市板Qb, 章签:=表名)
'========================================================================================
'输出：市板
'========================================================================================
    MSG = ""
    IQQQ展擎筛程至A2册按市类 = MSG
End Function




Function IQQQ展擎筛程至C8章按停( _
          ByRef WB As Workbook _
        , ByVal 表名 As String _
        , ByRef 谕组 As Variant _
        , Optional ByRef 典码输出 As Dictionary _
        , Optional ByVal 章签 As String = "" _
        , Optional ByVal 章色 As Long = 常色43绿 _
        , Optional ByVal 出章模式 As String = "" _
        , Optional ByVal 出节模式 As String = "周层" _
        , Optional ByVal 出全是否 As Boolean = True _
        ) As String
'========================================================================================
'声明变量
'========================================================================================
    Dim CIDL As String
'========================================================================================
'定义
'========================================================================================
    Dim 典跨时类停今甲 As New Dictionary
    Dim 典跨时类停今乙 As New Dictionary
    '---------------------------------------
    Dim 典跨时类叠高甲 As New Dictionary
    Dim 典跨时类叠高乙 As New Dictionary
    Dim 典跨时类叠高丙 As New Dictionary
    '---------------------------------------
    Dim 典跨时类停高仨甲 As New Dictionary
    Dim 典跨时类停高仨乙 As New Dictionary
    '---------------------------------------
    Dim 典跨时类停高仨多佰小 As New Dictionary
    Dim 典跨时类停高仨多佰中 As New Dictionary
    Dim 典跨时类停高仨多佰大 As New Dictionary
    Dim 典跨时类停高仨多类0 As New Dictionary
'========================================================================================
'筛选
'========================================================================================
    Dim X As Integer
    For X = LBound(谕组, 1) To UBound(谕组, 1)
    CIDL = 谕组(X, 位qt代码)
    代称 = 谕组(X, 位qt代称)
    If UBCID是中股票(CIDL) Then
            '============================================================================
            '设置波动上下限
            '============================================================================
            If UBCID是中股票(CIDL) Then
                    值幅下限 = 1.5
                    值幅上限 = 3
            ElseIf UBCID是中股指(CIDL) Or UBCID是中股基(CIDL) Then
                    值幅下限 = 1
                    值幅上限 = 2
            End If
            '============================================================================
            '今涨停
            '============================================================================
            If 谕组(X, 位谕of日波龄BTHR9) >= 2 Then
                    典跨时类停今甲.Add Item:=X, Key:=CIDL
            ElseIf 谕组(X, 位谕of日波龄BTHR9) >= 1 Then
                    典跨时类停今乙.Add Item:=X, Key:=CIDL
            '============================================================================
            '叠大涨的标准形态
            '============================================================================
            ElseIf 谕组(X, 位谕of日波叠幅) >= 50 Then
                If InStr(谕组(X, 位谕of日龟顶触), "高") > 0 Or InStr(谕组(X, 位谕of日龟顶触), "撤") > 0 Then
                    典跨时类叠高甲.Add Item:=X, Key:=CIDL
                End If
            ElseIf 谕组(X, 位谕of日波叠幅) >= 40 Then
                If InStr(谕组(X, 位谕of日龟顶触), "高") > 0 Or InStr(谕组(X, 位谕of日龟顶触), "撤") > 0 Then
                    典跨时类叠高乙.Add Item:=X, Key:=CIDL
                End If
            ElseIf 谕组(X, 位谕of日波叠幅) >= 30 Then
                If InStr(谕组(X, 位谕of日龟顶触), "高") > 0 Or InStr(谕组(X, 位谕of日龟顶触), "撤") > 0 Then
                    典跨时类叠高丙.Add Item:=X, Key:=CIDL
                End If
            End If
'            '============================================================================
'            '仨曾涨停数>=3
'            '============================================================================
'            ElseIf 谕组(X, 位谕of日段仨停数高) >= 5 Then
'                    典跨时类停高仨甲.Add Item:=X, Key:=CIDL
'            ElseIf 谕组(X, 位谕of日段仨停数高) >= 3 Then
'                    典跨时类停高仨乙.Add Item:=X, Key:=CIDL
'            '============================================================================
'            '曾涨停：分类
'            '============================================================================
'            ElseIf 谕组(X, 位谕of日段股性) Like "0*" Then
'                If 谕组(X, 位谕of日段仨停数高) >= 2 Then 典跨时类停高仨多类0.Add Item:=X, Key:=CIDL
'            '-------------------------------------------------
'            '过滤均高幅：佰小 应分为三类
'            ElseIf 谕组(X, 位谕of日段佰均幅高) <= 值幅下限 Then
'                If 谕组(X, 位谕of日段仨停数高) >= 2 Then 典跨时类停高仨多佰小.Add Item:=X, Key:=CIDL
'            '-------------------------------------------------
'            '过滤均高幅：佰大 应分为三类
'            ElseIf 谕组(X, 位谕of日段佰均幅高) >= 值幅上限 Then
'                If 谕组(X, 位谕of日段仨停数高) >= 2 Then 典跨时类停高仨多佰大.Add Item:=X, Key:=CIDL
'            '-------------------------------------------------
'            '过滤均高幅：佰中
'            Else
'                If 谕组(X, 位谕of日段仨停数高) >= 2 Then 典跨时类停高仨多佰中.Add Item:=X, Key:=CIDL
'            '============================================================================
'            End If
    End If
    Next
'========================================================================================
'输出
'========================================================================================
'待完成：只有【今涨停】能够参考形态是如何变化的，能够用来提炼标准形态。其他【曾涨停】参考意义并不大。
        '--------------------------------------------------------------------------------
        '今涨停
        '--------------------------------------------------------------------------------
        MSG = MSG & IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="日层", 出全是否:=True, 节色:=常色十红, 典码输出:=典跨时类停今甲, 节签:="【今涨停】连板")
        MSG = MSG & IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="日层", 出全是否:=True, 节色:=常色十红, 典码输出:=典跨时类停今乙, 节签:="【今涨停】首板")
        '--------------------------------------------------------------------------------
        '叠高
        '--------------------------------------------------------------------------------
        Call IQQQ展擎出程至页(WB, 表名, 是否建表:=False, 章色:=常色六灰, 章签:="剔除【正叠】针对暴涨")
        Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="日层", 出全是否:=True, 节色:=常色十橙, 典码输出:=典跨时类叠高甲, 节签:="【叠】大于50+")
        Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="日层", 出全是否:=True, 节色:=常色十橙, 典码输出:=典跨时类叠高乙, 节签:="【叠】大于40+")
        Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="日层", 出全是否:=True, 节色:=常色十橙, 典码输出:=典跨时类叠高丙, 节签:="【叠】大于30+")
'        '--------------------------------------------------------------------------------
'        '仨涨停数
'        '--------------------------------------------------------------------------------
'        MSG = MSG & IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="日层", 出全是否:=True, 节色:=常色十橙, 典码输出:=典跨时类停高仨甲, 节签:="【仨涨停】曾N5")
'        MSG = MSG & IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="日层", 出全是否:=True, 节色:=常色十橙, 典码输出:=典跨时类停高仨乙, 节签:="【仨涨停】曾N3")
'        '--------------------------------------------------------------------------------
'        '仨涨停数
'        '--------------------------------------------------------------------------------
'        MSG = MSG & IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="日层", 出全是否:=True, 节色:=常色十黄, 典码输出:=典跨时类停高仨多佰大, 节签:="【仨涨停】N2佰大")
'        MSG = MSG & IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="日层", 出全是否:=True, 节色:=常色十黄, 典码输出:=典跨时类停高仨多佰中, 节签:="【仨涨停】N2佰中")
'        MSG = MSG & IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="日层", 出全是否:=True, 节色:=常色十黄, 典码输出:=典跨时类停高仨多佰小, 节签:="【仨涨停】N2佰小")
'        MSG = MSG & IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="日层", 出全是否:=True, 节色:=常色十黄, 典码输出:=典跨时类停高仨多类0, 节签:="【仨涨停】N2类0")
'========================================================================================
'输出：市板
'========================================================================================
    IQQQ展擎筛程至C8章按停 = MSG
End Function





'========================================================================================
'========================================================================================
'功能：按照活跃进行筛选
'========================================================================================
'========================================================================================
Function IQQQ展擎筛程至C8章按活( _
          ByRef WB As Workbook _
        , ByVal 表名 As String _
        , ByRef 谕组 As Variant _
        , Optional ByRef 典码输出 As Dictionary _
        , Optional ByVal 章签 As String = "" _
        , Optional ByVal 章色 As Long = 常色43绿 _
        , Optional ByVal 出章模式 As String = "" _
        , Optional ByVal 出节模式 As String = "周层" _
        , Optional ByVal 出全是否 As Boolean = True _
        ) As String
'========================================================================================
'声明变量
'========================================================================================
    Dim CIDL As String
'========================================================================================
'定义典
'========================================================================================
    '均高幅
    Dim 典集汇活日G3周G6 As New Dictionary
    Dim 典集汇活日G3周G8 As New Dictionary
    Dim 典集汇活日G3周G10 As New Dictionary
    Dim 典集汇活日G3周G14 As New Dictionary
    '---------------------------------------
    Dim 典集汇活日G3周L6日G7 As New Dictionary
    Dim 典集汇活日G3周L6日G5 As New Dictionary
    Dim 典集汇活日G3周L6日G3 As New Dictionary
    '---------------------------------------
    Dim 典集汇活日L3周G10 As New Dictionary
    Dim 典集汇活日L3周G6 As New Dictionary
    Dim 典集汇活日L3周G6低活 As New Dictionary
    '---------------------------------------
    Dim 典集汇活日L3周L6 As New Dictionary
'========================================================================================
'筛选：微观 以周为粒度进行柱类分析
'========================================================================================
    For Y = 1 To 典码输出.Count
        X = 典码输出.Items(Y - 1)
        CIDL = 谕组(X, 位qt代码)
        '================================================================================
        If UBCID是代码(CIDL) = False Then
        ElseIf 谕组(X, 位qt停牌) = "S" Then
        Else
        '================================================================================
            '周均高幅：
            If 谕组(X, 位谕of日段十均幅高) >= 3 Then
                If 谕组(X, 位谕of周波均高幅十) >= 14 Then
                        典集汇活日G3周G14.Add Item:=X, Key:=CIDL
                ElseIf 谕组(X, 位谕of周波均高幅十) >= 10 Then
                        典集汇活日G3周G10.Add Item:=X, Key:=CIDL
                ElseIf 谕组(X, 位谕of周波均高幅十) >= 8 Then
                        典集汇活日G3周G8.Add Item:=X, Key:=CIDL
                ElseIf 谕组(X, 位谕of周波均高幅十) >= 6 Then
                        典集汇活日G3周G6.Add Item:=X, Key:=CIDL
                ElseIf 谕组(X, 位谕of日段十均幅高) >= 7 Then
                        典集汇活日G3周L6日G7.Add Item:=X, Key:=CIDL
                ElseIf 谕组(X, 位谕of日段十均幅高) >= 5 Then
                        典集汇活日G3周L6日G5.Add Item:=X, Key:=CIDL
                ElseIf 谕组(X, 位谕of日段十均幅高) >= 3 Then
                        典集汇活日G3周L6日G3.Add Item:=X, Key:=CIDL
                End If
            ElseIf 谕组(X, 位谕of周波均高幅十) >= 6 Then
                If 谕组(X, 位谕of日段十均幅高) < 2 Then
                        典集汇活日L3周G6低活.Add Item:=X, Key:=CIDL
                ElseIf 谕组(X, 位谕of周波均高幅十) >= 10 Then
                        典集汇活日L3周G10.Add Item:=X, Key:=CIDL
                Else
                        典集汇活日L3周G6.Add Item:=X, Key:=CIDL
                End If
            Else
                        典集汇活日L3周L6.Add Item:=X, Key:=CIDL
            End If
        '================================================================================
        End If
    Next
'========================================================================================
'输出
'========================================================================================
    '--------------------------------------------------------------------------------
    '周均高幅
    '--------------------------------------------------------------------------------
    Call IQQQ展擎出程至页(WB, 表名, 节色:=常色十青, 节签:="【周均高幅】日G3周G6")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of周层三鳄, 强序:=xlDescending, 区色:=常色主靛, 典码输出:=典集汇活日G3周G14, 区签:="【周均高幅】>=14", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of周层三鳄, 强序:=xlDescending, 区色:=常色主靛, 典码输出:=典集汇活日G3周G10, 区签:="【周均高幅】>=10", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of周层三鳄, 强序:=xlDescending, 区色:=常色主靛, 典码输出:=典集汇活日G3周G8, 区签:="【周均高幅】>=8", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of周层三鳄, 强序:=xlDescending, 区色:=常色主靛, 典码输出:=典集汇活日G3周G6, 区签:="【周均高幅】>=6", 区释:="")
    '--------------------------------------------------------------------------------
    '日均高幅
    '--------------------------------------------------------------------------------
    Call IQQQ展擎出程至页(WB, 表名, 节色:=常色十青, 节签:="【日均高幅】日G3")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of周层三鳄, 强序:=xlDescending, 区色:=常色主黄, 典码输出:=典集汇活日G3周L6日G7, 区签:="【日均高幅】>=7", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of周层三鳄, 强序:=xlDescending, 区色:=常色主黄, 典码输出:=典集汇活日G3周L6日G5, 区签:="【日均高幅】>=5", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of周层三鳄, 强序:=xlDescending, 区色:=常色主黄, 典码输出:=典集汇活日G3周L6日G3, 区签:="【日均高幅】>=3", 区释:="")
    '--------------------------------------------------------------------------------
    '周均高幅
    '--------------------------------------------------------------------------------
    Call IQQQ展擎出程至页(WB, 表名, 节色:=常色十青, 节签:="【周均高幅】日L3周G6")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of周层三鳄, 强序:=xlDescending, 区色:=常色主白, 典码输出:=典集汇活日L3周G10, 区签:="【活】日L3周G10", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of周层三鳄, 强序:=xlDescending, 区色:=常色主白, 典码输出:=典集汇活日L3周G6, 区签:="【活】日L3周G6", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of周层三鳄, 强序:=xlDescending, 区色:=常色主白, 典码输出:=典集汇活日L3周G6低活, 区签:="【活】日L3周G6", 区释:="")
    '--------------------------------------------------------------------------------
    Call IQQQ展擎出程至页(WB, 表名, 节色:=常色十青, 节签:="【日均高幅】日L3周L6")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of周层三鳄, 强序:=xlDescending, 区色:=常色六灰, 典码输出:=典集汇活日L3周L6, 区签:="【活】日L3周L6", 区释:="")
'========================================================================================
'返回
'========================================================================================
    IQQQ展擎筛程至C8章按活 = MSG
'========================================================================================
End Function






'########################################################################################
'########################################################################################
'#####################################   QQQ  筛程至页   ################################
'########################################################################################
'########################################################################################
'========================================================================================
'========================================================================================
'功能：按照池进行筛选
'========================================================================================
'========================================================================================
Function IQQQ展擎筛程至B1书按池( _
          ByRef WB As Workbook _
        , ByVal 表名 As String _
        , ByRef 谕组 As Variant _
        , Optional ByRef 典码输出 As Dictionary _
        , Optional ByVal 章签 As String = "" _
        , Optional ByVal 章色 As Long = 常色43绿 _
        , Optional ByVal 是否建表 As Boolean = False _
        ) As String
'========================================================================================
'验证
'========================================================================================
    If VBA.IsEmpty(谕组) = True Then Exit Function
    '------------------------------------------------------------------------------------
    If 典码输出 Is Nothing Then
        Call UTL数据转换_集组码2典码位(典码位:=典码输出, 组码:=谕组)
    End If
'========================================================================================
'输出准备
'========================================================================================
    Dim 计码输出 As Integer
    计码输出 = 典码输出.Count
    Dim 节签前缀 As String
    节签前缀 = IIf(Len(章签) > 0, 章签 & " ", "")
    Dim 章签输出 As String
    章签输出 = ">" & 节签前缀 & "筛按池：" & 计码输出
    Dim MSG As String
    MSG = ">" & 章签输出 & vbCrLf
    IQQQ展擎筛程至B1书按池 = MSG
    '------------------------------------------------------------------------------------
    If 是否建表 = True And UTL判断工表存在(表名, WB) = True Then Call PBASE格程工具_表操工表删除(表名, WB)
    If 计码输出 = 0 Then
        Exit Function
    Else
        Call IQQQ展擎出程至页(WB, 表名, 章色:=章色, 章签:=章签输出, 是否建表:=是否建表)
    End If
'========================================================================================
'声明变量
'========================================================================================
    Dim CIDL As String
'========================================================================================
'定义典
'========================================================================================
    Dim 典码输出池外 As New Dictionary
    Dim 典码输出池持 As New Dictionary
    Dim 典码输出池金 As New Dictionary
    Dim 典码输出池银 As New Dictionary
    Dim 典码输出池铜 As New Dictionary
    Dim 典码输出池黑 As New Dictionary
'========================================================================================
'筛选：微观 以周为粒度进行柱类分析
'========================================================================================
    For Y = 1 To 典码输出.Count
        X = 典码输出.Items(Y - 1)
        CIDL = 谕组(X, 位qt代码)
        '区分所在池
        If 谕组(X, 位qt在池) = 常池名金 Then
            典码输出池金.Add Item:=X, Key:=CIDL
        ElseIf 谕组(X, 位qt在池) = 常池名银 Then
            典码输出池银.Add Item:=X, Key:=CIDL
        ElseIf 谕组(X, 位qt在池) = 常池名铜 Then
            典码输出池铜.Add Item:=X, Key:=CIDL
        ElseIf 谕组(X, 位qt在池) = 常池名黑 Then
            典码输出池黑.Add Item:=X, Key:=CIDL
        ElseIf 谕组(X, 位谕of仓持数) > 0 Then
            '注20230101：将池持放在金银非之后，不打乱池结构
            典码输出池持.Add Item:=X, Key:=CIDL
        Else
            典码输出池外.Add Item:=X, Key:=CIDL
        End If
    Next
'========================================================================================
'输出
'========================================================================================
    '------------------------------------------------------------------------------------
    '池外
    MSG = MSG & IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 典码输出池外, 是否建表:=False, 章色:=常色十绿, 章签:="【池外】", 出章模式:="周层", 出节模式:="日乾")
    '----------------------------------------------------------------
    Call IQQQ展擎出程至页(WB, 表名, 章色:=常色十绿, 章签:="池持")
    MSG = MSG & IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色主黄, 典码输出:=典码输出池持, 区签:="【池持】", 区释:="")
    '----------------------------------------------------------------
    Call IQQQ展擎出程至页(WB, 表名, 章色:=常色十绿, 章签:="池白")
    MSG = MSG & IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色主黄, 典码输出:=典码输出池金, 区签:="【池金】", 区释:="")
    MSG = MSG & IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色主黄, 典码输出:=典码输出池银, 区签:="【池银】", 区释:="")
    MSG = MSG & IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色主黄, 典码输出:=典码输出池铜, 区签:="【池铜】", 区释:="")
    '----------------------------------------------------------------
    Call IQQQ展擎出程至页(WB, 表名, 章色:=常色十绿, 章签:="池黑")
    MSG = MSG & IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色主黄, 典码输出:=典码输出池黑, 区签:="【池黑】", 区释:="")
'========================================================================================
'返回
'========================================================================================
    IQQQ展擎筛程至B1书按池 = MSG
'========================================================================================
End Function
'########################################################################################
'########################################################################################
'#####################################   QQQ  筛程至页   ################################
'########################################################################################
'########################################################################################






'########################################################################################
'########################################################################################
'#####################################   QQQ  筛程至册   ################################
'########################################################################################
'########################################################################################
'========================================================================================
'========================================================================================
'功能：查看股性分布，主要用来调试池黑
'========================================================================================
'========================================================================================
Function IQQQ展擎筛程至A9册按股性( _
          ByRef WB As Workbook _
        , ByRef 谕组 As Variant _
        , Optional ByRef 典码输出 As Dictionary _
        , Optional ByVal 章色 As Long = 常色八黄 _
        , Optional ByVal 出章模式 As String = "" _
        , Optional ByVal 出节模式 As String = "周层" _
        , Optional ByVal 出全是否 As Boolean = True _
        ) As String
'========================================================================================
'验证
'========================================================================================
    If VBA.IsEmpty(谕组) = True Then Exit Function
    '------------------------------------------------------------------------------------
    If 典码输出 Is Nothing Then
        Call UTL数据转换_集组码2典码位(典码位:=典码输出, 组码:=谕组)
    End If
''========================================================================================
''输出准备
''========================================================================================
'    Dim 计码输出 As Integer
'    计码输出 = 典码输出.Count
'    Dim MSG As String
'    MSG = MSG & ">" & IIf(Len(章签) > 0, " " & 章签, "") & " 分页按股性：" & 计码输出 & vbCrLf
'    IQQQ展擎筛程至A9册按股性 = MSG
'    '------------------------------------------------------------------------------------
'    If 典码输出.Count = 0 Then Exit Function
'========================================================================================
'定义典
'========================================================================================
    Dim 典跨时类23 As New Dictionary
    Dim 典跨时类22b As New Dictionary
    Dim 典跨时类22a As New Dictionary
    Dim 典跨时类21 As New Dictionary
    Dim 典跨时类33 As New Dictionary
    Dim 典跨时类32 As New Dictionary
    Dim 典跨时类31 As New Dictionary
    Dim 典跨时类13 As New Dictionary
    Dim 典跨时类12 As New Dictionary
    Dim 典跨时类11 As New Dictionary
    Dim 典跨时类0ST退 As New Dictionary
    Dim 典跨时类0停牌 As New Dictionary
    Dim 典跨时类0新股 As New Dictionary
    Dim 典跨时类0萎靡 As New Dictionary
    '------------------------------------------------------------------------------------
    Dim 值幅下限 As Double, 值幅上限 As Double
    Dim CIDL As String
'========================================================================================
'筛选
'========================================================================================
    For Y = 1 To 典码输出.Count
        X = 典码输出.Items(Y - 1)
        CIDL = 谕组(X, 位qt代码)
        If UBCID是中股票(CIDL) = False Then
        Else
        '================================================================================
        '精分股性
        '================================================================================
                '------------------------------------------------------------------------
                '设置波动上下限
                '------------------------------------------------------------------------
                If UBCID是中股票(CIDL) Then
                        值幅下限 = 1.5
                        值幅上限 = 3
                ElseIf UBCID是中股指(CIDL) Or UBCID是中股基(CIDL) Then
                        值幅下限 = 1
                        值幅上限 = 2
                End If
                '------------------------------------------------------------------------
                If InStr(谕组(X, 位qt代称), "ST") > 0 Or InStr(谕组(X, 位qt代称), "退") > 0 Then
                        典跨时类0ST退.Add Item:=X, Key:=CIDL
                ElseIf 谕组(X, 位qt停牌) = "S" Then
                        典跨时类0停牌.Add Item:=X, Key:=CIDL
                ElseIf 谕组(X, 位谕of日段佰计数) < 150 Then
                        典跨时类0新股.Add Item:=X, Key:=CIDL
                ElseIf 谕组(X, 位谕of日段佰均幅高) < 1 Then
                        典跨时类0萎靡.Add Item:=X, Key:=CIDL
                '-------------------------------------------------
                '过滤均高幅：佰小 应分为三类
                ElseIf 谕组(X, 位谕of日段佰均幅高) < 值幅下限 Then
                    If 谕组(X, 位谕of日段仨均幅高) < 值幅下限 Then
                        典跨时类11.Add Item:=X, Key:=CIDL
                    ElseIf 谕组(X, 位谕of日段仨均幅高) < 值幅上限 Then
                        典跨时类12.Add Item:=X, Key:=CIDL
                    Else
                        典跨时类13.Add Item:=X, Key:=CIDL
                    End If
                '-------------------------------------------------
                '过滤均高幅：佰大 应分为三类
                ElseIf 谕组(X, 位谕of日段佰均幅高) >= 值幅上限 Then
                    If 谕组(X, 位谕of日段仨均幅高) < 值幅下限 Then
                        典跨时类31.Add Item:=X, Key:=CIDL
                    ElseIf 谕组(X, 位谕of日段仨均幅高) < 值幅上限 Then
                        典跨时类32.Add Item:=X, Key:=CIDL
                    Else
                        典跨时类33.Add Item:=X, Key:=CIDL
                    End If
                '-------------------------------------------------
                '过滤均高幅：佰中
                Else
                    If 谕组(X, 位谕of日段仨均幅高) < 值幅下限 Then
                        典跨时类21.Add Item:=X, Key:=CIDL
                    ElseIf 谕组(X, 位谕of日段仨均幅高) >= 值幅上限 Then
                        典跨时类23.Add Item:=X, Key:=CIDL
                    ElseIf 谕组(X, 位谕of日段佰均幅高) <= 谕组(X, 位谕of日段仨均幅高) Then
                        典跨时类22a.Add Item:=X, Key:=CIDL
                    Else
                        典跨时类22b.Add Item:=X, Key:=CIDL
                    End If
                End If
                '-------------------------------------------------
        '                '-------------------------------------------------
        ''                If 组历统时(X, 位统时列十均幅高) <值幅下限 Then
        '                If 组历统时(X, 位统时列仨均幅高) + 组历统时(X, 位统时列仨均幅低) > 0 Then
        '                    '远期正常中期正常近期萎靡 冲高回落
        '                    典跨时类22b十低.Add Item:=代称, Key:=CIDL
        '                '过滤：佰均幅高(非小)仨均幅高(非小)
        '                Else
        '                        '远期正常中期正常近期正常
        '                    典跨时类22b十常.Add Item:=代称, Key:=CIDL
        '                End If
        '                '-------------------------------------------------
                '-------------------------------------------------
        End If
    Next
'========================================================================================
'输出
'========================================================================================
    Dim MSG As String
    MSG = MSG & "筛按股性分布：" & 典码输出.Count & vbCrLf
    Dim 表名 As String
    '====================================================================================
    表名 = 常簿缀选日 & "跨时0"
    Call IQQQ展擎出程至页(WB, 表名, 是否建表:=True, 章色:=章色, 章签:="【跨时0】")
    MSG = MSG & IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:=出章模式, 出节模式:=出节模式, 是否建表:=True, 典码输出:=典跨时类0新股, 章色:=章色, 章签:="0新股")
    MSG = MSG & IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:=出章模式, 出节模式:=出节模式, 是否建表:=False, 典码输出:=典跨时类0ST退, 章色:=常色四红, 章签:="0ST退")
    MSG = MSG & IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:=出章模式, 出节模式:=出节模式, 是否建表:=False, 典码输出:=典跨时类0萎靡, 是否建表:=False, 章色:=常色四红, 章签:="0萎靡")
    MSG = MSG & "0停牌" & IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色四灰, 典码输出:=典跨时类0停牌, 章签:="0停牌")
    '------------------------------------------------------------------------------------
    表名 = 常簿缀选日 & "跨时X1"
    MSG = MSG & IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:=出章模式, 出节模式:=出节模式, 是否建表:=True, 典码输出:=典跨时类11, 章色:=章色, 章签:="股性11")
    MSG = MSG & IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:=出章模式, 出节模式:=出节模式, 是否建表:=False, 典码输出:=典跨时类21, 章色:=章色, 章签:="股性21")
    MSG = MSG & IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:=出章模式, 出节模式:=出节模式, 是否建表:=False, 典码输出:=典跨时类31, 章色:=章色, 章签:="股性31")
    '------------------------------------------------------------------------------------
    表名 = 常簿缀选日 & "跨时1"
    MSG = MSG & IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:=出章模式, 出节模式:=出节模式, 是否建表:=True, 典码输出:=典跨时类13, 章色:=章色, 章签:="股性13")
    MSG = MSG & IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:=出章模式, 出节模式:=出节模式, 是否建表:=False, 典码输出:=典跨时类12, 章色:=章色, 章签:="股性12")
    '------------------------------------------------------------------------------------
    表名 = 常簿缀选日 & "跨时3"
    MSG = MSG & IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:=出章模式, 出节模式:=出节模式, 是否建表:=True, 典码输出:=典跨时类33, 章色:=章色, 章签:="股性33")
    MSG = MSG & IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:=出章模式, 出节模式:=出节模式, 是否建表:=False, 典码输出:=典跨时类32, 章色:=章色, 章签:="股性32")
    '------------------------------------------------------------------------------------
    '细分2
    '------------------------------------------------------------------------------------
    表名 = 常簿缀选日 & "跨时23"
    MSG = MSG & IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:=出章模式, 出节模式:=出节模式, 是否建表:=True, 典码输出:=典跨时类23, 章色:=章色, 章签:="股性23")
    '------------------------------------------------------------------------------------
    '细分22
    '------------------------------------------------------------------------------------
    表名 = 常簿缀选日 & "跨时22a"
    MSG = MSG & IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:=出章模式, 出节模式:=出节模式, 是否建表:=True, 典码输出:=典跨时类22a, 章色:=章色, 章签:="股性22a")
    '------------------------------------------------------------------------------------
    表名 = 常簿缀选日 & "跨时22b"
    MSG = MSG & IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:=出章模式, 出节模式:=出节模式, 是否建表:=True, 典码输出:=典跨时类22b, 章色:=章色, 章签:="股性22b")
'========================================================================================
    IQQQ展擎筛程至A9册按股性 = MSG
End Function
'########################################################################################
'########################################################################################
'#####################################   QQQ  筛程至表   ################################
'########################################################################################
'########################################################################################










'========================================================================================
'========================================================================================
'功能：验证昨日指标对于今日涨幅的指导作用
'注意：结算要用SCC
'========================================================================================
'========================================================================================
Sub IQQQ展擎筛程_统计本页前调日类()
'========================================================================================
'验明正身
'========================================================================================
    Dim WSAS As Worksheet
    Set WSAS = ActiveSheet
'    Set WSAS = ThisWorkbook.Sheets(".SSD")
    If PSOP格整理质程_是否适用首列(WSAS.Name) = False Then
        Exit Sub
    End If
'========================================================================================
'设置工作表
'========================================================================================
    Dim WSTO As Worksheet
    Call PBASE格程工具_表操工表新增(WSTO, "SSS" & WSAS.Name, 基色底:=常色主黄)
    With WSTO.Cells
        .Interior.ColorIndex = 2
    End With
'========================================================================================
'统计日类：一定为SCC
'========================================================================================
    Call IQQQ展擎瓜页引擎基程(WSAS, "更新排否", 实结类型:="sCCC", 基色底:=常色勿动)
    '------------------------------------------------------------------------------------
    '统计
    '------------------------------------------------------------------------------------
    Call IQQQ展擎筛程_统计本页基程(WSTO, WSAS, 被研指题:="日涨" & "*日局态", 被研指标:=位谕of日参竖态)
    Call IQQQ展擎筛程_统计本页基程(WSTO, WSAS, 被研指题:="日涨" & "*周局态", 被研指标:=位谕of周德横类)
    '--------------------------------------------
    Call IQQQ展擎筛程_统计本页基程(WSTO, WSAS, 被研指题:="日涨" & "*日层局", 被研指标:=位谕of日基坤局)
    Call IQQQ展擎筛程_统计本页基程(WSTO, WSAS, 被研指题:="日涨" & "*日乾局", 被研指标:=位谕of日基乾局)
'========================================================================================
'统计周类：一定为SSC
'========================================================================================
    Call IQQQ展擎瓜页引擎基程(WSAS, "更新排否", 实结类型:="sCCC", 基色底:=常色勿动)
    '------------------------------------------------------------------------------------
    '统计
    '--------------------------------------------
    Call IQQQ展擎筛程_统计本页基程(WSTO, WSAS, 被研指题:="周今涨" & "*周局态", 被研指标:=位谕of周德横类, 基色底:=常色43绿)
    Call IQQQ展擎筛程_统计本页基程(WSTO, WSAS, 被研指题:="周昨涨" & "*周局态", 被研指标:=位谕of周德横类, 基色底:=常色43绿)
'========================================================================================
    MSG = MSG & vbCrLf & WSAS.Name
    Set WSAS = Nothing
    Set WSTO = Nothing
    MsgBox MSG, vbOKOnly, "统计本页"
End Sub


Function IQQQ展擎筛程_统计本页基程(WSTO As Worksheet, WSAS As Worksheet, 被研指题 As String, 被研指标 As Integer, Optional 基色底 As Long = 常色八靛) As String
'========================================================================================
'搜索目标：遍历顺序一定要是倒序
'========================================================================================
    Dim 典集本页 As New Dictionary
    Dim CIDL As String
    Dim 行号遍历 As Integer
    For 行号遍历 = WSAS.Cells(65536, 1).End(xlUp).Row To 2 Step -1
        CIDL = WSAS.Cells(行号遍历, 位qt代码)
        If UBCID是代码(CIDL) And 典集本页.Exists(CIDL) = False Then
            典集本页.Add Item:=行号遍历, Key:=CIDL
        End If
    Next
    If 典集本页.Count = 0 Then Exit Function
'========================================================================================
'操作：制作数组数据
'========================================================================================
    Dim 计数被分 As Integer
    计数被分 = 典集本页.Count
    Dim 维横 As Integer
    维横 = PBASE格程工具_表参末列指定(WSAS, 1)
    '------------------------------------------------------------------------------------
    '制作数组
    '------------------------------------------------------------------------------------
    Dim 典码输出 As New Dictionary
    ReDim 元组被分(1 To 计数被分, 1 To 维横) As Variant
    Dim ARROW As Variant
    
    Dim 当行 As Integer
    Dim X As Integer
    Dim Y As Integer
    For X = 1 To 典集本页.Count
        当行 = 典集本页.Items(X - 1)
        CIDL = 典集本页.Keys(X - 1)
        典码输出.Add Item:=X, Key:=CIDL
        ARROW = WSAS.Cells(当行, 1).Resize(1, 维横)
        For Y = 1 To 维横
            元组被分(X, Y) = ARROW(1, Y)
        Next
        Erase ARROW
    Next
'========================================================================================
'操作：统计
'========================================================================================
    Dim 典集标数 As New Dictionary
    Dim 典集标涨数 As New Dictionary
    Dim 典集标高数G3 As New Dictionary
    Dim 典集标高数G1 As New Dictionary
    Dim 典集标高数G0 As New Dictionary
    Dim 典集标涨幅 As New Dictionary
    Dim 典集标高幅 As New Dictionary
    '------------------------------------------------------------------------------------
    '归集指标
    '------------------------------------------------------------------------------------
    Dim N As Integer
    N = 0
    For X = LBound(元组被分, 1) To UBound(元组被分, 1)
        值指标 = 元组被分(X, 被研指标)
        If 典集标数.Exists(值指标) = False Then
            N = N + 1
            典集标数.Add Item:=0, Key:=值指标
            典集标涨数.Add Item:=0, Key:=值指标
            典集标涨幅.Add Item:=0, Key:=值指标
            典集标高数G3.Add Item:=0, Key:=值指标
            典集标高数G1.Add Item:=0, Key:=值指标
            典集标高数G0.Add Item:=0, Key:=值指标
        End If
    Next
    '------------------------------------------------------------------------------------
    '统计指标
    '------------------------------------------------------------------------------------
    Dim 值位涨幅 As Integer
    Dim 值位高幅 As Integer
    If InStr(被研指题, "日涨") > 0 Then
        值位涨幅 = 位qt今涨幅
        值位高幅 = 位qt今高幅
    ElseIf InStr(被研指题, "周今涨") > 0 Then
        值位涨幅 = 位谕of周波临涨幅
        值位高幅 = 位谕of周波临高幅
    ElseIf InStr(被研指题, "周昨涨") > 0 Then
        值位涨幅 = 位谕of周波今涨幅
        值位高幅 = 位谕of周波今高幅
    End If
    For X = LBound(元组被分, 1) To UBound(元组被分, 1)
        值指标 = 元组被分(X, 被研指标)
        值涨幅 = 元组被分(X, 值位涨幅)
        值高幅 = 元组被分(X, 值位高幅)
        
        典集标数(值指标) = 典集标数(值指标) + 1
        典集标涨数(值指标) = 典集标涨数(值指标) + IIf(值涨幅 >= 0, 1, 0)
        If 值高幅 >= 3 Then
            典集标高数G3(值指标) = 典集标高数G3(值指标) + 1
            典集标高数G1(值指标) = 典集标高数G1(值指标) + 1
            典集标高数G0(值指标) = 典集标高数G0(值指标) + 1
        ElseIf 值高幅 >= 1 Then
            典集标高数G1(值指标) = 典集标高数G1(值指标) + 1
            典集标高数G0(值指标) = 典集标高数G0(值指标) + 1
        ElseIf 值高幅 >= 0 Then
            典集标高数G0(值指标) = 典集标高数G0(值指标) + 1
        End If
        If 值涨幅 <> "S" Then
        典集标涨幅(值指标) = 典集标涨幅(值指标) + 值涨幅
        典集标高幅(值指标) = 典集标高幅(值指标) + 值高幅
        End If
    Next
'========================================================================================
'输出
'========================================================================================
    Dim 母行 As Integer
    母行 = PBASE格程工具_表参末行指定(WSTO, 1)
    If 母行 = 1 Then
    Else
        母行 = 母行 + 3
    End If
    '------------------------------------------------------------------------------------
    '设置元信息
    '------------------------------------------------------------------------------------
    With WSTO.Rows(母行)
        .VerticalAlignment = xlBottom
        .Cells(1, 1) = "统计表" & vbCrLf & 被研指题
        .Cells(1, 2) = WSAS.Name
        .Cells(1, 3) = 典集本页.Count
    End With
    母行 = 母行 + 1
    '------------------------------------------------------------------------------------
    '设置参数
    '------------------------------------------------------------------------------------
    Dim 内列标名 As Integer
    Dim 内列标数总 As Integer
    Dim 内列标数涨 As Integer
    Dim 内列标比涨 As Integer
    Dim 内列标比高G3 As Integer
    Dim 内列标比高G1 As Integer
    Dim 内列标比高G0 As Integer
    Dim 内列标涨幅和 As Integer
    Dim 内列标涨幅均 As Integer
    Dim 内列标高幅和 As Integer
    Dim 内列标高幅均 As Integer
    内列标名 = 1
    内列标数总 = 2
    内列标数涨 = 3
    内列标比涨 = 4
    内列标涨幅和 = 5
    内列标涨幅均 = 6
    内列标比高G3 = 7
    内列标比高G1 = 8
    内列标比高G0 = 9
    内列标高幅和 = 10
    内列标高幅均 = 11
    Dim 内列标数列 As Integer
    内列标数列 = 11
    '------------------------------------------------------------------------------------
    '格式化
    '------------------------------------------------------------------------------------
    With WSTO.Cells(母行, 1)
        .Resize(1, 内列标数列).Interior.Color = 常色主靛
        .Resize(1, 内列标数列).Font.Bold = True
        .Cells(1, 内列标名) = "指标"
        .Cells(1, 内列标数总) = "数总"
        .Cells(1, 内列标数涨) = "数涨"
        .Cells(1, 内列标比涨) = "比涨+"
        .Cells(1, 内列标涨幅和) = "涨幅和"
        .Cells(1, 内列标涨幅均) = "涨幅均"
        .Cells(1, 内列标比高G3) = "比高G3"
        .Cells(1, 内列标比高G1) = "比高G1"
        .Cells(1, 内列标比高G0) = "比高G0"
        .Cells(1, 内列标高幅和) = "高幅和"
        .Cells(1, 内列标高幅均) = "高幅均"
    End With
    '------------------------------------------------------------------------------------
    '输出指标
    '------------------------------------------------------------------------------------
    For N = 1 To 典集标数.Count
        目行 = 母行 + N
        '--------------------------------------------------------------------------------
        WSTO.Cells(目行, 内列标名) = 典集标数.Keys(N - 1)
        '统计：数
        WSTO.Cells(目行, 内列标数总) = 典集标数.Items(N - 1)
        WSTO.Cells(目行, 内列标数涨) = 典集标涨数.Items(N - 1)
        If 典集标数.Items(N - 1) > 5 Then
            WSTO.Cells(目行, 内列标比涨) = Round(典集标涨数.Items(N - 1) / 典集标数.Items(N - 1), 1)
            WSTO.Cells(目行, 内列标比高G3) = Round(典集标高数G3.Items(N - 1) / 典集标数.Items(N - 1), 1)
            WSTO.Cells(目行, 内列标比高G1) = Round(典集标高数G1.Items(N - 1) / 典集标数.Items(N - 1), 1)
            WSTO.Cells(目行, 内列标比高G0) = Round(典集标高数G0.Items(N - 1) / 典集标数.Items(N - 1), 1)
        End If
        '统计：涨幅
        WSTO.Cells(目行, 内列标涨幅和) = 典集标涨幅.Items(N - 1)
        WSTO.Cells(目行, 内列标涨幅均) = Round(典集标涨幅.Items(N - 1) / 典集标数.Items(N - 1), 1)
        '统计：高幅
        WSTO.Cells(目行, 内列标高幅和) = 典集标高幅.Items(N - 1)
        WSTO.Cells(目行, 内列标高幅均) = Round(典集标高幅.Items(N - 1) / 典集标数.Items(N - 1), 1)
        '--------------------------------------------------------------------------------
        '格式化：分行
        '--------------------------------------------------------------------------------
        If WSTO.Cells(目行, 内列标数总) > 5 Then
            WSTO.Cells(目行, 1).Resize(1, 内列标数列).Interior.ColorIndex = 36
        Else
            WSTO.Cells(目行, 1).Resize(1, 内列标数列).Interior.ColorIndex = 15
        End If
        With WSTO.Cells(目行, 1)
            .Interior.Color = 基色底
            If InStr(.Value, "2c") > 0 Then
                .Interior.TintAndShade = -0.5
            ElseIf InStr(.Value, "2d") > 0 Then
                .Interior.TintAndShade = -0.4
            ElseIf InStr(.Value, "2e") > 0 Then
                .Interior.TintAndShade = -0.3
            ElseIf InStr(.Value, "1b") > 0 Or InStr(.Value, "1w") > 0 Or InStr(.Value, "1e") > 0 Then
                .Interior.TintAndShade = -0.1
            End If
        End With
        '--------------------------------------------------------------------------------
    Next
    '------------------------------------------------------------------------------------
    '排序
    '------------------------------------------------------------------------------------
    With WSTO.Cells(母行, 1).Resize(1 + 典集标数.Count, 内列标数列)
        .Sort key1:=.Cells(1, 内列标名), order1:=xlAscending, _
                Header:=xlYes
                
    End With
'    For N = 2 To WSTO.Cells(65536, 2).End(xlUp).Row
'        If WSTO.Cells(N, 内列标数总) > 5 Then
'            WSTO.Cells(N, 1).Resize(1, 内列标数列).Interior.ColorIndex = 36
'        Else
'            WSTO.Cells(N, 1).Resize(1, 内列标数列).Interior.ColorIndex = 15
'        End If
'        WSTO.Cells(N, 1).Interior.ColorIndex = 37
'    Next
    '--------------------------------------------
    WSTO.Columns.HorizontalAlignment = xlRight
    WSTO.Columns(1).HorizontalAlignment = xlLeft
    WSTO.Columns(1).ColumnWidth = 15
    WSTO.Columns(1).Font.Bold = True
    WSTO.Columns(内列标涨幅和).NumberFormatLocal = 全设格式of零位
    WSTO.Columns(内列标高幅和).NumberFormatLocal = 全设格式of零位
    WSTO.Columns(内列标比涨).Font.Bold = True
    WSTO.Columns(内列标比涨).Font.ColorIndex = 15
    WSTO.Columns(内列标比涨).NumberFormatLocal = 全设格式of百分
    WSTO.Columns(内列标比高G3).Font.Bold = True
    WSTO.Columns(内列标比高G3).Font.ColorIndex = 15
    WSTO.Columns(内列标比高G3).NumberFormatLocal = 全设格式of百分
    WSTO.Columns(内列标比高G1).Font.Bold = True
    WSTO.Columns(内列标比高G1).Font.ColorIndex = 15
    WSTO.Columns(内列标比高G1).NumberFormatLocal = 全设格式of百分
    WSTO.Columns(内列标比高G0).Font.Bold = True
    WSTO.Columns(内列标比高G0).Font.ColorIndex = 15
    WSTO.Columns(内列标比高G0).NumberFormatLocal = 全设格式of百分
    WSTO.Columns(内列标涨幅均).Font.Bold = True
    WSTO.Columns(内列标高幅均).Font.Bold = True
''========================================================================================
''操作：筛选
''========================================================================================
'    UTL宏工具_BEGIN
'    '------------------------------------------------------------------------------------
'    MSG = MSG & vbCrLf
'    MSG = MSG & "【QQQ本页决策】"
'    MSG = MSG & vbCrLf
'    MSG = MSG & "工表名：" & 当前表名
'
'    TTT = Timer
'    计时过程 = CInt(Timer - TTT)
'
'    MSG = MSG & vbCrLf
'    MSG = MSG & "QQQ筛选用时：" & 计时过程
'    '------------------------------------------------------------------------------------
'    UTL宏工具_END
'========================================================================================
'返回
'========================================================================================
    MSG = MSG & vbCrLf & WSAS.Name & vbCrLf & 典集本页.Count
    Set 典集本页 = Nothing
    Erase 元组被分
'========================================================================================
    IQQQ展擎筛程_统计本页基程 = MSG
End Function










'########################################################################################
'########################################################################################
'#####################################   QQQ  筛程至页   ################################
'########################################################################################
'########################################################################################
'========================================================================================
'主程序：按日分类
'特殊组合：主要针对日基周局
'两个重点：一是不被主流覆盖的区域，如6v、5e
'二是：针对周类浪：w2c,2d,2e,3v,1b
'醍醐灌顶20220702：不要针对月线低位过分关注，还是应该遵循周类持仓规则，否则容易落入陷阱。
'领悟20211103：均线走势根据不同的级别可以区分不同的浪。对于大级别均线，如WJCDE，可以用来
'              识别大级别走势，获取大级别利润。但与此同时，在真正的浪中，小级别走势均线
'              DJCDE+DJABC，同样能够区分主升浪。而且，更为重要的是，只有小浪DJABC多头排列，
'              才能够实际赚钱。所以，可以重点关注，三点要求，一是月线阈值要超过，而是周级别
'              多头排列，三是日级别风控（JA破JC清仓；JA破JB关注）
'========================================================================================
'特殊组合
'探索【试仓】机会：
'    【月类】基础2c/1b/1w/1v/2e(只针对6w)
'    【周类】线上：2c/2d/1b/1w/6w/2i/3h
'    【周类】线下：2e/3v/3w(偏离较大)
'执行时间：
'   周四周五周末（SSS）选择本周下跌
'   周一周二周三周四（SCC）选择本周下跌（最好上周也下跌）
'修改目标：只搜索机会进入【机池】，不求全，只求有机会
'========================================================================================
Function IQQQ展擎筛程至C3章按日乾( _
          ByRef WB As Workbook _
        , ByVal 表名 As String _
        , ByRef 谕组 As Variant _
        , Optional ByRef 典码输出 As Dictionary _
        , Optional ByVal 章签 As String = "" _
        , Optional ByVal 章色 As Long = 常色十青 _
        , Optional ByVal 出节模式 As String = "日层" _
        , Optional ByVal 出全是否 As Boolean = True _
        ) As String
'========================================================================================
'声明变量
'========================================================================================
    Dim CIDL As String
    Dim 是否二筛 As Boolean
'========================================================================================
'定义典
'========================================================================================
    Dim 典日乾停牌 As New Dictionary
    Dim 典日乾错误 As New Dictionary
    Dim 典日乾禁入 As New Dictionary
'    '---------------------------------------
'    Dim 典日乾正剔宽 As New Dictionary
'    Dim 典日乾正上 As New Dictionary
'    Dim 典日乾正忐 As New Dictionary
'    Dim 典日乾正余 As New Dictionary
'    Dim 典日乾正一 As New Dictionary
'    Dim 典日乾正× As New Dictionary
''    Dim 典日乾正WA入E As New Dictionary
''    Dim 典日乾正WB入D As New Dictionary
''    Dim 典日乾正WC入D As New Dictionary
''    Dim 典日乾正WG主龙 As New Dictionary
'    '---------------------------------------
'    Dim 典日乾负剔宽 As New Dictionary
'    Dim 典日乾负WA入E As New Dictionary
'    Dim 典日乾负WB入D As New Dictionary
'    Dim 典日乾负WC入D As New Dictionary
'    Dim 典日乾负WG主龙 As New Dictionary
    '---------------------------------------
    Dim 典日乾日联屎尿屁 As New Dictionary
    Dim 典日乾日联铜 As New Dictionary
    Dim 典日乾日联银 As New Dictionary
    Dim 典日乾日联金警 As New Dictionary
    Dim 典日乾日联金余 As New Dictionary
    '---------------------------------------
    Dim 典日乾CD正ZC正顶 As New Dictionary
    Dim 典日乾CD正余 As New Dictionary
    Dim 典日乾CD负 As New Dictionary
'========================================================================================
'筛选：微观 以周为粒度进行柱类分析
'========================================================================================
    For Y = 1 To 典码输出.Count
        X = 典码输出.Items(Y - 1)
        CIDL = 谕组(X, 位qt代码)
        值日基月局 = 谕组(X, 位谕of日基月局)
        值日基周局 = 谕组(X, 位谕of日基周局)
        值日基日局 = 谕组(X, 位谕of日基日局)
        '================================================================================
        If UBCID是代码(CIDL) = False Then
                Stop
        ElseIf 谕组(X, 位qt停牌) = "S" Then
                典日乾停牌.Add Item:=X, Key:=CIDL
        '================================================================================
        '注20260426：按WTZA分类：当满足基本条件（WXZC＞0，WXAB＞0，WXZB＞0），按WXZA分类：WTZA≥2（甲）WTZA=1（丙）WTZA=-1（乙）
        '================================================================================
        ElseIf InStr(谕组(X, 位谕of日层联动), "屎") > 0 _
            Or InStr(谕组(X, 位谕of日层联动), "尿") > 0 _
            Or InStr(谕组(X, 位谕of日层联动), "屁") > 0 Then
                典日乾日联屎尿屁.Add Item:=X, Key:=CIDL
        ElseIf InStr(谕组(X, 位谕of日层联动), "铜") > 0 Then
                典日乾日联铜.Add Item:=X, Key:=CIDL
        ElseIf InStr(谕组(X, 位谕of日层联动), "银") > 0 Then
                典日乾日联银.Add Item:=X, Key:=CIDL
        ElseIf InStr(谕组(X, 位谕of日层联动), "警") > 0 Then        '日层段：丁戊
                典日乾日联金警.Add Item:=X, Key:=CIDL
        Else
                典日乾日联金余.Add Item:=X, Key:=CIDL
        End If
'        '================================================================================
'        '注20251220：核心是将WXAB在日类展开，所以选取范围是针对周类(√口)，日类满足（DXCD＞0）或（DXCD＜0且DXZC＞0，最好要求DXZD＞0）；然后进一步在日类展开，其中针对[主]选取触顶ab，其余按照柱排进行展示。
'        '================================================================================
'        ElseIf 谕组(X, 位谕of日类BTCD) > 0 Then
'            If 谕组(X, 位谕of日类BTZC) > 0 Then
'                If (谕组(X, 位谕of仓类) = "_aO" Or 谕组(X, 位谕of仓类) = "_bO") Then
'                        '只针对“龙ab”进行筛选
'                        典日乾CD正ZC正顶.Add Item:=X, Key:=CIDL
'                ElseIf 谕组(X, 位谕of日类BTZD) > 0 Then
'                        典日乾CD正余.Add Item:=X, Key:=CIDL
'                End If
'            Else
'                        '注20251220：要在其中寻找周类可能再次站上WJA的机会。一定要注意WXBC的重要性：所有周类主升，基本都满足DXBC正交；当DXBC负交时，很可能转为跌势。
'                        典日乾CD正余.Add Item:=X, Key:=CIDL
'            End If
'        '------------------------------------------------------------------------
'        Else
'            '由于DXCD负交，所以周层都处于过渡期，不需要进行细分。注意，没有必要包含DJC之下的情况。
'            If 谕组(X, 位谕of日类BTZC) > 0 Then
'                        典日乾CD负.Add Item:=X, Key:=CIDL
'            Else
'                        '当DXCD＜0时，必须要求DXZC＞0，最好进一步要求DXZD＞0。所以，此处不进行筛选。
'            End If
'        End If
        '================================================================================
    Next
'========================================================================================
'类别：日级别筛 其中再分用于后续按日再分
'【龙】等同于：日基周局DJEDC多头排列
'醍醐灌顶20231001：全部按照DJE与DJC进行划分，主要包含：DJE初（W1v-W1b）、DJC初（WXCD/D1v-D1b）、DJC顶段（DXAB/DXAC）、DJC升段（其他/DXZB劫）、DJC末（D3w/WXCE/DJC下DJD上）、DJE末(DJD下DJE上)
'核心思想20231001：利用DJE形成的丘，改进方式为添加以DJC形成的丘进行优化（但不要过分依赖，核心还是DJE）
'========================================================================================
'----------------------------------------------------------------------------------------
'注20260426：配合周日联动，只按照WXZA与DXZA进行分类。
'----------------------------------------------------------------------------------------
        Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="日层", 出全是否:=出全是否, 节色:=章色, 典码输出:=典日乾日联金余, 节签:="【日乾】金.甲乙丙己")
        Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="日层", 出全是否:=出全是否, 节色:=章色, 典码输出:=典日乾日联金警, 节签:="【日乾】金.警")
        Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="日层", 出全是否:=出全是否, 节色:=章色, 典码输出:=典日乾日联银, 节签:="【日乾】银")
        Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="日层", 出全是否:=出全是否, 节色:=章色, 典码输出:=典日乾日联铜, 节签:="【日乾】铜")
        Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="日层", 出全是否:=出全是否, 节色:=章色, 典码输出:=典日乾日联屎尿屁, 节签:="【日乾】屎尿屁")
''----------------------------------------------------------------------------------------
''注20250303：配合周日联动，只按照DXCD与DXZC进行分类。
''----------------------------------------------------------------------------------------
'        Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="日层", 出全是否:=出全是否, 节色:=章色, 典码输出:=典日乾CD正ZC正顶, 节签:="【日乾】日CD正.ZC正顶（日级别主升）")
'        Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="日层", 出全是否:=出全是否, 节色:=章色, 典码输出:=典日乾CD正余, 节签:="【日乾】日CD正.余（包含ZC正&ZC负）")
'        Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="日层", 出全是否:=出全是否, 节色:=章色, 典码输出:=典日乾CD负, 节签:="【日乾】日CD负（不含DJC以下）")
'========================================================================================
'返回
'========================================================================================
    IQQQ展擎筛程至C3章按日乾 = MSG
'========================================================================================
End Function





'========================================================================================
'========================================================================================
'功能：按照出节模式输出到块
'模式：日全
'注20250601：不要以柱排作为筛选原则，而要以日类中符进行分类，并按照日层（初主、再、储/6v/6w/1v/1w）分类展示。
'针对日中符，存在以下分类原则：日中符为ABC柱（首鼎很可能诱多（DTZA≤1）、WJA上多柱最有把握（DTZA≥2））日中符为DEF柱可能震仓（首薡（DTZA≥-1）、WJA下多柱（DTZA≤-2））
'注20251220：细分原则，先[日层]再[柱排]，针对特殊情况使用[顶型]。对于[日层：初储再]，由于存续时间较短，只按照[柱排]分类，不具体按顶型分类；对于[日层：主]，由于存续时间可能很长，需要先根据[顶型]筛选主升，再依赖[柱排]确定方向。
'注20251220：必须突出DXBC重要性，当周类处于主升阶段时，必然满足DXBC＞0；反之，当DXBC负交，很可能已经转为周级别下跌趋势，不应再参与。
'注20251220：日类的作用是作为周类的展开，必须严格贯彻WXAB护丘原则，抓住（DXCD＞0）以及（DXCD＜0且DXZC＞0）区域。对于处于（DXCD>0且DXZC<0）的情况，当DXZD＞0，但出现再次上破DJC迹象时，可参与。
'========================================================================================
'========================================================================================
Function IQQQ展擎筛程至D3节按日层( _
          ByRef WB As Workbook _
        , ByVal 表名 As String _
        , ByRef 谕组 As Variant _
        , Optional ByRef 典码输出 As Dictionary _
        , Optional ByVal 节签 As String = "" _
        , Optional ByVal 节色 As Long = 常色十青 _
        , Optional ByVal 出节模式 As String = "日层" _
        , Optional ByVal 出全是否 As Boolean = True _
        ) As String
'========================================================================================
'声明变量
'========================================================================================
    Dim CIDL As String
    Dim 是否筛机 As Boolean
    '------------------------------------------------------------------------------------
    Dim 参阈连阳 As Integer
    参阈连阳 = 4
'========================================================================================
'定义典
'========================================================================================
    Dim 典日正破_ABC假鼎 As New Dictionary
    Dim 典日正破_ABC初三 As New Dictionary
    Dim 典日正破_ABC余升排 As New Dictionary
    Dim 典日正破_ABC余非升 As New Dictionary
    Dim 典日正破_DEF初首 As New Dictionary
    Dim 典日正破_DEF余多 As New Dictionary
    '---------------------------------------------------
    Dim 典日正主_梯升连冲 As New Dictionary
    Dim 典日正主_梯升孕冲 As New Dictionary
    Dim 典日正主_梯升调待 As New Dictionary
    Dim 典日正主_梯交调待 As New Dictionary
    Dim 典日正主_梯交跌警 As New Dictionary
    Dim 典日正主_栏调吞冲 As New Dictionary
    Dim 典日正主_栏调孕待 As New Dictionary
    Dim 典日正主_栏调吞待 As New Dictionary
    Dim 典日正主_栅调吞冲 As New Dictionary
    Dim 典日正主_栅调孕待 As New Dictionary
    Dim 典日正主_栅调吞待 As New Dictionary
    Dim 典日正主_枝启升冲 As New Dictionary
    Dim 典日正主_枝贯连待 As New Dictionary
    Dim 典日正主_枝启踩警 As New Dictionary
    Dim 典日正主_枝贯单待 As New Dictionary
    Dim 典日正主_根全 As New Dictionary
    Dim 典日正主_杂全 As New Dictionary
    '---------------------------------------
    Dim 典日正再_梯升连冲 As New Dictionary
    Dim 典日正再_梯升孕冲 As New Dictionary
    Dim 典日正再_梯升调待 As New Dictionary
    Dim 典日正再_梯交调待 As New Dictionary
    Dim 典日正再_梯交跌警 As New Dictionary
    Dim 典日正再_栏调吞冲 As New Dictionary
    Dim 典日正再_栏调孕待 As New Dictionary
    Dim 典日正再_栏调吞待 As New Dictionary
    Dim 典日正再_栅调吞冲 As New Dictionary
    Dim 典日正再_栅调孕待 As New Dictionary
    Dim 典日正再_栅调吞待 As New Dictionary
    Dim 典日正再_枝启升冲 As New Dictionary
    Dim 典日正再_枝贯连待 As New Dictionary
    Dim 典日正再_枝启踩警 As New Dictionary
    Dim 典日正再_枝贯单待 As New Dictionary
    Dim 典日正再_根全 As New Dictionary
    Dim 典日正再_杂全 As New Dictionary
    '---------------------------------------
    Dim 典日正初储_梯升连冲 As New Dictionary
    Dim 典日正初储_梯升孕冲 As New Dictionary
    Dim 典日正初储_梯升调待 As New Dictionary
    Dim 典日正初储_梯交调待 As New Dictionary
    Dim 典日正初储_梯交跌警 As New Dictionary
    Dim 典日正初储_栏调吞冲 As New Dictionary
    Dim 典日正初储_栏调孕待 As New Dictionary
    Dim 典日正初储_栏调吞待 As New Dictionary
    Dim 典日正初储_栅调吞冲 As New Dictionary
    Dim 典日正初储_栅调孕待 As New Dictionary
    Dim 典日正初储_栅调吞待 As New Dictionary
    Dim 典日正初储_枝启升冲 As New Dictionary
    Dim 典日正初储_枝贯连待 As New Dictionary
    Dim 典日正初储_枝启踩警 As New Dictionary
    Dim 典日正初储_枝贯单待 As New Dictionary
    Dim 典日正初储_根全 As New Dictionary
    Dim 典日正初储_杂全 As New Dictionary
    '---------------------------------------------------
    Dim 典日层负A_BC负交芽 As New Dictionary
    Dim 典日层负A_BC负交根 As New Dictionary
    Dim 典日层负A_BC负交管 As New Dictionary
    Dim 典日层负A_BC正交4v As New Dictionary
    Dim 典日层负A_BC正交4w As New Dictionary
    Dim 典日层负A_BC正交4b As New Dictionary
    Dim 典日层负A_BC正交4e As New Dictionary
    '-------------
    Dim 典日层负G管顶合余 As New Dictionary
    Dim 典日层负G管顶合剔偏大 As New Dictionary
    Dim 典日层负G管顶合剔宽大 As New Dictionary
    Dim 典日层负G管顶合剔连久 As New Dictionary
    Dim 典日层负G管顶离 As New Dictionary
    Dim 典日层负G根 As New Dictionary
    Dim 典日层负G芽 As New Dictionary
    '-------------
    Dim 典日层负B管芽 As New Dictionary
    Dim 典日层负C管芽 As New Dictionary
    Dim 典日层负D管芽 As New Dictionary
    Dim 典日层负BCD根 As New Dictionary
    '-------------
    Dim 典日层负C根6w As New Dictionary
    Dim 典日层负B根6v As New Dictionary
    '---------------------------------------------------
    Dim 典日层废单停牌 As New Dictionary
'========================================================================================
'筛选：微观 以周为粒度进行柱类分析
'========================================================================================
    For Y = 1 To 典码输出.Count
        X = 典码输出.Items(Y - 1)
        CIDL = 谕组(X, 位qt代码)
        值日基日局 = 谕组(X, 位谕of日基日局)
        是否筛机 = False
        '================================================================================
        If UBCID是代码(CIDL) = False Then
        ElseIf 谕组(X, 位qt停牌) = "S" Then     '测试用
                        典日层废单停牌.Add Item:=X, Key:=CIDL
        '--------------------------------------------------------------------------------
        '控制输出：【出全是否】是否只输出DJD之上。因为K柱围绕DJC波动，所以利用DJD来进行限制。
        '注20251220：不要用DXZD＞0来限制输出，当WXAB＞0时即使DXZD＜0，仍然属于可捡漏情况。所以将此处条件注销，是否限制DXZD＞0，需要在上级外部条件进行过滤。
        '--------------------------------------------------------------------------------
        'ElseIf 出全是否 = False And 谕组(X, 位谕of日类BTZD) < 0 Then
        '--------------------------------------------------------------------------------
        '单独列示：破
        '--------------------------------------------------------------------------------
        ElseIf Left(谕组(X, 位谕of日层界), 1) = "破" Then
                        If Right(谕组(X, 位谕of日管中符串), 1) = "A" Or Right(谕组(X, 位谕of日管中符串), 1) = "B" Or Right(谕组(X, 位谕of日管中符串), 1) = "C" Then
                            If 谕组(X, 位谕of日类BTZA) <= 0 Then    '假鼎
                                典日正破_ABC假鼎.Add Item:=X, Key:=CIDL
                            ElseIf 谕组(X, 位谕of日类BTZA) <= 3 Then    '包含：初始突破WJA
                                典日正破_ABC初三.Add Item:=X, Key:=CIDL
                            ElseIf InStr(谕组(X, 位谕of日层柱排), "升.") > 0 Then
                                典日正破_ABC余升排.Add Item:=X, Key:=CIDL
                            Else
                                典日正破_ABC余非升.Add Item:=X, Key:=CIDL
                            End If
                        Else
                            If 谕组(X, 位谕of日类BTZA) >= -1 Then '首薡
                                典日正破_DEF初首.Add Item:=X, Key:=CIDL
                            Else
                                典日正破_DEF余多.Add Item:=X, Key:=CIDL
                            End If
                        End If
        '--------------------------------------------------------------------------------
        '单独列示：储/初
        '注：在WJA之上凡是逆趋势（跌孕/跌吞/跌连）都是机会，需要甄别。
        '--------------------------------------------------------------------------------
        ElseIf Left(谕组(X, 位谕of日层界), 1) = "储" Or Left(谕组(X, 位谕of日层界), 1) = "初" Then
                        If InStr(谕组(X, 位谕of日层柱型), "梯") > 0 Then
                            If InStr(谕组(X, 位谕of日层柱型), "梯升连冲") > 0 Then
                                典日正初储_梯升连冲.Add Item:=X, Key:=CIDL
                            ElseIf InStr(谕组(X, 位谕of日层柱型), "梯升孕冲") > 0 Then
                                典日正初储_梯升孕冲.Add Item:=X, Key:=CIDL
                            ElseIf InStr(谕组(X, 位谕of日层柱型), "梯升调待") > 0 Then
                                典日正初储_梯升调待.Add Item:=X, Key:=CIDL
                            ElseIf InStr(谕组(X, 位谕of日层柱型), "梯交调待") > 0 Then
                                典日正初储_梯交调待.Add Item:=X, Key:=CIDL
                            Else
                                典日正初储_梯交跌警.Add Item:=X, Key:=CIDL
                            End If
                        ElseIf InStr(谕组(X, 位谕of日层柱型), "栏") > 0 Then
                            If InStr(谕组(X, 位谕of日层柱型), "栏调吞冲") > 0 Then
                                典日正初储_栏调吞冲.Add Item:=X, Key:=CIDL
                            ElseIf InStr(谕组(X, 位谕of日层柱型), "栏调孕待") > 0 Then
                                典日正初储_栏调孕待.Add Item:=X, Key:=CIDL
                            Else
                                典日正初储_栏调吞待.Add Item:=X, Key:=CIDL
                            End If
                        ElseIf InStr(谕组(X, 位谕of日层柱型), "栅") > 0 Then
                            If InStr(谕组(X, 位谕of日层柱型), "栅调吞冲") > 0 Then
                                典日正初储_栅调吞冲.Add Item:=X, Key:=CIDL
                            ElseIf InStr(谕组(X, 位谕of日层柱型), "栅调孕待") > 0 Then
                                典日正初储_栅调孕待.Add Item:=X, Key:=CIDL
                            Else
                                典日正初储_栅调吞待.Add Item:=X, Key:=CIDL
                            End If
                        ElseIf InStr(谕组(X, 位谕of日层柱型), "枝") > 0 Then
                            If InStr(谕组(X, 位谕of日层柱型), "枝启升冲") > 0 Then
                                典日正初储_枝启升冲.Add Item:=X, Key:=CIDL
                            ElseIf InStr(谕组(X, 位谕of日层柱型), "枝启踩警") > 0 Then
                                典日正初储_枝启踩警.Add Item:=X, Key:=CIDL
                            ElseIf InStr(谕组(X, 位谕of日层柱型), "枝贯连待") > 0 Then
                                典日正初储_枝贯连待.Add Item:=X, Key:=CIDL
                            Else
                                典日正初储_枝贯单待.Add Item:=X, Key:=CIDL
                            End If
                        ElseIf InStr(谕组(X, 位谕of日层柱型), "根") > 0 Then
                                典日正初储_根全.Add Item:=X, Key:=CIDL
                        Else
                                典日正初储_杂全.Add Item:=X, Key:=CIDL
                        End If
        '--------------------------------------------------------------------------------
        'ZC之上
        '--------------------------------------------------------------------------------
        ElseIf 谕组(X, 位谕of日类BTZC) > 0 Then
                '------------------------------------------------------------------------
                '单独列示：再
                '------------------------------------------------------------------------
                If InStr(谕组(X, 位谕of日层界), "再") > 0 Then
                        If InStr(谕组(X, 位谕of日层柱型), "梯") > 0 Then
                            If InStr(谕组(X, 位谕of日层柱型), "梯升连冲") > 0 Then
                                典日正再_梯升连冲.Add Item:=X, Key:=CIDL
                            ElseIf InStr(谕组(X, 位谕of日层柱型), "梯升孕冲") > 0 Then
                                典日正再_梯升孕冲.Add Item:=X, Key:=CIDL
                            ElseIf InStr(谕组(X, 位谕of日层柱型), "梯升调待") > 0 Then
                                典日正再_梯升调待.Add Item:=X, Key:=CIDL
                            ElseIf InStr(谕组(X, 位谕of日层柱型), "梯交调待") > 0 Then
                                典日正再_梯交调待.Add Item:=X, Key:=CIDL
                            Else
                                典日正再_梯交跌警.Add Item:=X, Key:=CIDL
                            End If
                        ElseIf InStr(谕组(X, 位谕of日层柱型), "栏") > 0 Then
                            If InStr(谕组(X, 位谕of日层柱型), "栏调吞冲") > 0 Then
                                典日正再_栏调吞冲.Add Item:=X, Key:=CIDL
                            ElseIf InStr(谕组(X, 位谕of日层柱型), "栏调孕待") > 0 Then
                                典日正再_栏调孕待.Add Item:=X, Key:=CIDL
                            Else
                                典日正再_栏调吞待.Add Item:=X, Key:=CIDL
                            End If
                        ElseIf InStr(谕组(X, 位谕of日层柱型), "栅") > 0 Then
                            If InStr(谕组(X, 位谕of日层柱型), "栅调吞冲") > 0 Then
                                典日正再_栅调吞冲.Add Item:=X, Key:=CIDL
                            ElseIf InStr(谕组(X, 位谕of日层柱型), "栅调孕待") > 0 Then
                                典日正再_栅调孕待.Add Item:=X, Key:=CIDL
                            Else
                                典日正再_栅调吞待.Add Item:=X, Key:=CIDL
                            End If
                        ElseIf InStr(谕组(X, 位谕of日层柱型), "枝") > 0 Then
                            If InStr(谕组(X, 位谕of日层柱型), "枝启升冲") > 0 Then
                                典日正再_枝启升冲.Add Item:=X, Key:=CIDL
                            ElseIf InStr(谕组(X, 位谕of日层柱型), "枝启踩警") > 0 Then
                                典日正再_枝启踩警.Add Item:=X, Key:=CIDL
                            ElseIf InStr(谕组(X, 位谕of日层柱型), "枝贯连待") > 0 Then
                                典日正再_枝贯连待.Add Item:=X, Key:=CIDL
                            Else
                                典日正再_枝贯单待.Add Item:=X, Key:=CIDL
                            End If
                        ElseIf InStr(谕组(X, 位谕of日层柱型), "根") > 0 Then
                                典日正再_根全.Add Item:=X, Key:=CIDL
                        Else
                                典日正再_杂全.Add Item:=X, Key:=CIDL
                        End If
                '------------------------------------------------------------------------
                '单独列示：主
                '注20251220：细分原则，先[日层]再[柱排]，针对特殊情况使用[顶型]。
                '    对于[日层：初储再]，由于存续时间较短，只按照[柱排]分类，不具体按顶型分类；
                '    对于[日层：主]，由于存续时间可能很长，需要先根据[顶型]筛选主升，再依赖[柱排]确定方向。对于特定顶型的筛选（日级别顶ab），最好放在此程序的外面，先单独筛选，再由此程序展开。
                '------------------------------------------------------------------------
                Else
                        If InStr(谕组(X, 位谕of日层柱型), "梯") > 0 Then
                            If InStr(谕组(X, 位谕of日层柱型), "梯升连冲") > 0 Then
                                典日正主_梯升连冲.Add Item:=X, Key:=CIDL
                            ElseIf InStr(谕组(X, 位谕of日层柱型), "梯升孕冲") > 0 Then
                                典日正主_梯升孕冲.Add Item:=X, Key:=CIDL
                            ElseIf InStr(谕组(X, 位谕of日层柱型), "梯升调待") > 0 Then
                                典日正主_梯升调待.Add Item:=X, Key:=CIDL
                            ElseIf InStr(谕组(X, 位谕of日层柱型), "梯交调待") > 0 Then
                                典日正主_梯交调待.Add Item:=X, Key:=CIDL
                            Else
                                典日正主_梯交跌警.Add Item:=X, Key:=CIDL
                            End If
                        ElseIf InStr(谕组(X, 位谕of日层柱型), "栏") > 0 Then
                            If InStr(谕组(X, 位谕of日层柱型), "栏调吞冲") > 0 Then
                                典日正主_栏调吞冲.Add Item:=X, Key:=CIDL
                            ElseIf InStr(谕组(X, 位谕of日层柱型), "栏调孕待") > 0 Then
                                典日正主_栏调孕待.Add Item:=X, Key:=CIDL
                            Else
                                典日正主_栏调吞待.Add Item:=X, Key:=CIDL
                            End If
                        ElseIf InStr(谕组(X, 位谕of日层柱型), "栅") > 0 Then
                            If InStr(谕组(X, 位谕of日层柱型), "栅调吞冲") > 0 Then
                                典日正主_栅调吞冲.Add Item:=X, Key:=CIDL
                            ElseIf InStr(谕组(X, 位谕of日层柱型), "栅调孕待") > 0 Then
                                典日正主_栅调孕待.Add Item:=X, Key:=CIDL
                            Else
                                典日正主_栅调吞待.Add Item:=X, Key:=CIDL
                            End If
                        ElseIf InStr(谕组(X, 位谕of日层柱型), "枝") > 0 Then
                            If InStr(谕组(X, 位谕of日层柱型), "枝启升冲") > 0 Then
                                典日正主_枝启升冲.Add Item:=X, Key:=CIDL
                            ElseIf InStr(谕组(X, 位谕of日层柱型), "枝启踩警") > 0 Then
                                典日正主_枝启踩警.Add Item:=X, Key:=CIDL
                            ElseIf InStr(谕组(X, 位谕of日层柱型), "枝贯连待") > 0 Then
                                典日正主_枝贯连待.Add Item:=X, Key:=CIDL
                            Else
                                典日正主_枝贯单待.Add Item:=X, Key:=CIDL
                            End If
                        ElseIf InStr(谕组(X, 位谕of日层柱型), "根") > 0 Then
                                典日正主_根全.Add Item:=X, Key:=CIDL
                        Else
                                典日正主_杂全.Add Item:=X, Key:=CIDL
                        End If
                End If
        '--------------------------------------------------------------------------------
        'ZC之下
        '注20251220：必须突出DXBC重要性，当周类处于主升阶段时，必然满足DXBC＞0；反之，当DXBC负交，很可能已经转为周级别下跌趋势，不应再参与。
        '   根据以上DXBC的重要性，可得DJC之下的机会：只能是[_初]，最好是DXBC未形成负交时，或形成负交不久；其次，为/6w/6v；至于[_再]，即使形成DXAB或DXAC正交，也只能参考。
        '--------------------------------------------------------------------------------
        Else
                '------------------------------------------------------------------------
                '类别：针对坤BCD
                '注20251220：由于DXBC＜0，不存在机会。
                '------------------------------------------------------------------------
                If InStr(谕组(X, 位谕of日层类合), 常枚层类B) > 0 Or InStr(谕组(X, 位谕of日层类合), 常枚层类C) > 0 Or InStr(谕组(X, 位谕of日层类合), 常枚层类D) > 0 Then
                        If InStr(谕组(X, 位谕of日层类合), 常枚层别根) > 0 Then
                                典日层负BCD根.Add Item:=X, Key:=CIDL
                        ElseIf InStr(谕组(X, 位谕of日层类合), 常枚层类B) > 0 Then
                                典日层负B管芽.Add Item:=X, Key:=CIDL
                        ElseIf InStr(谕组(X, 位谕of日层类合), 常枚层类C) > 0 Then
                                典日层负C管芽.Add Item:=X, Key:=CIDL
                        Else
                                典日层负D管芽.Add Item:=X, Key:=CIDL
                        End If
                '------------------------------------------------------------------------
                '主升层：只针对【G】
                '注20251220：由于DXBC＜0，不存在机会。
                '------------------------------------------------------------------------
                ElseIf InStr(谕组(X, 位谕of日层类合), 常枚层类G) > 0 Then
                        '----------------------------------------------------------------
                        If InStr(谕组(X, 位谕of日层类合), 常枚层别管) > 0 Then
                            If 谕组(X, 位谕of日龟BT合顶哼) > 0 Then     '合顶：防止尾部触顶
                                '注20240410：为了展示完整流程，仅对管进行特殊情况单列。
                                If 谕组(X, 位谕of日层BSLA) <= -8 Then
                                    典日层负G管顶合剔偏大.Add Item:=X, Key:=CIDL
                                ElseIf 谕组(X, 位谕of日层宽哈JC) <= -20 Then
                                    典日层负G管顶合剔宽大.Add Item:=X, Key:=CIDL
                                ElseIf 谕组(X, 位谕of日波龄BTPR0) <= -3 Then
                                    典日层负G管顶合剔连久.Add Item:=X, Key:=CIDL
                                Else
                                    典日层负G管顶合余.Add Item:=X, Key:=CIDL
                                End If
                            Else
                                    典日层负G管顶离.Add Item:=X, Key:=CIDL
                            End If
                        '----------------------------------------------------------------
                        '针对坤G
                        ElseIf InStr(谕组(X, 位谕of日层类合), 常枚层别根) > 0 Then
                                    典日层负G根.Add Item:=X, Key:=CIDL
                        Else
                                    典日层负G芽.Add Item:=X, Key:=CIDL
                        End If
                '------------------------------------------------------------------------
                '主升层：只针对【A】
                '注20251220：由于DXBC未负交或刚负交，尚且存在机会。
                '------------------------------------------------------------------------
                Else
                        '----------------------------------------------------------------
                        If 谕组(X, 位谕of日基日局) = "6w" Then
                                    典日层负C根6w.Add Item:=X, Key:=CIDL
                        ElseIf 谕组(X, 位谕of日基日局) = "6v" Then
                                    典日层负B根6v.Add Item:=X, Key:=CIDL
                        ElseIf 谕组(X, 位谕of日类BTBC) > 0 Then
                            If 谕组(X, 位谕of日基日局) = "4v" Then
                                    典日层负A_BC正交4v.Add Item:=X, Key:=CIDL
                            ElseIf 谕组(X, 位谕of日基日局) = "4w" Then
                                    典日层负A_BC正交4w.Add Item:=X, Key:=CIDL
                            ElseIf 谕组(X, 位谕of日基日局) = "4b" Then
                                    典日层负A_BC正交4b.Add Item:=X, Key:=CIDL
                            Else
                                    典日层负A_BC正交4e.Add Item:=X, Key:=CIDL
                            End If
                        Else
                            If InStr(谕组(X, 位谕of日层类合), 常枚层别管) > 0 Then
                                    典日层负A_BC负交管.Add Item:=X, Key:=CIDL
                            ElseIf InStr(谕组(X, 位谕of日层类合), 常枚层别根) > 0 Then
                                    典日层负A_BC负交根.Add Item:=X, Key:=CIDL
                            Else
                                    典日层负A_BC负交芽.Add Item:=X, Key:=CIDL
                            End If
                        End If
                        '----------------------------------------------------------------
                End If
                '------------------------------------------------------------------------
        End If
        '================================================================================
    Next
'========================================================================================
    Dim 区隐 As Boolean
    区隐 = False
    Dim 节缀 As String
    节缀 = ""
'========================================================================================
'输出：分类按照劫逐步变化的规律进行排列。先展现【劫：/ZA/ZB/BA/CA/BC】，再展现多头排列，再展现【跌：/JB/JC】，最后展现【暴】
'为何按触划分：因为只有触a（推动顶不断提高）才是【真正的上升】，其余情况即使有上升也是震荡，何况在非触情况更多的下跌。
'========================================================================================
'----------------------------------------------------------------------------------------
'【日正区域】
'【入初】判断与WJC是否相交。【层AD】肯定相交；【层CB】可能相交，也可能不相交。只有与WJC相交才是进入点，其余仅作参考，不可以作为进入点。
'----------------------------------------------------------------------------------------
If 出节模式 = "日层" Or 出节模式 = "日机" Then
    '----------------------------------------------
    '入口：主。中途介入
    '----------------------------------------------
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六靛, 典码输出:=典日正主_梯升连冲, 区签:="【日正主】梯升连冲", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六靛, 典码输出:=典日正主_梯升孕冲, 区签:="【日正主】梯升孕冲", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六靛, 典码输出:=典日正主_梯升调待, 区签:="【日正主】梯升调待", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六靛, 典码输出:=典日正主_梯交调待, 区签:="【日正主】梯交调待", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六靛, 典码输出:=典日正主_栏调吞冲, 区签:="【日正主】栏调吞冲", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六靛, 典码输出:=典日正主_栏调孕待, 区签:="【日正主】栏调孕待", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六靛, 典码输出:=典日正主_栏调吞待, 区签:="【日正主】栏调吞待", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六靛, 典码输出:=典日正主_栅调吞冲, 区签:="【日正主】栅调吞冲", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六靛, 典码输出:=典日正主_栅调孕待, 区签:="【日正主】栅调孕待", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六靛, 典码输出:=典日正主_栅调吞待, 区签:="【日正主】栅调吞待", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六靛, 典码输出:=典日正主_枝启升冲, 区签:="【日正主】枝启升冲", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六靛, 典码输出:=典日正主_枝贯连待, 区签:="【日正主】枝贯连待", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六靛, 典码输出:=典日正主_枝启踩警, 区签:="【日正主】枝启踩警", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六靛, 典码输出:=典日正主_枝贯单待, 区签:="【日正主】枝贯单待", 区释:="")
    '----------------------------------------------
    '入口：再。初始突破DJB
    '----------------------------------------------
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六紫, 典码输出:=典日正再_梯升连冲, 区签:="【日正再】梯升连冲", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六紫, 典码输出:=典日正再_梯升孕冲, 区签:="【日正再】梯升孕冲", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六紫, 典码输出:=典日正再_梯升调待, 区签:="【日正再】梯升调待", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六紫, 典码输出:=典日正再_梯交调待, 区签:="【日正再】梯交调待", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六紫, 典码输出:=典日正再_栏调吞冲, 区签:="【日正再】栏调吞冲", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六紫, 典码输出:=典日正再_栏调孕待, 区签:="【日正再】栏调孕待", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六紫, 典码输出:=典日正再_栏调吞待, 区签:="【日正再】栏调吞待", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六紫, 典码输出:=典日正再_栅调吞冲, 区签:="【日正再】栅调吞冲", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六紫, 典码输出:=典日正再_栅调孕待, 区签:="【日正再】栅调孕待", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六紫, 典码输出:=典日正再_栅调吞待, 区签:="【日正再】栅调吞待", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六紫, 典码输出:=典日正再_枝启升冲, 区签:="【日正再】枝启升冲", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六紫, 典码输出:=典日正再_枝贯连待, 区签:="【日正再】枝贯连待", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六紫, 典码输出:=典日正再_枝启踩警, 区签:="【日正再】枝启踩警", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六紫, 典码输出:=典日正再_枝贯单待, 区签:="【日正再】枝贯单待", 区释:="")
    '----------------------------------------------
    '入口：初储。初始突破DJC
    '----------------------------------------------
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六绿, 典码输出:=典日正初储_梯升连冲, 区签:="【日正初储】梯升连冲", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六绿, 典码输出:=典日正初储_梯升孕冲, 区签:="【日正初储】梯升孕冲", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六绿, 典码输出:=典日正初储_梯升调待, 区签:="【日正初储】梯升调待", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六绿, 典码输出:=典日正初储_梯交调待, 区签:="【日正初储】梯交调待", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六绿, 典码输出:=典日正初储_栏调吞冲, 区签:="【日正初储】栏调吞冲", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六绿, 典码输出:=典日正初储_栏调孕待, 区签:="【日正初储】栏调孕待", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六绿, 典码输出:=典日正初储_栏调吞待, 区签:="【日正初储】栏调吞待", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六绿, 典码输出:=典日正初储_栅调吞冲, 区签:="【日正初储】栅调吞冲", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六绿, 典码输出:=典日正初储_栅调孕待, 区签:="【日正初储】栅调孕待", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六绿, 典码输出:=典日正初储_栅调吞待, 区签:="【日正初储】栅调吞待", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六绿, 典码输出:=典日正初储_枝启升冲, 区签:="【日正初储】枝启升冲", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六绿, 典码输出:=典日正初储_枝贯连待, 区签:="【日正初储】枝贯连待", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六绿, 典码输出:=典日正初储_枝启踩警, 区签:="【日正初储】枝启踩警", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六绿, 典码输出:=典日正初储_枝贯单待, 区签:="【日正初储】枝贯单待", 区释:="")
    '----------------------------------------------
    '其他：杂
    '----------------------------------------------
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六黄, 典码输出:=典日正主_梯交跌警, 区签:="【日正主】梯交跌警", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六黄, 典码输出:=典日正再_梯交跌警, 区签:="【日正再】梯交跌警", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六黄, 典码输出:=典日正初储_梯交跌警, 区签:="【日正初储】梯交跌警", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色三黄, 典码输出:=典日正主_杂全, 区签:="【日正主】杂全", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色三黄, 典码输出:=典日正再_杂全, 区签:="【日正再】杂全", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色三黄, 典码输出:=典日正初储_杂全, 区签:="【日正初储】杂全", 区释:="")
    '----------------------------------------------
    '单列【破】DJB入口：很可能是诱多
    '----------------------------------------------
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六靛, 典码输出:=典日正主_根全, 区签:="【日正主】根全", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六紫, 典码输出:=典日正再_根全, 区签:="【日正再】根全", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六绿, 典码输出:=典日正初储_根全, 区签:="【日正初储】根全", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六橙, 典码输出:=典日正破_ABC假鼎, 区签:="【日正破】ABC假鼎", 区释:="警惕诱多")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六橙, 典码输出:=典日正破_ABC初三, 区签:="【日正破】ABC初三", 区释:="警惕诱多")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色四橙, 典码输出:=典日正破_ABC余非升, 区签:="【日正破】ABC余非升", 区释:="警惕诱多")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色四橙, 典码输出:=典日正破_ABC余升排, 区签:="【日正破】ABC余升排", 区释:="警惕诱多")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色四橙, 典码输出:=典日正破_DEF初首, 区签:="【日正破】DEF初首", 区释:="警惕诱多")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色四橙, 典码输出:=典日正破_DEF余多, 区签:="【日正破】DEF余多", 区释:="警惕诱多")
    '----------------------------------------------
End If
'----------------------------------------------------------------------------------------
'【日负区域】
'----------------------------------------------------------------------------------------
If 出节模式 = "日层" Then
    '--------------------------------------------------
    '注20240701：非常重要，此类属于周柱首下破，仍属于机会区域。属于初步下跌，还可挽回，可以参与。
    '注20251220：由于DXBC对于周类主升的重要识别作用，当初始下破DJC时，是最有机会挽回的情况。其他【_再/_主】都不是真正的机会，即使参与也要异常谨慎。
    '--------------------------------------------------
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of日层类合, 强序:=xlDescending, 区隐:=区隐, 区色:=常色主白, 典码输出:=典日层负A_BC正交4v, 区签:="【日负A】BC正交4v", 区释:="DXBC尚未负交")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of日层类合, 强序:=xlDescending, 区隐:=区隐, 区色:=常色主白, 典码输出:=典日层负A_BC正交4w, 区签:="【日负A】BC正交4w", 区释:="DXBC尚未负交")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of日层类合, 强序:=xlDescending, 区隐:=区隐, 区色:=常色主白, 典码输出:=典日层负A_BC正交4e, 区签:="【日负A】BC正交4e", 区释:="DXBC尚未负交")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of日层类合, 强序:=xlDescending, 区隐:=区隐, 区色:=常色主白, 典码输出:=典日层负A_BC正交4b, 区签:="【日负A】BC正交4b", 区释:="DXBC尚未负交")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of日层类合, 强序:=xlDescending, 区隐:=区隐, 区色:=常色六灰, 典码输出:=典日层负A_BC负交根, 区签:="【日负A】BC负交根", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of日层类合, 强序:=xlDescending, 区隐:=区隐, 区色:=常色六灰, 典码输出:=典日层负A_BC负交芽, 区签:="【日负A】BC负交芽", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of日层类合, 强序:=xlDescending, 区隐:=区隐, 区色:=常色六灰, 典码输出:=典日层负A_BC负交管, 区签:="【日负A】BC负交管", 区释:="")
    '--------------------------------------------------
If 出全是否 = True Then
    '--------------------------------------------------
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of日层类合, 强序:=xlDescending, 区隐:=区隐, 区色:=常色主白, 典码输出:=典日层负BCD根, 区签:="【日负BCD】根", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of日层类合, 强序:=xlDescending, 区隐:=区隐, 区色:=常色四灰, 典码输出:=典日层负D管芽, 区签:="【日负D】管芽", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of日层类合, 强序:=xlDescending, 区隐:=区隐, 区色:=常色四灰, 典码输出:=典日层负C管芽, 区签:="【日负C】管芽", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of日层类合, 强序:=xlDescending, 区隐:=区隐, 区色:=常色四灰, 典码输出:=典日层负B管芽, 区签:="【日负B】管芽", 区释:="")
    '--------------------------------------------------
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of日层类合, 强序:=xlDescending, 区隐:=区隐, 区色:=常色八蓝, 典码输出:=典日层负G根, 区签:="【日负G】根", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of日层类合, 强序:=xlDescending, 区隐:=区隐, 区色:=常色八蓝, 典码输出:=典日层负G芽, 区签:="【日负G】芽", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of日层类合, 强序:=xlDescending, 区隐:=区隐, 区色:=常色六蓝, 典码输出:=典日层负G管顶离, 区签:="【日负G】管顶离", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of日层类合, 强序:=xlDescending, 区隐:=区隐, 区色:=常色八紫, 典码输出:=典日层负G管顶合剔宽大, 区签:="【日负GA管顶合】剔宽大", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of日层类合, 强序:=xlDescending, 区隐:=区隐, 区色:=常色八紫, 典码输出:=典日层负G管顶合剔偏大, 区签:="【日负GA管顶合】剔偏大BSLA", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of日层类合, 强序:=xlDescending, 区隐:=区隐, 区色:=常色四紫, 典码输出:=典日层负G管顶合剔连久, 区签:="【日负GA管顶合】剔连久", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of日层类合, 强序:=xlDescending, 区隐:=区隐, 区色:=常色二灰, 典码输出:=典日层负G管顶合余, 区签:="【日负GA管顶合】余", 区释:="")
    '--------------------------------------------------
End If
'----------------------------------------------------------------------------------------
'【测试区域】
'----------------------------------------------------------------------------------------
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色十红, 典码输出:=典日层废单停牌, 区签:="【废】停牌", 区释:="")
End If
'========================================================================================
'返回
'========================================================================================
    IQQQ展擎筛程至D3节按日层 = MSG
'========================================================================================
End Function






'========================================================================================
'========================================================================================
'功能：按照出节模式输出到块
'模式：日全
'注20250310：不要以柱排作为筛选原则，而要以稳升操作法进行分类。以柱排分类的问题：升连出现在前段是好的，出现在后面是诱多；跌连出现在前段是机会，出现在后面是回落。
'========================================================================================
'========================================================================================
Function IQQQ展擎筛程至D3节按日层废弃( _
          ByRef WB As Workbook _
        , ByVal 表名 As String _
        , ByRef 谕组 As Variant _
        , Optional ByRef 典码输出 As Dictionary _
        , Optional ByVal 节签 As String = "" _
        , Optional ByVal 节色 As Long = 常色十青 _
        , Optional ByVal 出节模式 As String = "日层" _
        , Optional ByVal 出全是否 As Boolean = True _
        ) As String
'========================================================================================
'声明变量
'========================================================================================
    Dim CIDL As String
    Dim 是否筛机 As Boolean
    '------------------------------------------------------------------------------------
    Dim 参阈连阳 As Integer
    参阈连阳 = 4
'========================================================================================
'定义典
'========================================================================================
    Dim 典日层负A芽 As New Dictionary
    Dim 典日层负A根 As New Dictionary
    Dim 典日层负A管 As New Dictionary
    '-------------
    Dim 典日层负G管顶合余 As New Dictionary
    Dim 典日层负G管顶合剔偏大 As New Dictionary
    Dim 典日层负G管顶合剔宽大 As New Dictionary
    Dim 典日层负G管顶合剔连久 As New Dictionary
    Dim 典日层负G管顶离 As New Dictionary
    Dim 典日层负G根顶合 As New Dictionary
    Dim 典日层负G根顶离 As New Dictionary
    Dim 典日层负G芽顶合 As New Dictionary
    Dim 典日层负G芽顶离 As New Dictionary
    '-------------
    Dim 典日层负B管芽 As New Dictionary
    Dim 典日层负C管芽 As New Dictionary
    Dim 典日层负D管芽 As New Dictionary
    Dim 典日层负BCD根 As New Dictionary
    '-------------
    Dim 典日层负C根6w As New Dictionary
    Dim 典日层负B根6v As New Dictionary
    '---------------------------------------------------
    Dim 典日正储初_DJC初甲 As New Dictionary
    Dim 典日正储初_DJC初乙 As New Dictionary
    Dim 典日正储初_DJC初6w As New Dictionary
    Dim 典日正储初_DJC初1v As New Dictionary
    Dim 典日正储初_DJC初6v As New Dictionary
    Dim 典日正再_漏劫AB2I As New Dictionary
    Dim 典日正再_漏劫AB3h As New Dictionary
    Dim 典日正再_漏劫AC2i As New Dictionary
    Dim 典日正再_漏劫AC3u As New Dictionary
    '---------------------------------------------------
    Dim 典日正储初_合上_升尾升连久 As New Dictionary
    Dim 典日正储初_合上_升尾升连 As New Dictionary
    Dim 典日正储初_合上_升尾升单 As New Dictionary
    Dim 典日正储初_合上_升尾跌单 As New Dictionary
    Dim 典日正储初_合上_人尾升吞 As New Dictionary
    Dim 典日正储初_合上_人尾跌吞 As New Dictionary
    Dim 典日正储初_合上_人尾其他 As New Dictionary
    Dim 典日正储初_合上_跌 As New Dictionary
    Dim 典日正储初_离上_升 As New Dictionary
    Dim 典日正储初_离上_跌 As New Dictionary
    Dim 典日正储初_离上_人尾升吞 As New Dictionary
    Dim 典日正储初_离上_人尾跌吞 As New Dictionary
    Dim 典日正储初_离上_人尾其他 As New Dictionary
    Dim 典日正储初余仓类 As New Dictionary
    '---------------------------------------------------
    Dim 典日正主_合上_升尾升连久 As New Dictionary
    Dim 典日正主_合上_升尾升连 As New Dictionary
    Dim 典日正主_合上_升尾升单 As New Dictionary
    Dim 典日正主_合上_升尾跌单 As New Dictionary
    Dim 典日正主_合上_人尾升吞 As New Dictionary
    Dim 典日正主_合上_人尾跌吞 As New Dictionary
    Dim 典日正主_合上_人尾其他 As New Dictionary
    Dim 典日正主_合上_跌 As New Dictionary
    Dim 典日正主_离上_升 As New Dictionary
    Dim 典日正主_离上_跌 As New Dictionary
    Dim 典日正主_离上_人尾升吞 As New Dictionary
    Dim 典日正主_离上_人尾跌吞 As New Dictionary
    Dim 典日正主_离上_人尾其他 As New Dictionary
    Dim 典日正主余仓类 As New Dictionary
    '---------------------------------------------------
    Dim 典日正再_合上_升尾升连久 As New Dictionary
    Dim 典日正再_合上_升尾升连 As New Dictionary
    Dim 典日正再_合上_升尾升单 As New Dictionary
    Dim 典日正再_合上_升尾跌单 As New Dictionary
    Dim 典日正再_合上_人尾升吞 As New Dictionary
    Dim 典日正再_合上_人尾跌吞 As New Dictionary
    Dim 典日正再_合上_人尾其他 As New Dictionary
    Dim 典日正再_合上_跌 As New Dictionary
    Dim 典日正再_离上_升 As New Dictionary
    Dim 典日正再_离上_跌 As New Dictionary
    Dim 典日正再_离上_人尾升吞 As New Dictionary
    Dim 典日正再_离上_人尾跌吞 As New Dictionary
    Dim 典日正再_离上_人尾其他 As New Dictionary
    Dim 典日正再余仓类 As New Dictionary
    '---------------------------------------------------
    Dim 典日正破_升 As New Dictionary
    Dim 典日正破_跌 As New Dictionary
    Dim 典日正破_人尾升吞 As New Dictionary
    Dim 典日正破_人尾跌吞 As New Dictionary
    Dim 典日正破_人尾其他 As New Dictionary
    '---------------------------------------
    Dim 典日层废单停牌 As New Dictionary
'========================================================================================
'筛选：微观 以周为粒度进行柱类分析
'========================================================================================
    For Y = 1 To 典码输出.Count
        X = 典码输出.Items(Y - 1)
        CIDL = 谕组(X, 位qt代码)
        值日基日局 = 谕组(X, 位谕of日基日局)
        是否筛机 = False
        '================================================================================
        If UBCID是代码(CIDL) = False Then
        ElseIf 谕组(X, 位qt停牌) = "S" Then     '测试用
                        典日层废单停牌.Add Item:=X, Key:=CIDL
        '--------------------------------------------------------------------------------
        '控制输出：【出全是否】是否只输出DJD之上。因为K柱围绕DJC波动，所以利用DJD来进行限制。
        '--------------------------------------------------------------------------------
        ElseIf 出全是否 = False And 谕组(X, 位谕of日类BTZD) < 0 Then
                        '典日层废单停牌.Add Item:=X, Key:=CIDL        '测试用
'        '--------------------------------------------------------------------------------
'        '过滤周类WJA之下：一般只对WBTZA≥2操作；对于WBTZA=1要小心；对于WBTZA=-1可以参与；对于WBTZA≤-2要放弃。
'        '--------------------------------------------------------------------------------
'        ElseIf 谕组(X, 位谕of周类BTZA) < 0 Then
'                典日周BTZA负.Add Item:=X, Key:=CIDL
        '--------------------------------------------------------------------------------
        '单独列示：破
        '--------------------------------------------------------------------------------
        ElseIf Left(谕组(X, 位谕of日层界), 1) = "破" Then
                            If InStr(谕组(X, 位谕of日层柱排), "人.") > 0 Then
                                If Right(谕组(X, 位谕of日管并符串), 2) = 常枚并符升吞 & 常枚并符跌孕 Or Right(谕组(X, 位谕of日管并符串), 1) = 常枚并符升吞 Then
                                    典日正破_人尾升吞.Add Item:=X, Key:=CIDL
                                ElseIf Right(谕组(X, 位谕of日管并符串), 2) = 常枚并符跌吞 & 常枚并符升孕 Or Right(谕组(X, 位谕of日管并符串), 1) = 常枚并符跌吞 Then
                                    典日正破_人尾跌吞.Add Item:=X, Key:=CIDL
                                Else
                                    典日正破_人尾其他.Add Item:=X, Key:=CIDL
                                End If
                            ElseIf InStr(谕组(X, 位谕of日层柱排), "跌.") > 0 Then
                                    典日正破_跌.Add Item:=X, Key:=CIDL
                            Else
                                    典日正破_升.Add Item:=X, Key:=CIDL
                            End If
        '--------------------------------------------------------------------------------
        '单独列示：储/初
        '注：在WJA之上凡是逆趋势（跌孕/跌吞/跌连）都是机会，需要甄别。
        '--------------------------------------------------------------------------------
        ElseIf Left(谕组(X, 位谕of日层界), 1) = "储" Or Left(谕组(X, 位谕of日层界), 1) = "初" Then
                        If 谕组(X, 位谕of日基日局) = "1w" _
                        Or 谕组(X, 位谕of日基日局) = "1b" Then
                                If 日类BTZC >= 3 Then
                                    典日正储初_DJC初甲.Add Item:=X, Key:=CIDL
                                Else
                                    典日正储初_DJC初乙.Add Item:=X, Key:=CIDL
                                End If
                        ElseIf 谕组(X, 位谕of日基日局) = "6w" Then
                                    典日正储初_DJC初6w.Add Item:=X, Key:=CIDL
                        ElseIf 谕组(X, 位谕of日基日局) = "1v" Then
                                    典日正储初_DJC初1v.Add Item:=X, Key:=CIDL
                        ElseIf 谕组(X, 位谕of日基日局) = "6v" Then
                                    典日正储初_DJC初6v.Add Item:=X, Key:=CIDL
                        '合顶代表主升阶段
                        ElseIf 谕组(X, 位谕of仓类) = "_aO" Or 谕组(X, 位谕of仓类) = "_bO" Or 谕组(X, 位谕of仓类) = "_dO" Then
                            '需要防止顶部冲高诱多
                            If InStr(谕组(X, 位谕of日层柱排), "人.") > 0 Then
                                If Right(谕组(X, 位谕of日管并符串), 2) = 常枚并符升吞 & 常枚并符跌孕 Or Right(谕组(X, 位谕of日管并符串), 1) = 常枚并符升吞 Then
                                    典日正储初_合上_人尾升吞.Add Item:=X, Key:=CIDL
                                ElseIf Right(谕组(X, 位谕of日管并符串), 2) = 常枚并符跌吞 & 常枚并符升孕 Or Right(谕组(X, 位谕of日管并符串), 1) = 常枚并符跌吞 Then
                                    典日正储初_合上_人尾跌吞.Add Item:=X, Key:=CIDL
                                Else
                                    典日正储初_合上_人尾其他.Add Item:=X, Key:=CIDL
                                End If
                            ElseIf InStr(谕组(X, 位谕of日层柱排), "跌.") > 0 Then
                                    典日正储初_合上_跌.Add Item:=X, Key:=CIDL
                            Else
                                If 谕组(X, 位谕of日波龄BTPR0) >= 参阈连阳 Then
                                    典日正储初_合上_升尾升连久.Add Item:=X, Key:=CIDL
                                ElseIf InStr(谕组(X, 位谕of日层柱型), ".升" & 常枚并符升连) > 0 Then
                                    典日正储初_合上_升尾升连.Add Item:=X, Key:=CIDL
                                ElseIf InStr(谕组(X, 位谕of日层柱型), ".升" & 常枚并符跌孕) > 0 Then
                                    典日正储初_合上_升尾跌单.Add Item:=X, Key:=CIDL
                                Else
                                    典日正储初_合上_升尾升单.Add Item:=X, Key:=CIDL
                                End If
                            End If
                        ElseIf 谕组(X, 位谕of仓类) = "_sO" Then
                            If InStr(谕组(X, 位谕of日层柱排), "人.") > 0 Then
                                If Right(谕组(X, 位谕of日管并符串), 2) = 常枚并符升吞 & 常枚并符跌孕 Or Right(谕组(X, 位谕of日管并符串), 1) = 常枚并符升吞 Then
                                    典日正储初_离上_人尾升吞.Add Item:=X, Key:=CIDL
                                ElseIf Right(谕组(X, 位谕of日管并符串), 2) = 常枚并符跌吞 & 常枚并符升孕 Or Right(谕组(X, 位谕of日管并符串), 1) = 常枚并符跌吞 Then
                                    典日正储初_离上_人尾跌吞.Add Item:=X, Key:=CIDL
                                Else
                                    典日正储初_离上_人尾其他.Add Item:=X, Key:=CIDL
                                End If
                            ElseIf InStr(谕组(X, 位谕of日层柱排), "跌.") > 0 Then
                                    典日正储初_离上_跌.Add Item:=X, Key:=CIDL
                            Else
                                    典日正储初_离上_升.Add Item:=X, Key:=CIDL
                            End If
                        Else
                                    典日正储初余仓类.Add Item:=X, Key:=CIDL
                        End If
        '--------------------------------------------------------------------------------
        'ZC之上
        '--------------------------------------------------------------------------------
        ElseIf 谕组(X, 位谕of日类BTZC) > 0 Then
                '------------------------------------------------------------------------
                '单独列示：再
                '------------------------------------------------------------------------
                If Left(谕组(X, 位谕of日层界), 1) = "再" Then
                        If 谕组(X, 位谕of日基日局) = "2I" Then
                                    典日正再_漏劫AB2I.Add Item:=X, Key:=CIDL
                        ElseIf 谕组(X, 位谕of日基日局) = "3h" Then
                                    典日正再_漏劫AB3h.Add Item:=X, Key:=CIDL
                        ElseIf 谕组(X, 位谕of日基日局) = "2i" Then
                                    典日正再_漏劫AC2i.Add Item:=X, Key:=CIDL
                        ElseIf 谕组(X, 位谕of日基日局) = "3u" Then
                                    典日正再_漏劫AC3u.Add Item:=X, Key:=CIDL
                        ElseIf 谕组(X, 位谕of仓类) = "_aO" Or 谕组(X, 位谕of仓类) = "_bO" Or 谕组(X, 位谕of仓类) = "_dO" Then
                            '需要防止顶部冲高诱多
                            If InStr(谕组(X, 位谕of日层柱排), "人.") > 0 Then
                                If Right(谕组(X, 位谕of日管并符串), 2) = 常枚并符升吞 & 常枚并符跌孕 Or Right(谕组(X, 位谕of日管并符串), 1) = 常枚并符升吞 Then
                                    典日正再_合上_人尾升吞.Add Item:=X, Key:=CIDL
                                ElseIf Right(谕组(X, 位谕of日管并符串), 2) = 常枚并符跌吞 & 常枚并符升孕 Or Right(谕组(X, 位谕of日管并符串), 1) = 常枚并符跌吞 Then
                                    典日正再_合上_人尾跌吞.Add Item:=X, Key:=CIDL
                                Else
                                    典日正再_合上_人尾其他.Add Item:=X, Key:=CIDL
                                End If
                            ElseIf InStr(谕组(X, 位谕of日层柱排), "跌.") > 0 Then
                                    典日正再_合上_跌.Add Item:=X, Key:=CIDL
                            Else
                                If 谕组(X, 位谕of日波龄BTPR0) >= 参阈连阳 Then
                                    典日正再_合上_升尾升连久.Add Item:=X, Key:=CIDL
                                ElseIf InStr(谕组(X, 位谕of日层柱型), ".升" & 常枚并符升连) > 0 Then
                                    典日正再_合上_升尾升连.Add Item:=X, Key:=CIDL
                                ElseIf InStr(谕组(X, 位谕of日层柱型), ".升" & 常枚并符跌孕) > 0 Then
                                    典日正再_合上_升尾跌单.Add Item:=X, Key:=CIDL
                                Else
                                    典日正再_合上_升尾升单.Add Item:=X, Key:=CIDL
                                End If
                            End If
                        ElseIf 谕组(X, 位谕of仓类) = "_sO" Then
                            If InStr(谕组(X, 位谕of日层柱排), "人.") > 0 Then
                                If Right(谕组(X, 位谕of日管并符串), 2) = 常枚并符升吞 & 常枚并符跌孕 Or Right(谕组(X, 位谕of日管并符串), 1) = 常枚并符升吞 Then
                                    典日正再_离上_人尾升吞.Add Item:=X, Key:=CIDL
                                ElseIf Right(谕组(X, 位谕of日管并符串), 2) = 常枚并符跌吞 & 常枚并符升孕 Or Right(谕组(X, 位谕of日管并符串), 1) = 常枚并符跌吞 Then
                                    典日正再_离上_人尾跌吞.Add Item:=X, Key:=CIDL
                                Else
                                    典日正再_离上_人尾其他.Add Item:=X, Key:=CIDL
                                End If
                            ElseIf InStr(谕组(X, 位谕of日层柱排), "跌.") > 0 Then
                                    典日正再_离上_跌.Add Item:=X, Key:=CIDL
                            Else
                                    典日正再_离上_升.Add Item:=X, Key:=CIDL
                            End If
                        Else
                                    典日正再余仓类.Add Item:=X, Key:=CIDL
                        End If
                '------------------------------------------------------------------------
                '单独列示：主
                '------------------------------------------------------------------------
                Else
                        If 谕组(X, 位谕of仓类) = "_aO" Or 谕组(X, 位谕of仓类) = "_bO" Or 谕组(X, 位谕of仓类) = "_dO" Then
                            '需要防止顶部冲高诱多
                            If InStr(谕组(X, 位谕of日层柱排), "人.") > 0 Then
                                If Right(谕组(X, 位谕of日管并符串), 2) = 常枚并符升吞 & 常枚并符跌孕 Or Right(谕组(X, 位谕of日管并符串), 1) = 常枚并符升吞 Then
                                    典日正主_合上_人尾升吞.Add Item:=X, Key:=CIDL
                                ElseIf Right(谕组(X, 位谕of日管并符串), 2) = 常枚并符跌吞 & 常枚并符升孕 Or Right(谕组(X, 位谕of日管并符串), 1) = 常枚并符跌吞 Then
                                    典日正主_合上_人尾跌吞.Add Item:=X, Key:=CIDL
                                Else
                                    典日正主_合上_人尾其他.Add Item:=X, Key:=CIDL
                                End If
                            ElseIf InStr(谕组(X, 位谕of日层柱排), "跌.") > 0 Then
                                    典日正主_合上_跌.Add Item:=X, Key:=CIDL
                            Else
                                If 谕组(X, 位谕of日波龄BTPR0) >= 参阈连阳 Then
                                    典日正主_合上_升尾升连久.Add Item:=X, Key:=CIDL
                                ElseIf InStr(谕组(X, 位谕of日层柱型), ".升" & 常枚并符升连) > 0 Then
                                    典日正主_合上_升尾升连.Add Item:=X, Key:=CIDL
                                ElseIf InStr(谕组(X, 位谕of日层柱型), ".升" & 常枚并符跌孕) > 0 Then
                                    典日正主_合上_升尾跌单.Add Item:=X, Key:=CIDL
                                Else
                                    典日正主_合上_升尾升单.Add Item:=X, Key:=CIDL
                                End If
                            End If
                        ElseIf 谕组(X, 位谕of仓类) = "_sO" Then
                            If InStr(谕组(X, 位谕of日层柱排), "人.") > 0 Then
                                If Right(谕组(X, 位谕of日管并符串), 2) = 常枚并符升吞 & 常枚并符跌孕 Or Right(谕组(X, 位谕of日管并符串), 1) = 常枚并符升吞 Then
                                    典日正主_离上_人尾升吞.Add Item:=X, Key:=CIDL
                                ElseIf Right(谕组(X, 位谕of日管并符串), 2) = 常枚并符跌吞 & 常枚并符升孕 Or Right(谕组(X, 位谕of日管并符串), 1) = 常枚并符跌吞 Then
                                    典日正主_离上_人尾跌吞.Add Item:=X, Key:=CIDL
                                Else
                                    典日正主_离上_人尾其他.Add Item:=X, Key:=CIDL
                                End If
                            ElseIf InStr(谕组(X, 位谕of日层柱排), "跌.") > 0 Then
                                    典日正主_离上_跌.Add Item:=X, Key:=CIDL
                            Else
                                    典日正主_离上_升.Add Item:=X, Key:=CIDL
                            End If
                        Else
                                    典日正主余仓类.Add Item:=X, Key:=CIDL
                        End If
                End If
        '--------------------------------------------------------------------------------
        'ZC之下
        '--------------------------------------------------------------------------------
        Else
                '------------------------------------------------------------------------
                '类别：针对坤BCD
                '------------------------------------------------------------------------
                If InStr(谕组(X, 位谕of日层类合), 常枚层类B) > 0 Or InStr(谕组(X, 位谕of日层类合), 常枚层类C) > 0 Or InStr(谕组(X, 位谕of日层类合), 常枚层类D) > 0 Then
                        If InStr(谕组(X, 位谕of日层类合), 常枚层别根) > 0 Then
                                典日层负BCD根.Add Item:=X, Key:=CIDL
                        ElseIf InStr(谕组(X, 位谕of日层类合), 常枚层类B) > 0 Then
                                典日层负B管芽.Add Item:=X, Key:=CIDL
                        ElseIf InStr(谕组(X, 位谕of日层类合), 常枚层类C) > 0 Then
                                典日层负C管芽.Add Item:=X, Key:=CIDL
                        ElseIf InStr(谕组(X, 位谕of日层类合), 常枚层类D) > 0 Then
                                典日层负D管芽.Add Item:=X, Key:=CIDL
                        End If
                '------------------------------------------------------------------------
                '主升层：只针对【G】
                '------------------------------------------------------------------------
                ElseIf InStr(谕组(X, 位谕of日层类合), 常枚层类G) > 0 Then
                        If InStr(谕组(X, 位谕of日层类合), 常枚层别管) > 0 Then
                            If 谕组(X, 位谕of日龟BT合顶哼) > 0 Then     '合顶：防止尾部触顶
                                '注20240410：为了展示完整流程，仅对管进行特殊情况单列。
                                If 谕组(X, 位谕of日层BSLA) <= -8 Then
                                    典日层负G管顶合剔偏大.Add Item:=X, Key:=CIDL
                                ElseIf 谕组(X, 位谕of日层宽哈JC) <= -20 Then
                                    典日层负G管顶合剔宽大.Add Item:=X, Key:=CIDL
                                ElseIf 谕组(X, 位谕of日波龄BTPR0) <= -3 Then
                                    典日层负G管顶合剔连久.Add Item:=X, Key:=CIDL
                                Else
                                    典日层负G管顶合余.Add Item:=X, Key:=CIDL
                                End If
                            Else
                                    典日层负G管顶离.Add Item:=X, Key:=CIDL
                            End If
                        '----------------------------------------------------------------
                        '针对坤G
                        ElseIf InStr(谕组(X, 位谕of日层类合), 常枚层别根) > 0 Then
                            If 谕组(X, 位谕of日龟BT合顶哼) > 0 Then     '合顶：防止尾部触顶
                                    典日层负G根顶合.Add Item:=X, Key:=CIDL
                            Else
                                    典日层负G根顶离.Add Item:=X, Key:=CIDL
                            End If
                        Else
                            If 谕组(X, 位谕of日龟BT合顶哼) > 0 Then    '合顶：防止尾部触顶
                                    典日层负G芽顶合.Add Item:=X, Key:=CIDL
                            Else
                                    典日层负G芽顶离.Add Item:=X, Key:=CIDL
                            End If
                        End If
                '------------------------------------------------------------------------
                '主升层：只针对【A】
                '------------------------------------------------------------------------
                Else
                        '----------------------------------------------------------------
                        If 谕组(X, 位谕of日基日局) = "6w" Then
                                    典日层负C根6w.Add Item:=X, Key:=CIDL
                        ElseIf 谕组(X, 位谕of日基日局) = "6v" Then
                                    典日层负B根6v.Add Item:=X, Key:=CIDL
                        Else
                            If InStr(谕组(X, 位谕of日层类合), 常枚层别管) > 0 Then
                                    典日层负A管.Add Item:=X, Key:=CIDL
                            ElseIf InStr(谕组(X, 位谕of日层类合), 常枚层别根) > 0 Then
                                    典日层负A根.Add Item:=X, Key:=CIDL
                            Else
                                    典日层负A芽.Add Item:=X, Key:=CIDL
                            End If
                        End If
                        '----------------------------------------------------------------
                End If
                '------------------------------------------------------------------------
        End If
        '================================================================================
    Next
'========================================================================================
    Dim 区隐 As Boolean
    区隐 = False
    Dim 节缀 As String
    节缀 = ""
'========================================================================================
'输出：分类按照劫逐步变化的规律进行排列。先展现【劫：/ZA/ZB/BA/CA/BC】，再展现多头排列，再展现【跌：/JB/JC】，最后展现【暴】
'为何按触划分：因为只有触a（推动顶不断提高）才是【真正的上升】，其余情况即使有上升也是震荡，何况在非触情况更多的下跌。
'========================================================================================
'----------------------------------------------------------------------------------------
'【正区域】
'【入初】判断与WJC是否相交。【层AD】肯定相交；【层CB】可能相交，也可能不相交。只有与WJC相交才是进入点，其余仅作参考，不可以作为进入点。
'----------------------------------------------------------------------------------------
If 出节模式 = "日层" Or 出节模式 = "日机" Then
    '----------------------------------------------
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色43绿, 典码输出:=典日正储初_DJC初甲, 区签:="【正储初】DJC初甲", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色43绿, 典码输出:=典日正储初_DJC初乙, 区签:="【正储初】DJC初乙", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色43绿, 典码输出:=典日正储初_DJC初6w, 区签:="【正储初】DJC初6w", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色43绿, 典码输出:=典日正储初_DJC初1v, 区签:="【正储初】DJC初1v", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色43绿, 典码输出:=典日正储初_DJC初6v, 区签:="【正储初】DJC初6v", 区释:="")
    '----------------------------------------------
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六红, 典码输出:=典日正储初_合上_升尾升连久, 区签:="【正储初】_合上_升尾升连久", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六红, 典码输出:=典日正主_合上_升尾升连久, 区签:="【正主】_合上_升尾升连久", 区释:="")
    '----------------------------------------------
    '【储初】DJC入口
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色八绿, 典码输出:=典日正储初_合上_升尾升连, 区签:="【正储初】_合上_升尾升连", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色八绿, 典码输出:=典日正储初_合上_升尾升单, 区签:="【正储初】_合上_升尾升单", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色八绿, 典码输出:=典日正储初_合上_升尾跌单, 区签:="【正储初】_合上_升尾跌单", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色五青, 典码输出:=典日正储初_离上_升, 区签:="【正储初】_离上_升", 区释:="警惕诱多")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色八绿, 典码输出:=典日正储初_合上_人尾升吞, 区签:="【正储初】_合上_人尾升吞", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色五青, 典码输出:=典日正储初_离上_人尾升吞, 区签:="【正储初】_离上_人尾升吞", 区释:="警惕诱多")
    '----------------------------------------------
    '单列【主】：应已在DJC或DJB进入。
    '----------------------------------------------
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色八靛, 典码输出:=典日正主_合上_升尾升连, 区签:="【正主】_合上_升尾升连", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色八靛, 典码输出:=典日正主_合上_升尾升单, 区签:="【正主】_合上_升尾升单", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色八靛, 典码输出:=典日正主_合上_升尾跌单, 区签:="【正主】_合上_升尾跌单", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色五青, 典码输出:=典日正主_离上_升, 区签:="【正主】_离上_升", 区释:="警惕诱多")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色八靛, 典码输出:=典日正主_合上_人尾升吞, 区签:="【正主】_合上_人尾升吞", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色五青, 典码输出:=典日正主_离上_人尾升吞, 区签:="【正主】_离上_人尾升吞", 区释:="警惕诱多")
    '----------------------------------------------
    '非升排：
    '----------------------------------------------
        '----------------------------------------------
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色四绿, 典码输出:=典日正储初_合上_人尾其他, 区签:="【正储初】_合上_人尾其他", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色四青, 典码输出:=典日正储初_离上_人尾其他, 区签:="【正储初】_离上_人尾其他", 区释:="警惕诱多")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色四靛, 典码输出:=典日正主_合上_人尾其他, 区签:="【正主】_合上_人尾其他", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色四青, 典码输出:=典日正主_离上_人尾其他, 区签:="【正主】_离上_人尾其他", 区释:="警惕诱多")
        '----------------------------------------------
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色二绿, 典码输出:=典日正储初_合上_人尾跌吞, 区签:="【正储初】_合上_人尾跌吞", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色二绿, 典码输出:=典日正储初_合上_跌, 区签:="【正储初】_合上_跌", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色四靛, 典码输出:=典日正主_合上_人尾跌吞, 区签:="【正主】_合上_人尾跌吞", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色四靛, 典码输出:=典日正主_合上_跌, 区签:="【正主】_合上_跌", 区释:="")
        '----------------------------------------------
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色五青, 典码输出:=典日正储初_离上_人尾跌吞, 区签:="【正储初】_离上_人尾跌吞", 区释:="警惕诱多")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色五青, 典码输出:=典日正储初_离上_跌, 区签:="【正储初】_离上_跌", 区释:="警惕诱多")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色五青, 典码输出:=典日正主_离上_人尾跌吞, 区签:="【正主】_离上_人尾跌吞", 区释:="警惕诱多")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色五青, 典码输出:=典日正主_离上_跌, 区签:="【正主】_离上_跌", 区释:="警惕诱多")
        '----------------------------------------------
    '----------------------------------------------
    '再：
    '----------------------------------------------
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六紫, 典码输出:=典日正再_漏劫AB2I, 区签:="【正再】漏2I", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六紫, 典码输出:=典日正再_漏劫AC2i, 区签:="【正再】漏2i", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六紫, 典码输出:=典日正再_漏劫AB3h, 区签:="【正再】漏3h", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六紫, 典码输出:=典日正再_漏劫AC3u, 区签:="【正再】漏3u", 区释:="")
        '----------------------------------------------
        '单列【再】DJB入口：很可能是诱多
        '----------------------------------------------
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六红, 典码输出:=典日正再_合上_升尾升连久, 区签:="【正再】_合上_升尾升连久", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色八紫, 典码输出:=典日正再_合上_升尾升连, 区签:="【正再】_合上_升尾升连", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色八紫, 典码输出:=典日正再_合上_升尾升单, 区签:="【正再】_合上_升尾升单", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色八紫, 典码输出:=典日正再_合上_升尾跌单, 区签:="【正再】_合上_升尾跌单", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色五青, 典码输出:=典日正再_离上_升, 区签:="【正再】_离上_升", 区释:="警惕诱多")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色八紫, 典码输出:=典日正再_合上_人尾升吞, 区签:="【正再】_合上_人尾升吞", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色五青, 典码输出:=典日正再_离上_人尾升吞, 区签:="【正再】_离上_人尾升吞", 区释:="警惕诱多")
        '-----------------------------------------
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色四紫, 典码输出:=典日正再_合上_人尾其他, 区签:="【正再】_合上_人尾其他", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色四青, 典码输出:=典日正再_离上_人尾其他, 区签:="【正再】_离上_人尾其他", 区释:="警惕诱多")
        '-----------------------------------------
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色二紫, 典码输出:=典日正再_合上_人尾跌吞, 区签:="【正再】_合上_人尾跌吞", 区释:="")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色二紫, 典码输出:=典日正再_合上_跌, 区签:="【正再】_合上_跌", 区释:="")
        '-----------------------------------------
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色五青, 典码输出:=典日正再_离上_人尾跌吞, 区签:="【正再】_离上_人尾跌吞", 区释:="警惕诱多")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色五青, 典码输出:=典日正再_离上_跌, 区签:="【正再】_离上_跌", 区释:="警惕诱多")
    '----------------------------------------------
    '单列【破】DJB入口：很可能是诱多
    '----------------------------------------------
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六橙, 典码输出:=典日正破_升, 区签:="【正破】_升", 区释:="警惕诱多")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六橙, 典码输出:=典日正破_人尾升吞, 区签:="【正破】_人尾升吞", 区释:="警惕诱多")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色四橙, 典码输出:=典日正破_人尾其他, 区签:="【正破】_人尾其他", 区释:="警惕诱多")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色四橙, 典码输出:=典日正破_人尾跌吞, 区签:="【正破】_人尾跌吞", 区释:="警惕诱多")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色四橙, 典码输出:=典日正破_跌, 区签:="【正破】_跌", 区释:="警惕诱多")
    '----------------------------------------------
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六蓝, 典码输出:=典日正储初余仓类, 区签:="可能是机会【正主】余仓类", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六蓝, 典码输出:=典日正主余仓类, 区签:="可能是机会【正主】余仓类", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六蓝, 典码输出:=典日正再余仓类, 区签:="可能是机会【正主】余仓类", 区释:="")
    '----------------------------------------------
End If
'----------------------------------------------------------------------------------------
'【负区域】
'----------------------------------------------------------------------------------------
If 出节模式 = "日层" Then
    '--------------------------------------------------
    '注20240701：非常重要，此类属于周柱首下破，仍属于机会区域。属于初步下跌，还可挽回，可以参与。
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of日层类合, 强序:=xlDescending, 区隐:=区隐, 区色:=常色五灰, 典码输出:=典日层负A根, 区签:="【负A】根", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of日层类合, 强序:=xlDescending, 区隐:=区隐, 区色:=常色五灰, 典码输出:=典日层负A芽, 区签:="【负A】芽", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of日层类合, 强序:=xlDescending, 区隐:=区隐, 区色:=常色五灰, 典码输出:=典日层负A管, 区签:="【负A】管", 区释:="")
    '--------------------------------------------------
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of日层类合, 强序:=xlDescending, 区隐:=区隐, 区色:=常色主白, 典码输出:=典日层负BCD根, 区签:="【负BCD】根", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of日层类合, 强序:=xlDescending, 区隐:=区隐, 区色:=常色四灰, 典码输出:=典日层负D管芽, 区签:="【负D】管芽", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of日层类合, 强序:=xlDescending, 区隐:=区隐, 区色:=常色四灰, 典码输出:=典日层负C管芽, 区签:="【负C】管芽", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of日层类合, 强序:=xlDescending, 区隐:=区隐, 区色:=常色四灰, 典码输出:=典日层负B管芽, 区签:="【负B】管芽", 区释:="")
    '--------------------------------------------------
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of日层类合, 强序:=xlDescending, 区隐:=区隐, 区色:=常色六蓝, 典码输出:=典日层负G根顶离, 区签:="【负G】根顶离", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of日层类合, 强序:=xlDescending, 区隐:=区隐, 区色:=常色八蓝, 典码输出:=典日层负G根顶合, 区签:="【负G】根顶合", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of日层类合, 强序:=xlDescending, 区隐:=区隐, 区色:=常色六蓝, 典码输出:=典日层负G芽顶离, 区签:="【负G】芽顶离", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of日层类合, 强序:=xlDescending, 区隐:=区隐, 区色:=常色八蓝, 典码输出:=典日层负G芽顶合, 区签:="【负G】芽顶合", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of日层类合, 强序:=xlDescending, 区隐:=区隐, 区色:=常色六蓝, 典码输出:=典日层负G管顶离, 区签:="【负G】管顶离", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of日层类合, 强序:=xlDescending, 区隐:=区隐, 区色:=常色八紫, 典码输出:=典日层负G管顶合剔宽大, 区签:="【负GA管顶合】剔宽大", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of日层类合, 强序:=xlDescending, 区隐:=区隐, 区色:=常色八紫, 典码输出:=典日层负G管顶合剔偏大, 区签:="【负GA管顶合】剔偏大BSLA", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of日层类合, 强序:=xlDescending, 区隐:=区隐, 区色:=常色四紫, 典码输出:=典日层负G管顶合剔连久, 区签:="【负GA管顶合】剔连久", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of日层类合, 强序:=xlDescending, 区隐:=区隐, 区色:=常色二灰, 典码输出:=典日层负G管顶合余, 区签:="【负GA管顶合】余", 区释:="")
'----------------------------------------------------------------------------------------
'【测试区域】
'----------------------------------------------------------------------------------------
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色十红, 典码输出:=典日层废单停牌, 区签:="【废】停牌", 区释:="")
End If
'========================================================================================
'返回
'========================================================================================
    IQQQ展擎筛程至D3节按日层废弃 = MSG
'========================================================================================
End Function


Function IQQQ展擎筛程至D3节按日机( _
          ByRef WB As Workbook _
        , ByVal 表名 As String _
        , ByRef 谕组 As Variant _
        , Optional ByRef 典码输出 As Dictionary _
        , Optional ByVal 节签 As String = "" _
        , Optional ByVal 节色 As Long = 常色十青 _
        , Optional ByVal 出节模式 As String = "日机" _
        , Optional ByVal 出全是否 As Boolean = True _
        ) As String
'========================================================================================
'声明变量
'========================================================================================
    Dim CIDL As String
    Dim 是否筛机 As Boolean
'========================================================================================
'定义典
'========================================================================================
    Dim 典日机负宽偏20 As New Dictionary
    Dim 典日机负宽偏15 As New Dictionary
    Dim 典日机负BSLA偏8 As New Dictionary
    Dim 典日机负BSLA偏5 As New Dictionary
    '------------------------------------------------------------------------------------
    Dim 典日机周下破首 As New Dictionary
    Dim 典日机周下破久 As New Dictionary
    '------------------------------------------------------------------------------------
    '【冲机】
    Dim 典日机触升尾升连触首 As New Dictionary
    Dim 典日机触升尾升连 As New Dictionary
    Dim 典日机触升尾跌孕触首 As New Dictionary
    Dim 典日机触升尾跌孕 As New Dictionary
    Dim 典日机o雀升 As New Dictionary
    Dim 典日机r雀升 As New Dictionary
    Dim 典日机特踩 As New Dictionary
    Dim 典日机特升栅 As New Dictionary
    Dim 典日机捡A试尾升连 As New Dictionary
    Dim 典日机捡A试尾升吞 As New Dictionary
    Dim 典日机捡A试尾升孕 As New Dictionary
    Dim 典日机捡A特鼎 As New Dictionary
    Dim 典日机捡B As New Dictionary
    Dim 典日机捡C As New Dictionary
    '-------------------------------------------------------
    Dim 典日机正储触a As New Dictionary
    Dim 典日机正储触b As New Dictionary
    Dim 典日机正储〇 As New Dictionary
    Dim 典日机正储芽 As New Dictionary
    Dim 典日机正储根 As New Dictionary
'========================================================================================
'筛选：微观 以周为粒度进行柱类分析
'日类筛选的核心标准：日柱沿DJA缓步爬升。
'========================================================================================
    For Y = 1 To 典码输出.Count
        X = 典码输出.Items(Y - 1)
        CIDL = 谕组(X, 位qt代码)
        值日基日局 = 谕组(X, 位谕of日基日局)
        是否筛机 = False
        '================================================================================
        If UBCID是代码(CIDL) = False Then
        ElseIf 谕组(X, 位qt停牌) = "S" Then
        ''================================================================================
        ''【出全是否】是否只输出DJC之上
        ''================================================================================
        'ElseIf 出全是否 = False And 谕组(X, 位谕of日类BTZC) < 0 Then
        '                    '典日层废单错误.Add Item:=X, Key:=CIDL        '测试用
        '================================================================================
        '根据【周日联动】区分
        '================================================================================
        ElseIf 谕组(X, 位谕of周类BTZA) <= -2 Then   '弃
                典日机周下破久.Add Item:=X, Key:=CIDL
        ElseIf 谕组(X, 位谕of周类BTZA) = -1 Then
                典日机周下破首.Add Item:=X, Key:=CIDL
        ElseIf 谕组(X, 位谕of仓类) <> "z" And 谕组(X, 位谕of仓类) <> "x" Then
        '================================================================================
        '特殊形态【特负】
        '注：剔除【负偏】较大个股。仅在类似2024年初极端下跌情况下使用。
        '================================================================================
'                '------------------------------------------------------------------------
'                '负向：偏BSLA较大
'                '------------------------------------------------------------------------
'                ElseIf 谕组(X, 位谕of日层BSLA) <= -8 Then
'                        典日机负BSLA偏8.Add Item:=X, Key:=CIDL
'                ElseIf 谕组(X, 位谕of日层BSLA) <= -5 Then
'                        典日机负BSLA偏5.Add Item:=X, Key:=CIDL
'                '------------------------------------------------------------------------
'                '负向：陡
'                '------------------------------------------------------------------------
'                ElseIf 谕组(X, 位谕of日层宽哈JC) <= -20 Then
'                        典日机负宽偏20.Add Item:=X, Key:=CIDL
'                ElseIf 谕组(X, 位谕of日层宽哈JC) <= -15 Then
'                        典日机负宽偏15.Add Item:=X, Key:=CIDL
'########################################################################################
            '============================================================================
            '按照【位谕of日层漏提示】进行细分
            '============================================================================
            If 出节模式 = "日机" Then
                    '====================================================================
                    '按特殊形态
                    '====================================================================
                    If InStr(谕组(X, 位谕of日层漏提示), "特踩") > 0 Then
                            典日机特踩.Add Item:=X, Key:=CIDL
                    ElseIf InStr(谕组(X, 位谕of日层漏提示), "特升栅") > 0 Then
                            典日机特升栅.Add Item:=X, Key:=CIDL
                    '====================================================================
                    '单列：储。
                    '====================================================================
                    ElseIf InStr(谕组(X, 位谕of日层界), "储") > 0 Then
                        If Left(谕组(X, 位谕of日层柱型), 1) = "X" Then
                                典日机正储根.Add Item:=X, Key:=CIDL
                        ElseIf InStr(谕组(X, 位谕of日层柱型), "a顶") > 0 Then
'                            If InStr(谕组(X, 位谕of日层柱型), ".触首") > 0 Then
'                                典日机正储触a_触首.Add Item:=X, Key:=CIDL
'                            ElseIf InStr(谕组(X, 位谕of日层柱型), ".冲" & 常枚并符升连) > 0 Then
'                                典日机正储触a_尾升连.Add Item:=X, Key:=CIDL
'                            ElseIf InStr(谕组(X, 位谕of日层柱型), ".常" & 常枚并符跌孕) > 0 Or InStr(谕组(X, 位谕of日层柱型), ".常" & 常枚并符跌吞) > 0 Then     '首先排除异常情况
'                                典日机正储触a_尾跌单.Add Item:=X, Key:=CIDL
'                            ElseIf InStr(谕组(X, 位谕of日层柱型), ".试" & 常枚并符跌连) > 0 Then
'                                典日机正储触a_尾跌连.Add Item:=X, Key:=CIDL
'                            Else
'                                典日机正储触a_尾升单.Add Item:=X, Key:=CIDL
'                            End If
                                典日机正储触a.Add Item:=X, Key:=CIDL
                        ElseIf InStr(谕组(X, 位谕of日层柱型), "b顶") > 0 Then
                                典日机正储触b.Add Item:=X, Key:=CIDL
                        ElseIf InStr(谕组(X, 位谕of日层柱型), "〇") > 0 Then
                                典日机正储〇.Add Item:=X, Key:=CIDL
                        Else
                                典日机正储芽.Add Item:=X, Key:=CIDL
                        End If
                    '====================================================================
                    '按顶型
                    '====================================================================
                    ElseIf InStr(谕组(X, 位谕of日层漏提示), "触升" & 常枚并符升连) > 0 Then
                        If InStr(谕组(X, 位谕of日层柱型), "触首") > 0 Then
                            典日机触升尾升连触首.Add Item:=X, Key:=CIDL
                        Else
                            典日机触升尾升连.Add Item:=X, Key:=CIDL
                        End If
                    ElseIf InStr(谕组(X, 位谕of日层漏提示), "触升" & 常枚并符跌孕) > 0 Then
                        If InStr(谕组(X, 位谕of日层柱型), "触首") > 0 Then
                            典日机触升尾跌孕触首.Add Item:=X, Key:=CIDL
                        Else
                            典日机触升尾跌孕.Add Item:=X, Key:=CIDL
                        End If
                    '--------------------------------------------------------------------
                    ElseIf InStr(谕组(X, 位谕of日层漏提示), "r雀升") > 0 Then
                            典日机r雀升.Add Item:=X, Key:=CIDL
                    '--------------------------------------------------------------------
                    ElseIf InStr(谕组(X, 位谕of日层柱型), "根") > 0 Then
                        If InStr(谕组(X, 位谕of日层漏提示), "e试" & 常枚并符升连) > 0 Then
                            典日机捡A试尾升连.Add Item:=X, Key:=CIDL
                        ElseIf InStr(谕组(X, 位谕of日层漏提示), "e试" & 常枚并符升吞) > 0 Then
                            典日机捡A试尾升吞.Add Item:=X, Key:=CIDL
                        ElseIf InStr(谕组(X, 位谕of日层漏提示), "e试" & 常枚并符升孕) > 0 Then
                            典日机捡A试尾升孕.Add Item:=X, Key:=CIDL
                        ElseIf InStr(谕组(X, 位谕of日层漏提示), "特鼎") > 0 Then
                            典日机捡A特鼎.Add Item:=X, Key:=CIDL
                        End If
                    ElseIf InStr(谕组(X, 位谕of日层稳口), "破B") > 0 Then
                            '注20241015：按照日类仓位策略，只保留底仓，不主动进入。
                            '典日机捡B.Add Item:=X, Key:=CIDL
                    End If
                    '====================================================================
            End If
            '============================================================================
        End If
    Next
'========================================================================================
    Dim 区隐 As Boolean
    区隐 = False
    Dim 节缀 As String
    节缀 = ""
'========================================================================================
If 出节模式 = "日机" Then
    '--------------------------------------------------------------------------------
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色43绿, 典码输出:=典日机特踩, 区签:="机【特踩】", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色43绿, 典码输出:=典日机特升栅, 区签:="机【特升栅】", 区释:="")
    '--------------------------------------------------------------------------------
    '要把DJEDC初始进入情况找出来。
    '--------------------------------------------------------------------------------
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色主绿, 典码输出:=典日机正储触a, 区签:="机【正储触a】", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色主绿, 典码输出:=典日机正储触b, 区签:="机【正储触b】", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六绿, 典码输出:=典日机正储〇, 区签:="机【正储】〇", 区释:="警惕诱多")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色四绿, 典码输出:=典日机正储芽, 区签:="机【正储】芽", 区释:="警惕诱多")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色四绿, 典码输出:=典日机正储根, 区签:="机【正储】根", 区释:="震荡")
    '--------------------------------------------------------------------------------
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色主靛, 典码输出:=典日机触升尾跌孕, 区签:="机【a常尾跌孕】单跌捡漏策略", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色主靛, 典码输出:=典日机触升尾升连, 区签:="机【a冲尾升连】顺势冲高策略", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色八靛, 典码输出:=典日机触升尾跌孕触首, 区签:="机【触首】【a常尾跌孕】单跌捡漏策略", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色八靛, 典码输出:=典日机触升尾升连触首, 区签:="机【触首】【a冲尾升连】顺势冲高策略", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色主绿, 典码输出:=典日机r雀升, 区签:="机【r试升】雀a", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色八青, 典码输出:=典日机捡A试尾升连, 区签:="机【捡A】试尾升连", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色八青, 典码输出:=典日机捡A试尾升吞, 区签:="机【捡A】试尾升吞", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色八青, 典码输出:=典日机捡A试尾升孕, 区签:="机【捡A】试尾升孕", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色43绿, 典码输出:=典日机捡A特鼎, 区签:="机【捡A】特鼎", 区释:="")
    'Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色八青, 典码输出:=典日机捡B, 区签:="机【捡B】", 区释:="")
    'Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色八青, 典码输出:=典日机捡C, 区签:="机【捡C】", 区释:="")
    '----------------------------------------------------------------------------------------
    '【周区域】
    '----------------------------------------------------------------------------------------
    'Call IQQQ展擎出程至页(WB, 表名, 是否建表:=False, 节色:=常色主靛, 节签:="【机周】")
    'Call IQQQ展擎出程至页(WB, 表名, 谕组, 区隐:=区隐, 区色:=常色八红, 典码输出:=典日机周下破首, 区签:="【机周】首下破", 区释:="警惕破位")
    'Call IQQQ展擎出程至页(WB, 表名, 谕组,  区隐:=区隐, 区色:=常色八红, 典码输出:=典日机周下破久, 区签:="【机周】多下破", 区释:="警惕破位")
    '--------------------------------------------------------------------------------
End If
''----------------------------------------------------------------------------------------
''【偏区域】
''----------------------------------------------------------------------------------------
'    '====================================================================================
'    '【机负】 主要针对【DJC之下BSLA偏离太大】
'    '====================================================================================
'    Call IQQQ展擎出程至页(WB, 表名, 是否建表:=False, 节色:=常色六紫, 节签:="【机负偏】BSLA偏")
'    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of日层类合, 强序:=xlDescending, 区隐:=区隐, 区色:=常色十蓝, 典码输出:=典日机负BSLA偏8, 区签:="【机负BSLA偏】小于-8", 区释:="")
'    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of日层类合, 强序:=xlDescending, 区隐:=区隐, 区色:=常色八蓝, 典码输出:=典日机负BSLA偏5, 区签:="【机负BSLA偏】小于-5", 区释:="")
'    '--------------------------------------------------
'    'BSCA偏较大，并不是很好的【特殊形态】，以后要进行约束，并转到【机】
'    Call IQQQ展擎出程至页(WB, 表名, 是否建表:=False, 节色:=常色六紫, 节签:="【机负偏】(BS哼JC)宽偏")
'    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of日层类合, 强序:=xlDescending, 区隐:=区隐, 区色:=常色六蓝, 典码输出:=典日机负宽偏20, 区签:="【机负宽偏】小于-20", 区释:="")
'    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of日层类合, 强序:=xlDescending, 区隐:=区隐, 区色:=常色六蓝, 典码输出:=典日机负宽偏15, 区签:="【机负宽偏】小于-15", 区释:="")
'========================================================================================
'返回
'========================================================================================
        IQQQ展擎筛程至D3节按日机 = MSG
'========================================================================================
End Function
'########################################################################################
'########################################################################################
'#####################################   QQQ  筛程至页   ################################
'########################################################################################
'########################################################################################








'########################################################################################
'########################################################################################
'#####################################   QQQ  筛程至章   ################################
'########################################################################################
'########################################################################################
'========================================================================================
'========================================================================================
'功能：按照出章模式输出到块
'模式：/月护/日乾/活跃/涨停
'========================================================================================
'========================================================================================
Function IQQQ展擎筛程至C0章按通用( _
          ByRef WB As Workbook _
        , ByVal 表名 As String _
        , ByRef 谕组 As Variant _
        , Optional ByRef 典码输出 As Dictionary _
        , Optional ByVal 章签 As String = "" _
        , Optional ByVal 章色 As Long = 常色43绿 _
        , Optional ByVal 出章模式 As String = "" _
        , Optional ByVal 出节模式 As String = "周层" _
        , Optional ByVal 出全是否 As Boolean = True _
        , Optional ByVal 是否建表 As Boolean = False _
        ) As String
'========================================================================================
'验证
'========================================================================================
    If VBA.IsEmpty(谕组) = True Then Exit Function
    '------------------------------------------------------------------------------------
    If 典码输出 Is Nothing Then
        Call UTL数据转换_集组码2典码位(典码位:=典码输出, 组码:=谕组)
    End If
'========================================================================================
'输出准备：输出模式
'出节调用模式：仅提供【出节模式】自动匹配出章模式。即，[周层]出节模式对应[月护]出章模式；[日层]出节模式对应[日乾]出章模式。
'========================================================================================
    If 出章模式 = "" Then
        If 出节模式 = "周层" Or 出节模式 = "周地" Or 出节模式 = "周护" Then
            出章模式 = "月护"
        ElseIf 出节模式 = "日层" Or 出节模式 = "日机" Then
            出章模式 = "日乾"
        Else
            出章模式 = "混"
        End If
    End If
'========================================================================================
'输出准备：章签
'========================================================================================
    Dim 计码输出 As Integer
    计码输出 = 典码输出.Count
    '------------------------------------------------------------------------------------
    Dim 章签输出 As String
    章签输出 = ">>章按" & IIf(Len(出章模式) > 0, 出章模式, "混") & ">" & IIf(Len(章签) > 0, 章签, "") & "：" & 计码输出
    Dim MSG As String
    MSG = 章签输出 & vbCrLf
    '------------------------------------------------------------------------------------
    If 是否建表 = True And UTL判断工表存在(表名, WB) = True Then Call PBASE格程工具_表操工表删除(表名, WB)
    If 计码输出 = 0 Then
        Exit Function
    Else
        Call IQQQ展擎出程至页(WB, 表名, 是否建表:=是否建表, 章色:=章色, 章签:=章签输出)
    End If
'========================================================================================
'输出：出章调用模式
'========================================================================================
    If InStr(出章模式, "混") > 0 Then
        Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 典码输出, 出节模式:=出节模式, 出全是否:=出全是否)
    ElseIf InStr(出章模式, "月护") > 0 Or InStr(出章模式, "周护") > 0 Then
        Call IQQQ展擎筛程至C1章按护型(WB, 表名, 谕组, 典码输出, 章色:=章色, 章签:=章签, 出节模式:=出节模式, 出全是否:=出全是否)
    ElseIf InStr(出章模式, "日乾") > 0 Then
        Call IQQQ展擎筛程至C3章按日乾(WB, 表名, 谕组, 典码输出, 章色:=章色, 章签:=章签, 出节模式:=出节模式, 出全是否:=出全是否)
    ElseIf InStr(出章模式, "活") > 0 Then
        Call IQQQ展擎筛程至C8章按活(WB, 表名, 谕组, 典码输出, 章色:=章色, 章签:=章签, 出节模式:=出节模式, 出全是否:=出全是否)
    ElseIf InStr(出章模式, "停") > 0 Then
        MSG = MSG & IQQQ展擎筛程至C8章按停(WB, 表名, 谕组, 典码输出, 章色:=章色, 章签:=章签, 出节模式:=出节模式, 出全是否:=出全是否)
    End If
'========================================================================================
    IQQQ展擎筛程至C0章按通用 = MSG
End Function


Function IQQQ展擎筛程至D4节按日综( _
          ByRef WB As Workbook _
        , ByVal 表名 As String _
        , ByRef 谕组 As Variant _
        , Optional ByRef 典码输出 As Dictionary _
        , Optional ByVal 节签 As String = "" _
        , Optional ByVal 节色 As Long = 常色十青 _
        , Optional ByVal 出节模式 As String = "周层" _
        , Optional ByVal 出全是否 As Boolean = True _
        ) As String
'========================================================================================
'声明变量
'========================================================================================
    Dim CIDL As String
    Dim 是否二筛 As Boolean
'========================================================================================
'定义典
'========================================================================================
    Dim 典月停牌 As New Dictionary
    '--------------------------------------------------
    Dim 典日正单DXCD负交CE负 As New Dictionary
    Dim 典日正单DXCD负交CE正 As New Dictionary
    Dim 典日正单DXCD正交CE负 As New Dictionary
    Dim 典日正单宽大30 As New Dictionary
    Dim 典日正单宽大20 As New Dictionary
    '---------------------------------------
    Dim 典日正单BTZD负 As New Dictionary
    Dim 典日正单BTZC负 As New Dictionary
    '---------------------------------------
    Dim 典日正界破 As New Dictionary
    Dim 典日正界DEF余多 As New Dictionary
    '---------------------------------------
    Dim 典日正界再B As New Dictionary
    Dim 典日正界再C As New Dictionary
    Dim 典日正界再D As New Dictionary
    '---------------------------------------
    Dim 典日正界初 As New Dictionary
    Dim 典日正界储 As New Dictionary
    Dim 典日正界主宽小8 As New Dictionary
    Dim 典日正界主Ge As New Dictionary
    Dim 典日正界主Gd As New Dictionary
    Dim 典日正界主Ga As New Dictionary
'========================================================================================
'筛选：微观 以周为粒度进行柱类分析
'========================================================================================
    For Y = 1 To 典码输出.Count
        X = 典码输出.Items(Y - 1)
        CIDL = 谕组(X, 位qt代码)
        '================================================================================
        If UBCID是代码(CIDL) = False Then
        ElseIf 谕组(X, 位qt停牌) = "S" Then
                    典月停牌.Add Item:=X, Key:=CIDL
        Else
        '================================================================================
        '过滤：月局
        '注20240526：以WXCD确定大势，以WJC为丘进行必赢操盘。主选区域包括：
        '   阶0（上破WJC才为备选区/M5e/M6v/M1v，WJC之下不要尝试）
        '   阶13（只以DJC之上）由于持续时间较短，与阶0共同展示。
        '   阶7（大涨幅在DJC之上，在DJC与DJD之间时需要依赖并符进行预测是否会回到DJC之上，但即使回到DJC之上也可能不会再有大涨）
        '   阶46（属于下降趋势的反弹，单独列示，以DJC为操盘线）
        '注20240526：对于WJC之下/w6w/w6v处理，本身由于处于WJC之下不具有可操盘资质，但如果已经沿WJA小碎步爬行较久则可进行小仓尝试，其余WJC之下情况都进行舍弃。对于阶7还有可取之处，对于劫0千万不要尝试，对于劫13完全按照WJC进行操作。
        '================================================================================
                        '----------------------------------------------------------------
                        '剔：
                        '----------------------------------------------------------------
                        '过滤：DXCD负交
                        If 谕组(X, 位谕of日类BTCD) < 0 Then
                            If 谕组(X, 位谕of日类BTCE) < 0 Then
                                典日正单DXCD负交CE负.Add Item:=X, Key:=CIDL
                            Else
                                典日正单DXCD负交CE正.Add Item:=X, Key:=CIDL
                            End If
                        '过滤：DXCD正交.月诱
                        ElseIf 谕组(X, 位谕of日类BTCE) < 0 Then
                                典日正单DXCD正交CE负.Add Item:=X, Key:=CIDL
                        '----------------------------------------------------------------
                        '剔：不符合范围
                        '----------------------------------------------------------------
                        ElseIf 谕组(X, 位谕of日类BTZD) < 0 Then
                                典日正单BTZD负.Add Item:=X, Key:=CIDL
                        ElseIf 谕组(X, 位谕of日类BTZC) < 0 Then
                                典日正单BTZC负.Add Item:=X, Key:=CIDL
                        '----------------------------------------------------------------
                        '以下均为：DXCD>0且DXZC>0
'                        '----------------------------------------------------------------
'                        '剔：【管宽】过大
'                        '----------------------------------------------------------------
'                        ElseIf 谕组(X, 位谕of日层偏顶JC) > 20 Then
'                                典日正单宽大20.Add Item:=X, Key:=CIDL
                        '----------------------------------------------------------------
                        '核心筛选：已经不符合日类规则。只能寄希望于【周类捡漏规则】
                        '----------------------------------------------------------------
                        ElseIf InStr(谕组(X, 位谕of日层界), "破") > 0 Then
                                    典日正界破.Add Item:=X, Key:=CIDL
                        ElseIf 谕组(X, 位谕of日类BTZA) <= -2 And _
                        (Right(谕组(X, 位谕of日管中符串), 1) = "D" Or Right(谕组(X, 位谕of日管中符串), 1) = "E" Or Right(谕组(X, 位谕of日管中符串), 1) = "F") Then
                                    典日正界DEF余多.Add Item:=X, Key:=CIDL
                        '----------------------------------------------------------------
                        '核心筛选：再
                        '----------------------------------------------------------------
                        ElseIf InStr(谕组(X, 位谕of日层界), "再") > 0 Then
                            If InStr(谕组(X, 位谕of日层界), "再D") > 0 Then
                                典日正界再D.Add Item:=X, Key:=CIDL
                            ElseIf InStr(谕组(X, 位谕of日层界), "再C") > 0 Then
                                典日正界再C.Add Item:=X, Key:=CIDL
                            Else
                                典日正界再B.Add Item:=X, Key:=CIDL
                            End If
                        '----------------------------------------------------------------
                        '单列：初始突破DJC
                        '----------------------------------------------------------------
                        ElseIf InStr(谕组(X, 位谕of日层界), "初") > 0 Then
                                    典日正界初.Add Item:=X, Key:=CIDL
                        ElseIf InStr(谕组(X, 位谕of日层界), "储") > 0 Then
                                    典日正界储.Add Item:=X, Key:=CIDL
                        '----------------------------------------------------------------
                        '核心筛选：主
                        '----------------------------------------------------------------
                        Else
                            If 谕组(X, 位谕of日层偏顶JC) <= 8 Then
                                典日正界主宽小8.Add Item:=X, Key:=CIDL
                            ElseIf InStr(谕组(X, 位谕of日层界), "Ge") > 0 Then
                                典日正界主Ge.Add Item:=X, Key:=CIDL
                            ElseIf InStr(谕组(X, 位谕of日层界), "Gd") > 0 Then
                                典日正界主Gd.Add Item:=X, Key:=CIDL
                            Else
                                典日正界主Ga.Add Item:=X, Key:=CIDL
                            End If
                        End If
                        '----------------------------------------------------------------
        End If
        '================================================================================
    Next
'========================================================================================
'========================================================================================
'【周机】集中展示
'首先是：WJA介于WJC与WJD之间
'========================================================================================
'走势分类
'========================================================================================
    '--------------------------------------------------------------------------------
    '日局：主
    '--------------------------------------------------------------------------------
    'Call IQQQ展擎出程至页(WB, 表名, 是否建表:=False, 章色:=常色八红, 章签:="【正主】")
    Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="日层", 出全是否:=True, 节色:=常色主靛, 典码输出:=典日正界主宽小8, 节签:="【正主】针对管宽(DS哼JC)小【针对初始突破DJC】8")
    Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="日层", 出全是否:=True, 节色:=常色八靛, 典码输出:=典日正界主Ga, 节签:="【正主】针对管宽(DS哼JC)中.Gabc")
    Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="日层", 出全是否:=True, 节色:=常色八靛, 典码输出:=典日正界主Gd, 节签:="【正主】针对管宽(DS哼JC)中.Gd")
    Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="日层", 出全是否:=True, 节色:=常色八靛, 典码输出:=典日正界主Ge, 节签:="【正主】针对管宽(DS哼JC)中.Ge")
    '--------------------------------------------------------------------------------
    '日局：初
    '--------------------------------------------------------------------------------
    'Call IQQQ展擎出程至页(WB, 表名, 是否建表:=False, 章色:=常色43绿, 章签:="【正初】")
    Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="日层", 出全是否:=True, 节色:=常色43绿, 典码输出:=典日正界初, 节签:="【正初】")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色43绿, 典码输出:=典日正界储, 区签:="【正储】", 区释:="")
    '--------------------------------------------------------------------------------
    '日局：再
    '--------------------------------------------------------------------------------
    'Call IQQQ展擎出程至页(WB, 表名, 是否建表:=False, 章色:=常色主绿, 章签:="【正再】")
    Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="日层", 出全是否:=True, 节色:=常色六紫, 典码输出:=典日正界再B, 节签:="【正再】界B")
    Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="日层", 出全是否:=True, 节色:=常色六紫, 典码输出:=典日正界再C, 节签:="【正再】界C")
    Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="日层", 出全是否:=True, 节色:=常色六紫, 典码输出:=典日正界再D, 节签:="【正再】界D")
    '--------------------------------------------------------------------------------
    '剔：诱
    '--------------------------------------------------------------------------------
    'Call IQQQ展擎出程至页(WB, 表名, 是否建表:=False, 章色:=常色八红, 章签:="剔除【剔】诱")
    Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="日层", 出全是否:=True, 节色:=常色八蓝, 典码输出:=典日正单DXCD正交CE负, 节签:="【剔诱】DXCD正交CE负")
    '--------------------------------------------------------------------------------
    '日局：破
    '--------------------------------------------------------------------------------
    Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="日层", 出全是否:=True, 节色:=常色十橙, 典码输出:=典日正界DEF余多, 节签:="【正初正再】DTZA负.DEF余多")
    Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="日层", 出全是否:=True, 节色:=常色八橙, 典码输出:=典日正界破, 节签:="【正破】DTZB负")
    Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="日层", 出全是否:=True, 节色:=常色四橙, 典码输出:=典日正单BTZC负, 节签:="【正破】DTZC负")
    Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="日层", 出全是否:=True, 节色:=常色四橙, 典码输出:=典日正单BTZD负, 节签:="【正破】DTZD负")
'    '--------------------------------------------------------------------------------
'    '剔：正宽大于20。注20242023：偏离DJC较大属于高位震荡，性质与低波动不同，可以单列。这些只可能属于两种情况，一种是超级主升，另一种是冲高等待回落。两种风险都比较大。
'    '--------------------------------------------------------------------------------
'    'Call IQQQ展擎出程至页(WB, 表名, 是否建表:=False, 章色:=常色八红, 章签:="剔除【正宽】针对管宽≥20")
'    Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="日层", 出全是否:=True, 节色:=常色十红, 典码输出:=典日正单宽大20, 节签:="【剔诱.正宽】大20")
    '--------------------------------------------------------------------------------
    '剔：弃
    '--------------------------------------------------------------------------------
    Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="日层", 出全是否:=True, 节色:=常色八蓝, 典码输出:=典日正单DXCD负交CE正, 节签:="【剔诱】DXCD负交CE正")
    Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:="日层", 出全是否:=True, 节色:=常色八蓝, 典码输出:=典日正单DXCD负交CE负, 节签:="【剔诱】DXCD负交CE负")
    '------------------------------------------------------------------------------------
    '剔：停牌
    '------------------------------------------------------------------------------------
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of周层三鳄, 强序:=xlDescending, 区色:=常色四灰, 典码输出:=典月停牌, 区签:="【停牌】", 区释:="")
'========================================================================================
'返回
'========================================================================================
    IQQQ展擎筛程至D4节按日综 = MSG
'========================================================================================
End Function






Function IQQQ展擎筛程至C1章按护型( _
          ByRef WB As Workbook _
        , ByVal 表名 As String _
        , ByRef 谕组 As Variant _
        , Optional ByRef 典码输出 As Dictionary _
        , Optional ByVal 章签 As String = "" _
        , Optional ByVal 章色 As Long = 常色43绿 _
        , Optional ByVal 出章模式 As String = "周护" _
        , Optional ByVal 出节模式 As String = "周层" _
        , Optional ByVal 出全是否 As Boolean = True _
        ) As String
'========================================================================================
'声明变量
'========================================================================================
    Dim CIDL As String
    Dim 是否二筛 As Boolean
'========================================================================================
'定义典
'========================================================================================
    Dim 典周护型停牌 As New Dictionary
    '--------------------------------------------------
    Dim 典月护金A7 As New Dictionary
    Dim 典月护金C7 As New Dictionary
    Dim 典月护金余 As New Dictionary
    Dim 典月护银 As New Dictionary
    Dim 典月护唏 As New Dictionary
    Dim 典月护嘘 As New Dictionary
    Dim 典月护屎 As New Dictionary
    Dim 典月护尿 As New Dictionary
    '--------------------------------------------------
    Dim 典月护金周护ab As New Dictionary
    Dim 典月护金周护r As New Dictionary
    Dim 典月护金周护c As New Dictionary
    Dim 典月护金周护yz As New Dictionary
'========================================================================================
'分类：按【位谕of周层三鳄】第二位精确定位。
'    位谕of周层三鳄 = Left(值WXCD护型,3) & Mid(值WXCD护型,5,1) & Left(周层护型,1) & Mid(周层护型,3,1) & "." & Left(日层护型,1) & Mid(日层护型,3,1)
'    第二位 = Mid(值WXCD护型,2,1)，六种值:
'      金（CD>0.ZC>=ZC）最高品质 → 细分按周道月护 A7/C7/余
'      银（CD<=0.ZD>0）可持有
'      嘘（CD>0.ZC<0）CD嘴.大概率向上
'      唏（CD<=0.ZC>0）CD嘴.大概率向下
'      屎（CD<=0.ZC<=ZC）不触
'      尿（CD>0.ZD<0）不触
'注20260614：改为按三鳄第二位，替代原周道月护InStr模糊匹配。金/银始终输出；嘘唏屎尿由出全是否控制。
'========================================================================================
'========================================================================================
'筛选：微观 以周为粒度进行柱类分析
'========================================================================================
    For Y = 1 To 典码输出.Count
        X = 典码输出.Items(Y - 1)
        CIDL = 谕组(X, 位qt代码)
        '================================================================================
        '按照【月护】进行细分
        '================================================================================
        If 出章模式 = "月护" Then
            If UBCID是代码(CIDL) = False Then
            ElseIf 谕组(X, 位qt停牌) = "S" Then
                        典周护型停牌.Add Item:=X, Key:=CIDL
            Else
                '========================================================================
                        If Mid(谕组(X, 位谕of周层三鳄), 2, 1) = "金" Then
                                    If InStr(谕组(X, 位谕of周道月势), "A7") > 0 Then
                                        典月护金A7.Add Item:=X, Key:=CIDL
                                    ElseIf InStr(谕组(X, 位谕of周道月势), "C7") > 0 Then
                                        典月护金C7.Add Item:=X, Key:=CIDL
                                    Else
                                        典月护金余.Add Item:=X, Key:=CIDL
                                    End If
                        ElseIf Mid(谕组(X, 位谕of周层三鳄), 2, 1) = "银" Then
                                    典月护银.Add Item:=X, Key:=CIDL
                        ElseIf Mid(谕组(X, 位谕of周层三鳄), 2, 1) = "唏" Then
                                    典月护唏.Add Item:=X, Key:=CIDL
                        ElseIf Mid(谕组(X, 位谕of周层三鳄), 2, 1) = "嘘" Then
                                    典月护嘘.Add Item:=X, Key:=CIDL
                        ElseIf Mid(谕组(X, 位谕of周层三鳄), 2, 1) = "屎" Then
                                    典月护屎.Add Item:=X, Key:=CIDL
                        ElseIf Mid(谕组(X, 位谕of周层三鳄), 2, 1) = "尿" Then
                                    典月护尿.Add Item:=X, Key:=CIDL
                        End If
                '========================================================================
            End If
        End If
        '================================================================================
        '按照【周护】进行细分
        '================================================================================
        If 出章模式 = "周护" Then
            If UBCID是代码(CIDL) = False Then
            ElseIf 谕组(X, 位qt停牌) = "S" Then
                        典周护型停牌.Add Item:=X, Key:=CIDL
            Else
                '========================================================================
                        If Mid(谕组(X, 位谕of周层三鳄), 2, 1) = "金" Then
                                    Select Case Mid(谕组(X, 位谕of周层三鳄), 5, 1)
                                    Case "a", "b"
                                        典月护金周护ab.Add Item:=X, Key:=CIDL
                                    Case "r"
                                        典月护金周护r.Add Item:=X, Key:=CIDL
                                    Case "c"
                                        典月护金周护c.Add Item:=X, Key:=CIDL
                                    Case "y", "z"
                                        典月护金周护yz.Add Item:=X, Key:=CIDL
                                    End Select
                        ElseIf Mid(谕组(X, 位谕of周层三鳄), 2, 1) = "银" Then
                                    典月护银.Add Item:=X, Key:=CIDL
                        ElseIf Mid(谕组(X, 位谕of周层三鳄), 2, 1) = "唏" Then
                                    典月护唏.Add Item:=X, Key:=CIDL
                        ElseIf Mid(谕组(X, 位谕of周层三鳄), 2, 1) = "嘘" Then
                                    典月护嘘.Add Item:=X, Key:=CIDL
                        ElseIf Mid(谕组(X, 位谕of周层三鳄), 2, 1) = "屎" Then
                                    典月护屎.Add Item:=X, Key:=CIDL
                        ElseIf Mid(谕组(X, 位谕of周层三鳄), 2, 1) = "尿" Then
                                    典月护尿.Add Item:=X, Key:=CIDL
                        End If
                '========================================================================
            End If
        End If
        '================================================================================
    Next
'========================================================================================
'按【月护】
'========================================================================================
If 出章模式 = "月护" Then
    '--------------------------------------------------------------------------------
    '始终输出（金/银）
    '--------------------------------------------------------------------------------
    Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:=出节模式, 出全是否:=出全是否, 节色:=常色主靛, 典码输出:=典月护金A7, 节签:="【三鳄】金·A7")
    Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:=出节模式, 出全是否:=出全是否, 节色:=常色主靛, 典码输出:=典月护金C7, 节签:="【三鳄】金·C7")
    Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:=出节模式, 出全是否:=出全是否, 节色:=常色主靛, 典码输出:=典月护金余, 节签:="【三鳄】金·余")
    Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:=出节模式, 出全是否:=出全是否, 节色:=常色八黄, 典码输出:=典月护银, 节签:="【三鳄】银·可持")
    '--------------------------------------------------------------------------------
    '出全是否控制（嘘/唏/屎/尿）
    '--------------------------------------------------------------------------------
    If 出全是否 = True Then
        Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:=出节模式, 出全是否:=出全是否, 节色:=常色四红, 典码输出:=典月护唏, 节签:="【三鳄】唏·CD嘴↓")
        Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:=出节模式, 出全是否:=出全是否, 节色:=常色八黄, 典码输出:=典月护嘘, 节签:="【三鳄】嘘·CD嘴↑")
        Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:=出节模式, 出全是否:=出全是否, 节色:=常色四红, 典码输出:=典月护屎, 节签:="【三鳄】屎·勿入")
        Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:=出节模式, 出全是否:=出全是否, 节色:=常色四红, 典码输出:=典月护尿, 节签:="【三鳄】尿·勿入")
    End If
    '--------------------------------------------------------------------------------
End If
'========================================================================================
'按【周护】
'========================================================================================
If 出章模式 = "周护" Then
    '--------------------------------------------------------------------------------
    '始终输出（金/银）
    '--------------------------------------------------------------------------------
    Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:=出节模式, 出全是否:=出全是否, 节色:=常色主靛, 典码输出:=典月护金周护ab, 节签:="【三鳄】月护金.周护a")
    Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:=出节模式, 出全是否:=出全是否, 节色:=常色主靛, 典码输出:=典月护金周护r, 节签:="【三鳄】月护金.周护r")
    Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:=出节模式, 出全是否:=出全是否, 节色:=常色主靛, 典码输出:=典月护金周护c, 节签:="【三鳄】月护金.周护c")
    Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:=出节模式, 出全是否:=出全是否, 节色:=常色主靛, 典码输出:=典月护金周护yz, 节签:="【三鳄】月护金.周护yz")
    Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:=出节模式, 出全是否:=出全是否, 节色:=常色八黄, 典码输出:=典月护银, 节签:="【三鳄】月护银·可持")
    '--------------------------------------------------------------------------------
    '出全是否控制（嘘/唏/屎/尿）
    '--------------------------------------------------------------------------------
    If 出全是否 = True Then
        Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:=出节模式, 出全是否:=出全是否, 节色:=常色四红, 典码输出:=典月护唏, 节签:="【三鳄】月护唏·CD嘴↓")
        Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:=出节模式, 出全是否:=出全是否, 节色:=常色八黄, 典码输出:=典月护嘘, 节签:="【三鳄】月护嘘·CD嘴↑")
        Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:=出节模式, 出全是否:=出全是否, 节色:=常色四红, 典码输出:=典月护屎, 节签:="【三鳄】月护屎·勿入")
        Call IQQQ展擎筛程至D0节按通用(WB, 表名, 谕组, 出节模式:=出节模式, 出全是否:=出全是否, 节色:=常色四红, 典码输出:=典月护尿, 节签:="【三鳄】月护尿·勿入")
    End If
    '--------------------------------------------------------------------------------
End If
'========================================================================================
    '------------------------------------------------------------------------------------
    '剔：停牌
    '------------------------------------------------------------------------------------
    If 典周护型停牌.Count > 0 Then
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 强列:=位谕of周层三鳄, 强序:=xlDescending, 区色:=常色四灰, 典码输出:=典周护型停牌, 区签:="【停牌】", 区释:="", 节色:=常色八灰, 节签:="【停牌】")
    End If
'========================================================================================
'返回
'========================================================================================
    IQQQ展擎筛程至C1章按护型 = MSG
'========================================================================================
End Function




'========================================================================================
'========================================================================================
'功能：按照出节模式输出到块
'是否全部展示：仅【周横】不进行过滤，周局和日局均进行过滤
'模式：/周全/周优/周机/日优
'========================================================================================
'========================================================================================
Function IQQQ展擎筛程至D0节按通用( _
          ByRef WB As Workbook _
        , ByVal 表名 As String _
        , ByRef 谕组 As Variant _
        , Optional ByRef 典码输出 As Dictionary _
        , Optional ByVal 章签 As String = "" _
        , Optional ByVal 章色 As Long = 常色十青 _
        , Optional ByVal 节签 As String = "" _
        , Optional ByVal 节色 As Long = 常色十青 _
        , Optional ByVal 出节模式 As String = "周层" _
        , Optional ByVal 出全是否 As Boolean = True _
        ) As String
'========================================================================================
'验证
'========================================================================================
    If VBA.IsEmpty(谕组) = True Then Exit Function
    '------------------------------------------------------------------------------------
    If 典码输出 Is Nothing Then
        Call UTL数据转换_集组码2典码位(典码位:=典码输出, 组码:=谕组)
    End If
'========================================================================================
'输出准备：设置【节景】节的背景色
'========================================================================================
    Dim 节景 As Long
    If 出节模式 = "周层" Then
        节景 = 常色二红
    ElseIf 出节模式 = "周护" Then
        节景 = 常色五黄
    ElseIf 出节模式 = "周地" Then
        节景 = 常色四黄
    ElseIf 出节模式 = "日层" Then
        节景 = 常色二青
    ElseIf 出节模式 = "日机" Then
        节景 = 常色四青
    End If
'========================================================================================
'输出准备：节签输出
'========================================================================================
    Dim 计码输出 As Integer
    计码输出 = 典码输出.Count
    '------------------------------------------------------------------------------------
    Dim 节签输出 As String
    节签输出 = ">节按" & 出节模式 & ">" & IIf(Len(节签) > 0, 节签, "") & " ：" & 计码输出
    Dim MSG As String
    MSG = 节签输出 & vbCrLf
    IQQQ展擎筛程至D0节按通用 = MSG
    '------------------------------------------------------------------------------------
    If 是否建表 = True And UTL判断工表存在(表名, WB) = True Then Call PBASE格程工具_表操工表删除(表名, WB)
    If 计码输出 = 0 Then
        Exit Function
    ElseIf 是否建表 = True Then
        Call IQQQ展擎出程至页(WB, 表名, 节景:=节景, 节色:=节色, 节签:=节签输出, 是否建表:=是否建表, 章色:=节色)
    Else
        Call IQQQ展擎出程至页(WB, 表名, 节景:=节景, 节色:=节色, 节签:=节签输出)
    End If
'========================================================================================
'输出：出节调用模式
'========================================================================================
    If 出节模式 = "周护" Or 出节模式 = "周地" Or 出节模式 = "周层" Then
        Call IQQQ展擎筛程至D2节按周层(WB, 表名, 谕组, 典码输出, 节色:=节色, 节签:=节签, 出节模式:=出节模式, 出全是否:=出全是否)
    ElseIf InStr(出节模式, "日综") > 0 Then
        Call IQQQ展擎筛程至D4节按日综(WB, 表名, 谕组, 典码输出, 节色:=节色, 节签:=节签, 出节模式:=出节模式, 出全是否:=出全是否)
    ElseIf 出节模式 = "日层" Then
        Call IQQQ展擎筛程至D3节按日层(WB, 表名, 谕组, 典码输出, 节色:=节色, 节签:=节签, 出节模式:=出节模式, 出全是否:=出全是否)
    ElseIf 出节模式 = "日机" Then
        Call IQQQ展擎筛程至D3节按日层(WB, 表名, 谕组, 典码输出, 节色:=节色, 节签:=节签, 出节模式:=出节模式, 出全是否:=出全是否)
    End If
'========================================================================================
End Function



'【已锁】20221222：不要进行修改
'【已锁】20230301：加入层类进行修改
'========================================================================================
'========================================================================================
'功能：按照出节模式输出到块
'模式：周全/周优/周机
'醍醐灌顶20230616：针对【周机】，要避免搜索普适条件，而要设定为成功率高的特殊情况，要少而准。
'========================================================================================
'========================================================================================
Function IQQQ展擎筛程至D2节按周层( _
          ByRef WB As Workbook _
        , ByVal 表名 As String _
        , ByRef 谕组 As Variant _
        , Optional ByRef 典码输出 As Dictionary _
        , Optional ByVal 节签 As String = "" _
        , Optional ByVal 节色 As Long = 常色十青 _
        , Optional ByVal 出节模式 As String = "周层" _
        , Optional ByVal 出全是否 As Boolean = True _
        ) As String
'========================================================================================
'声明变量
'========================================================================================
    Dim CIDL As String
    Dim 是否筛机 As Boolean
'========================================================================================
'定义典
'========================================================================================
    '------------------------------------------------------------------------------------
    Dim 典废单错误 As New Dictionary
    Dim 典周废单停牌 As New Dictionary
    '---------------------------------------------------
    Dim 典周层正主_汇震WJA劫 As New Dictionary
    Dim 典周层正主_汇头WJB劫 As New Dictionary
    Dim 典周层正主_破DJC As New Dictionary
    Dim 典周层正主_破DJB As New Dictionary
    Dim 典周层正主杂 As New Dictionary
    Dim 典周层正主根 As New Dictionary
    Dim 典周层正主栏 As New Dictionary
    Dim 典周层正主栅 As New Dictionary
    Dim 典周层正主枝贯 As New Dictionary
    Dim 典周层正主枝启 As New Dictionary
    Dim 典周层正主梯升a顶 As New Dictionary
    Dim 典周层正主梯升b〇 As New Dictionary
    Dim 典周层正主梯升余 As New Dictionary
    Dim 典周层正主梯交 As New Dictionary
    '-------------
    Dim 典周层正再_汇震WJA劫 As New Dictionary
    Dim 典周层正再_汇头WJB劫 As New Dictionary
    Dim 典周层正再杂 As New Dictionary
    Dim 典周层正再根 As New Dictionary
    Dim 典周层正再栏 As New Dictionary
    Dim 典周层正再栅 As New Dictionary
    Dim 典周层正再枝贯 As New Dictionary
    Dim 典周层正再枝启 As New Dictionary
    Dim 典周层正再梯升 As New Dictionary
    Dim 典周层正再梯升b〇 As New Dictionary
    Dim 典周层正再梯升余 As New Dictionary
    Dim 典周层正再梯交 As New Dictionary
    '-------------
    Dim 典周层正初_汇震WJA劫 As New Dictionary
    Dim 典周层正初_汇头WJB劫 As New Dictionary
    Dim 典周层正初杂 As New Dictionary
    Dim 典周层正初根 As New Dictionary
    Dim 典周层正初栏 As New Dictionary
    Dim 典周层正初栅 As New Dictionary
    Dim 典周层正初枝贯 As New Dictionary
    Dim 典周层正初枝启 As New Dictionary
    Dim 典周层正初梯升 As New Dictionary
    Dim 典周层正初梯交 As New Dictionary
    '-------------
    Dim 典周层正储梯 As New Dictionary
    Dim 典周层正储栏 As New Dictionary
    Dim 典周层正储栅 As New Dictionary
    Dim 典周层正储枝 As New Dictionary
    Dim 典周层正储根 As New Dictionary
    Dim 典周层正储杂 As New Dictionary
    '-------------
    Dim 典周层正破JB排跌 As New Dictionary
    Dim 典周层正破JB排人 As New Dictionary
    Dim 典周层正破JB排升 As New Dictionary
    '---------------------------------------------------
    Dim 典周层负主G触a As New Dictionary
    Dim 典周层负主G触b〇 As New Dictionary
    Dim 典周层负主G震〇 As New Dictionary
    Dim 典周层负主G震芽 As New Dictionary
    Dim 典周层负主G震篪 As New Dictionary
    Dim 典周层负初A触a As New Dictionary
    Dim 典周层负初A触b〇 As New Dictionary
    Dim 典周层负初A震〇 As New Dictionary
    Dim 典周层负初A震芽 As New Dictionary
    Dim 典周层负初A震篪 As New Dictionary
    '-------------
    Dim 典周层负A芽非头4b As New Dictionary
    Dim 典周层负A芽非头4v As New Dictionary
    Dim 典周层负A芽非头4w As New Dictionary
    '-------------
    Dim 典周层负B混 As New Dictionary
    Dim 典周层负C混 As New Dictionary
    Dim 典周层负D混 As New Dictionary
    '------------------------------------------------------------------------------------
    '【冲机】
    Dim 典周机触首 As New Dictionary
    Dim 典周机触升梯 As New Dictionary
    Dim 典周机触升尾跌孕 As New Dictionary
    Dim 典周机r雀升 As New Dictionary
    Dim 典周机特鼎 As New Dictionary
    Dim 典周机特踩 As New Dictionary
    Dim 典周机特升栅 As New Dictionary
    '------------------------------------------------------------------------------------
    '【周地型】
    Dim 典周地型_含4暂 As New Dictionary
    Dim 典周地型_含4蛀 As New Dictionary
    Dim 典周地型_含0 As New Dictionary
    Dim 典周地型_含1 As New Dictionary
    Dim 典周地型_含2 As New Dictionary
    Dim 典周地型_含3 As New Dictionary
    Dim 典周地型_余 As New Dictionary
    '------------------------------------------------------------------------------------
    '【周护型】
    Dim 典周护型_甲乙 As New Dictionary
    Dim 典周护型_丙 As New Dictionary
    Dim 典周护型_己 As New Dictionary
    Dim 典周护型_丁戊 As New Dictionary
'========================================================================================
'筛选：微观 以周为粒度进行柱类分析
'========================================================================================
    For Y = 1 To 典码输出.Count
        X = 典码输出.Items(Y - 1)
        CIDL = 谕组(X, 位qt代码)
        值月局 = 谕组(X, 位谕of周基月局)
        值周局 = 谕组(X, 位谕of周基周局)
'########################################################################################
        '================================================================================
        '按照【周护型】进行细分
        '================================================================================
        If 出节模式 = "周护" Then
            If UBCID是代码(CIDL) = False Then
            ElseIf 谕组(X, 位qt停牌) = "S" Then
                            典周废单停牌.Add Item:=X, Key:=CIDL
            Else
                '========================================================================
                If InStr(谕组(X, 位谕of周层护型), "甲") > 0 Or InStr(谕组(X, 位谕of周层护型), "乙") > 0 Then
                            典周护型_甲乙.Add Item:=X, Key:=CIDL
                ElseIf InStr(谕组(X, 位谕of周层护型), "丙") > 0 Then
                            典周护型_丙.Add Item:=X, Key:=CIDL
                ElseIf InStr(谕组(X, 位谕of周层护型), "己") > 0 Then
                            典周护型_己.Add Item:=X, Key:=CIDL
                Else
                            典周护型_丁戊.Add Item:=X, Key:=CIDL
                End If
                '========================================================================
            End If
        End If
        '================================================================================
'########################################################################################
        '================================================================================
        '按照【周地型】进行细分
        '================================================================================
        If 出节模式 = "周地" Then
            If UBCID是代码(CIDL) = False Then
            ElseIf 谕组(X, 位qt停牌) = "S" Then
                            典周废单停牌.Add Item:=X, Key:=CIDL
            Else
                '========================================================================
                If InStr(谕组(X, 位谕of周层波型), "_4暂") > 0 Then
                            典周地型_含4暂.Add Item:=X, Key:=CIDL
                ElseIf InStr(谕组(X, 位谕of周层波型), "_4蛀") > 0 Then
                            典周地型_含4蛀.Add Item:=X, Key:=CIDL
                ElseIf InStr(谕组(X, 位谕of周层波型), "_0") > 0 Then
                            典周地型_含0.Add Item:=X, Key:=CIDL
                ElseIf InStr(谕组(X, 位谕of周层波型), "_1") > 0 Then
                            典周地型_含1.Add Item:=X, Key:=CIDL
                ElseIf InStr(谕组(X, 位谕of周层波型), "_2") > 0 Then
                            典周地型_含2.Add Item:=X, Key:=CIDL
                ElseIf InStr(谕组(X, 位谕of周层波型), "_3") > 0 Then
                            典周地型_含3.Add Item:=X, Key:=CIDL
                Else
                            典周地型_余.Add Item:=X, Key:=CIDL
                End If
                '========================================================================
            End If
        End If
        '================================================================================
'########################################################################################
        '================================================================================
        '按照周层进行细分，核心是周横，周层只是附加。
        '================================================================================
        If 出节模式 = "周层" Then
        If UBCID是代码(CIDL) = False Then
        ElseIf 谕组(X, 位qt停牌) = "S" Then
                            典周废单停牌.Add Item:=X, Key:=CIDL
        '--------------------------------------------------------------------------------
        '【出全是否】不只输出DJC之上，而是按照周层范围进行筛选。如果需要仅保留DXZC>0，则利用日类进行筛选。
        '--------------------------------------------------------------------------------
        'ElseIf 出全是否 = False And 谕组(X, 位谕of日类BTZC) < 0 Then
                            '典废单错误.Add Item:=X, Key:=CIDL        '测试用
        '--------------------------------------------------------------------------------
        '单独列示：破
        '[破JB]仍然属于WXBC正，属于比较危险的中间状态，但未达到w4b空头开端。可以等待/w3h/w2I再入。
        '--------------------------------------------------------------------------------
        ElseIf 谕组(X, 位谕of周基周局) = "3w" Or 谕组(X, 位谕of周基周局) = "3v" Then
                        If InStr(谕组(X, 位谕of周层柱排), "跌.") > 0 Then
                                典周层正破JB排跌.Add Item:=X, Key:=CIDL
                        ElseIf InStr(谕组(X, 位谕of周层柱排), "升.") > 0 Then
                                典周层正破JB排升.Add Item:=X, Key:=CIDL
                        Else
                                典周层正破JB排人.Add Item:=X, Key:=CIDL
                        End If
        '--------------------------------------------------------------------------------
        '单独列示：储
        '注：在WJA之上凡是逆趋势（跌孕/跌吞/跌连）都是机会，需要甄别。
        '不要把[根]与[WJA之上]区分开来，而应该按照是否触顶进行分类
        '--------------------------------------------------------------------------------
        ElseIf InStr(谕组(X, 位谕of周层界), "储") > 0 Then
                        If InStr(谕组(X, 位谕of周层柱型), "梯") > 0 Then
                                典周层正储梯.Add Item:=X, Key:=CIDL
                        ElseIf InStr(谕组(X, 位谕of周层柱型), "栏") > 0 Then
                                典周层正储栏.Add Item:=X, Key:=CIDL
                        ElseIf InStr(谕组(X, 位谕of周层柱型), "栅") > 0 Then
                                典周层正储栅.Add Item:=X, Key:=CIDL
                        '----------------------------------------------------------------
                        ElseIf InStr(谕组(X, 位谕of周层柱型), "枝") > 0 Then
                                典周层正储枝.Add Item:=X, Key:=CIDL
                        ElseIf InStr(谕组(X, 位谕of周层柱型), "根") > 0 Then
                                典周层正储根.Add Item:=X, Key:=CIDL
                        Else
                                典周层正储杂.Add Item:=X, Key:=CIDL
                        End If
        '--------------------------------------------------------------------------------
        '正向：WJC之上
        '--------------------------------------------------------------------------------
        ElseIf 谕组(X, 位谕of周类BTZC) > 0 Then
                '------------------------------------------------------------------------
                '单独列示：再
                '------------------------------------------------------------------------
                If InStr(谕组(X, 位谕of周层界), "再") > 0 Then
                    If InStr(谕组(X, 位谕of周层波型), "龙") > 0 Then
                        '----------------------------------------------------------------
                        If InStr(谕组(X, 位谕of周层柱型), "根") > 0 Then
                                典周层正再根.Add Item:=X, Key:=CIDL
                        ElseIf InStr(谕组(X, 位谕of周层柱型), "杂") > 0 Then
                                典周层正再杂.Add Item:=X, Key:=CIDL
                        ElseIf InStr(谕组(X, 位谕of周层柱型), "枝") > 0 Then
                            If InStr(谕组(X, 位谕of周层柱型), "枝贯") > 0 Then
                                典周层正再枝贯.Add Item:=X, Key:=CIDL
                            Else
                                典周层正再枝启.Add Item:=X, Key:=CIDL
                            End If
                        ElseIf InStr(谕组(X, 位谕of周层柱型), "栅") > 0 Then
                                典周层正再栅.Add Item:=X, Key:=CIDL
                        '----------------------------------------------------------------
                        ElseIf InStr(谕组(X, 位谕of周层柱型), "梯") > 0 Then
                            '注20251002：先均线后顶型。体现【顶型】是【均线】的子集。
                            If InStr(谕组(X, 位谕of周层柱型), "梯交") > 0 Then
                                典周层正再梯交.Add Item:=X, Key:=CIDL
                            Else
                                典周层正再梯升.Add Item:=X, Key:=CIDL
                            End If
                        Else
                                典周层正再栏.Add Item:=X, Key:=CIDL
                        End If
                        '----------------------------------------------------------------
                    ElseIf InStr(谕组(X, 位谕of周层波型), "震正") > 0 Then
                                典周层正再_汇震WJA劫.Add Item:=X, Key:=CIDL   '包含：震正芽、震正根
                    '以下为经历WJB劫后始终未触顶
                    Else
                                典周层正再_汇头WJB劫.Add Item:=X, Key:=CIDL   '包含：震负芽（/W3h/W3u）头负芽（/W2I/W2i）头正芽
                    End If
                '------------------------------------------------------------------------
                '单独列示：初
                '------------------------------------------------------------------------
                ElseIf InStr(谕组(X, 位谕of周层界), "初") > 0 Then
                    If InStr(谕组(X, 位谕of周层波型), "龙") > 0 Then
                        '----------------------------------------------------------------
                        If InStr(谕组(X, 位谕of周层柱型), "根") > 0 Then
                                典周层正初根.Add Item:=X, Key:=CIDL
                        ElseIf InStr(谕组(X, 位谕of周层柱型), "杂") > 0 Then
                                典周层正初杂.Add Item:=X, Key:=CIDL
                        ElseIf InStr(谕组(X, 位谕of周层柱型), "枝") > 0 Then
                            If InStr(谕组(X, 位谕of周层柱型), "枝贯") > 0 Then
                                典周层正初枝贯.Add Item:=X, Key:=CIDL
                            Else
                                典周层正初枝启.Add Item:=X, Key:=CIDL
                            End If
                        ElseIf InStr(谕组(X, 位谕of周层柱型), "栅") > 0 Then
                                典周层正初栅.Add Item:=X, Key:=CIDL
                        '----------------------------------------------------------------
                        ElseIf InStr(谕组(X, 位谕of周层柱型), "梯") > 0 Then
                            If InStr(谕组(X, 位谕of周层柱型), "梯交") > 0 Then
                                典周层正初梯交.Add Item:=X, Key:=CIDL
                            Else
                                典周层正初梯升.Add Item:=X, Key:=CIDL
                            End If
                        Else
                                典周层正初栏.Add Item:=X, Key:=CIDL
                        End If
                        '----------------------------------------------------------------
                    ElseIf InStr(谕组(X, 位谕of周层波型), "震正") > 0 Then
                                典周层正初_汇震WJA劫.Add Item:=X, Key:=CIDL   '包含：震正芽、震正根
                    '以下为经历WJB劫后始终未触顶
                    Else
                                典周层正初_汇头WJB劫.Add Item:=X, Key:=CIDL   '包含：震负芽（/W3h/W3u）头负芽（/W2I/W2i）头正芽
                    End If
                '------------------------------------------------------------------------
                '单独列示：主
                '注20251011：【主】的周期不同于过渡期【储初再】。过渡期一般很短，且典型形态类似，要单独列示；而【主】可长可短，所以要对【主】进行更细致的分类。
                '       根据柱型分类，【根杂枝】均为与WJA相关，要把WXZA劫单独出来作为防止顶震的情况。
                '------------------------------------------------------------------------
                Else
                    If InStr(谕组(X, 位谕of周层波型), "龙") > 0 Then
                        '----------------------------------------------------------------
                        '【根杂枝】均为与WJA打交道，有下落如【杂根】，有围绕震荡如【枝】，要把他们与包含升连的主升情况分离。
                        '----------------------------------------------------------------
                        If InStr(谕组(X, 位谕of周层柱型), "根") > 0 Then
                                '为了突出【破WJA】不是趋势结束，应该将所有【破WJA】集中出来。包含：中C、中D、中E
                                典周层正主根.Add Item:=X, Key:=CIDL
                        ElseIf InStr(谕组(X, 位谕of周层柱型), "杂") > 0 Then
                                典周层正主杂.Add Item:=X, Key:=CIDL
                        ElseIf InStr(谕组(X, 位谕of周层柱型), "枝") > 0 Then
                            If InStr(谕组(X, 位谕of周层柱型), "枝贯") > 0 Then
                                典周层正主枝贯.Add Item:=X, Key:=CIDL
                            Else
                                典周层正主枝启.Add Item:=X, Key:=CIDL
                            End If
                        ElseIf InStr(谕组(X, 位谕of周层柱型), "栅") > 0 Then
                                典周层正主栅.Add Item:=X, Key:=CIDL
                        '----------------------------------------------------------------
                        '注20251011：日类下破均线DJC或DJB，只应包含主升情况中的预警，而不应对【根杂枝】等本就靠近DJC的情况进行警示。
                        '----------------------------------------------------------------
                        ElseIf 谕组(X, 位谕of日类BTZC) < 0 Then
                                典周层正主_破DJC.Add Item:=X, Key:=CIDL
                        ElseIf 谕组(X, 位谕of日类BTZB) < 0 Then
                                典周层正主_破DJB.Add Item:=X, Key:=CIDL
                        Else
                            If InStr(谕组(X, 位谕of周层柱型), "梯") > 0 Then
                                If InStr(谕组(X, 位谕of周层柱型), "梯交") > 0 Then
                                        典周层正主梯交.Add Item:=X, Key:=CIDL
                                Else
                                    If InStr(谕组(X, 位谕of周层界), "a顶") > 0 Then
                                        典周层正主梯升a顶.Add Item:=X, Key:=CIDL
                                    ElseIf InStr(谕组(X, 位谕of周层界), "b〇") > 0 Then
                                        典周层正主梯升b〇.Add Item:=X, Key:=CIDL
                                    Else
                                        典周层正主梯升余.Add Item:=X, Key:=CIDL
                                    End If
                                End If
                            Else
                                    典周层正主栏.Add Item:=X, Key:=CIDL
                            End If
                        End If
                        '----------------------------------------------------------------
                    ElseIf InStr(谕组(X, 位谕of周层波型), "震正") > 0 Then
                                典周层正主_汇震WJA劫.Add Item:=X, Key:=CIDL   '包含：震正芽、震正根
                    '以下为经历WJB劫后始终未触顶
                    Else
                                典周层正主_汇头WJB劫.Add Item:=X, Key:=CIDL   '包含：震负芽（/W3h/W3u）头负芽（/W2I/W2i）头正芽
                    End If
                End If
        '--------------------------------------------------------------------------------
        '负向：WJC之下
        '--------------------------------------------------------------------------------
        Else
                '------------------------------------------------------------------------
                '单独列示：/BA劫/CA劫/BZ劫
                '------------------------------------------------------------------------
                If InStr(谕组(X, 位谕of周层类合), 常枚层类D) > 0 Then
                            典周层负D混.Add Item:=X, Key:=CIDL
                ElseIf InStr(谕组(X, 位谕of周层类合), 常枚层类C) > 0 Then
                            典周层负C混.Add Item:=X, Key:=CIDL
                ElseIf InStr(谕组(X, 位谕of周层类合), 常枚层类B) > 0 Then
                            典周层负B混.Add Item:=X, Key:=CIDL
                '------------------------------------------------------------------------
                '专门处理：/BC劫
                '------------------------------------------------------------------------
                ElseIf InStr(谕组(X, 位谕of周层类合), 常枚层类A) > 0 Then
                        '----------------------------------------------------------------
                        If 谕组(X, 位谕of周基周局) = "4v" Then
                            典周层负A芽非头4v.Add Item:=X, Key:=CIDL
                        ElseIf 谕组(X, 位谕of周基周局) = "4w" Then
                            典周层负A芽非头4w.Add Item:=X, Key:=CIDL
                        '----------------------------------------------------------------
                        ElseIf 谕组(X, 位谕of周层界) = "_初Aa触" Then            '需要区分是否存在【震荡中a触】【中间是否多处未触顶】
                            典周层负初A触a.Add Item:=X, Key:=CIDL
                        ElseIf 谕组(X, 位谕of周层界) = "_初Ab触〇" Then
                            典周层负初A触b〇.Add Item:=X, Key:=CIDL
                        ElseIf 谕组(X, 位谕of周层界) = "_初Ac震〇" Then
                            典周层负初A震〇.Add Item:=X, Key:=CIDL
                        ElseIf 谕组(X, 位谕of周层界) = "_初Ad震芽" Then
                            典周层负初A震芽.Add Item:=X, Key:=CIDL
                        Else
                            典周层负初A震篪.Add Item:=X, Key:=CIDL
                        End If
                '------------------------------------------------------------------------
                '专门处理：/AZ劫/天劫（aAA）
                '------------------------------------------------------------------------
                ElseIf InStr(谕组(X, 位谕of周层类合), 常枚层类G) > 0 Then
                        '----------------------------------------------------------------
                        If 谕组(X, 位谕of周层界) = "_主Ga触" Then         '需要区分是否存在【震荡中a触】【中间是否多处未触顶】
                            典周层负主G触a.Add Item:=X, Key:=CIDL
                        ElseIf 谕组(X, 位谕of周层界) = "_主Gb触〇" Then
                            典周层负主G触b〇.Add Item:=X, Key:=CIDL
                        ElseIf 谕组(X, 位谕of周层界) = "_主Gc震〇" Then
                            典周层负主G震〇.Add Item:=X, Key:=CIDL
                        ElseIf 谕组(X, 位谕of周层界) = "_主Gd震芽" Then
                            典周层负主G震芽.Add Item:=X, Key:=CIDL
                        Else
                            典周层负主G震篪.Add Item:=X, Key:=CIDL
                        End If
                '------------------------------------------------------------------------
                Else
                                典废单错误.Add Item:=X, Key:=CIDL
                End If
                '------------------------------------------------------------------------
        End If
        End If
        '================================================================================
    Next
'========================================================================================
'输出：周层
'【展示顺序】（主：A5）=>（震：/ZA劫/ZB）=>（劫：/BA/CA劫）=>（初：BC运）=>（篪：ZA劫）=>（弃：/ZB）
'配色：正向（红绿橙黄）负向（蓝白灰）
'========================================================================================
    Dim 节缀 As String
    节缀 = ""
'----------------------------------------------------------------------------------------
If 出节模式 = "周层" Then
    '------------------------------------------------------------------------------------
    '【周正向】
    '醍醐灌顶20240414：如何控制【出全是否】，周类视角机会主要集中在：/G管/A管/G芽/A芽/6w/6v。其余可以忽略。另外，日类必须在DJC之上属于附加限制，待研究是否与【出全是否】同时使用。
    '------------------------------------------------------------------------------------
    '【入初】判断与WJC是否相交。【层AD】肯定相交；【层CB】可能相交，也可能不相交。只有与WJC相交才是进入点，其余仅作参考，不可以作为进入点。
    '【入再】劫。处于WJC丘，排除诱多尾部可以进入。根据WJA作为持仓线，因为WBTAB<0处于非正常运行区域（正常波动需要WBTAB>0从而以WJB作为围绕WJA波动的下限）
    '【B层震】因为WJB具有区分小管作用，从而ZB劫是承上启下的中间区。蕴含最大的机会，也包含大量诱多骗线。
    '------------------------------------------------------------------------------------
    '为何按触划分：因为只有触a（推动顶不断提高）才是【真正的上升】，其余情况即使有上升也是震荡，何况在非触情况更多的下跌。
    '排列顺序（20251010）：一定要把过渡区【储初再】放在【主】前面。
    '----------------------------------------------
    '按触划分：【主升触链】主要为/触a/触b
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色主靛, 典码输出:=典周层正主梯升a顶, 区签:="【周正主】梯升a顶", 区释:="梯")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色主靛, 典码输出:=典周层正主梯升b〇, 区签:="【周正主】梯升b〇", 区释:="梯")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色主靛, 典码输出:=典周层正主梯升余, 区签:="【周正主】梯升余", 区释:="梯")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六靛, 典码输出:=典周层正主梯交, 区签:="【周正主】梯交", 区释:="梯")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色八靛, 典码输出:=典周层正主枝启, 区签:="【周正主】枝启", 区释:="震荡区")
        '【震荡】回归WJA：WJA之上震荡
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色八靛, 典码输出:=典周层正主栏, 区签:="回落WJA.【周正主】栏", 区释:="WJA之上的震荡")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色十靛, 典码输出:=典周层正主_破DJB, 区签:="回落WJA.【周正主】日异常.破DJB", 区释:="WJA之上的震荡")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色十靛, 典码输出:=典周层正主_破DJC, 区签:="回落WJA.【周正主】日异常.破DJC", 区释:="WJA之上的震荡")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色八靛, 典码输出:=典周层正主栅, 区签:="回落WJA.【周正主】栅", 区释:="WJA之上的震荡")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色四靛, 典码输出:=典周层正主杂, 区签:="回落WJA.【周正主】杂", 区释:="WJA之上的震荡")
        '【震荡】贯穿WJA
        '【震荡】非常可能是出货阶段，从而失势（失去创新高能力）。
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色八靛, 典码输出:=典周层正主枝贯, 区签:="贯穿WJA.【周正主】枝贯", 区释:="震荡区")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色四靛, 典码输出:=典周层正主根, 区签:="贯穿WJA.【周正主】根", 区释:="震荡区")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色四灰, 典码输出:=典周层正主_汇震WJA劫, 区签:="【周正主】汇震WJA劫", 区释:="震荡区")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色四灰, 典码输出:=典周层正主_汇头WJB劫, 区签:="【周正主】汇头WJB劫", 区释:="震荡区")
    '----------------------------------------------
    '过渡区【再】
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色八紫, 典码输出:=典周层正再梯升, 区签:="【周正再】梯升", 区释:="梯")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色八紫, 典码输出:=典周层正再梯交, 区签:="【周正再】梯交", 区释:="梯")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六紫, 典码输出:=典周层正再枝启, 区签:="【周正再】枝启", 区释:="震荡区")
        '【震荡】回归WJA：WJA之上震荡
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色四紫, 典码输出:=典周层正再栏, 区签:="回落WJA.【周正再】栏", 区释:="WJA之上的震荡")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色四紫, 典码输出:=典周层正再栅, 区签:="回落WJA.【周正再】栅", 区释:="WJA之上的震荡")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色灰紫, 典码输出:=典周层正再杂, 区签:="回落WJA.【周正再】杂", 区释:="WJA之上的震荡")
        '【震荡】贯穿WJA
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六紫, 典码输出:=典周层正再枝贯, 区签:="贯穿WJA.【周正再】枝贯", 区释:="震荡区")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色灰紫, 典码输出:=典周层正再根, 区签:="贯穿WJA.【周正再】根", 区释:="震荡区")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色四灰, 典码输出:=典周层正再_汇震WJA劫, 区签:="【周正再】汇震WJA劫", 区释:="震荡区")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色四灰, 典码输出:=典周层正再_汇头WJB劫, 区签:="【周正再】汇头WJB劫", 区释:="震荡区")
    '----------------------------------------------
    '过渡区【初】
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色十绿, 典码输出:=典周层正初梯升, 区签:="【周正初】梯升", 区释:="梯")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六绿, 典码输出:=典周层正初梯交, 区签:="【周正初】梯交", 区释:="梯")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色八绿, 典码输出:=典周层正初枝启, 区签:="【周正初】枝启", 区释:="震荡区")
        '【震荡】回归WJA：WJA之上震荡
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色八绿, 典码输出:=典周层正初栏, 区签:="回落WJA.【周正初】栏", 区释:="WJA之上的震荡")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色八绿, 典码输出:=典周层正初栅, 区签:="回落WJA.【周正初】栅", 区释:="WJA之上的震荡")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色四绿, 典码输出:=典周层正初杂, 区签:="回落WJA.【周正初】杂", 区释:="WJA之上的震荡")
        '【震荡】贯穿WJA
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色八绿, 典码输出:=典周层正初枝贯, 区签:="贯穿WJA.【周正初】枝贯", 区释:="震荡区")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色四绿, 典码输出:=典周层正初根, 区签:="贯穿WJA.【周正初】根", 区释:="震荡区")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色四灰, 典码输出:=典周层正初_汇震WJA劫, 区签:="【周正初】汇震WJA劫", 区释:="震荡区")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色四灰, 典码输出:=典周层正初_汇头WJB劫, 区签:="【周正初】汇头WJB劫", 区释:="震荡区")
    '----------------------------------------------
    '过渡区【储】
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色43绿, 典码输出:=典周层正储梯, 区签:="【周正储】梯", 区释:="初始")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色43绿, 典码输出:=典周层正储栏, 区签:="回落WJA.【周正储】栏", 区释:="初始")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色43绿, 典码输出:=典周层正储栅, 区签:="回落WJA.【周正储】栅", 区释:="初始")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色43绿, 典码输出:=典周层正储杂, 区签:="回落WJA.【周正储】杂", 区释:="初始")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色43绿, 典码输出:=典周层正储枝, 区签:="贯穿WJA.【周正储】枝", 区释:="初始")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色43绿, 典码输出:=典周层正储根, 区签:="贯穿WJA.【周正储】根", 区释:="初始")
    '----------------------------------------------
    If 出全是否 = True Then
        '----------------------------------------------
        '【破】下破WJB，不属于周操作范围。注20250501
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色灰紫, 强列:=位谕of周层界, 强序:=xlAscending, 典码输出:=典周层正破JB排升, 区签:="破WJB【周正破】排升.勿主动进", 区释:="警惕捡漏")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色灰紫, 强列:=位谕of周层界, 强序:=xlAscending, 典码输出:=典周层正破JB排人, 区签:="破WJB【周正破】排人.勿主动进", 区释:="警惕捡漏")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色灰紫, 强列:=位谕of周层界, 强序:=xlAscending, 典码输出:=典周层正破JB排跌, 区签:="破WJB【周正破】排跌.勿主动进", 区释:="警惕捡漏")
        '----------------------------------------------
    End If
    '------------------------------------------------------------------------------------
    '【周负向】
    '------------------------------------------------------------------------------------
    If 出全是否 = True Then
       'Call IQQQ展擎出程至页(WB, 表名, 节色:=节色, 节签:=节缀 & "周层负")
        '----------------------------------------------
        '【入区域】：来自【弃区域】，向上进入【主区域】向下进入【弃区域】
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色八蓝, 典码输出:=典周层负D混, 区签:="__再察【周负D混】", 区释:="警惕诱多")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色八蓝, 典码输出:=典周层负C混, 区签:="__再察【周负C混】", 区释:="警惕诱多")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色八蓝, 典码输出:=典周层负B混, 区签:="__再察【周负B芽】", 区释:="震平")
        '----------------------------------------------
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色八灰, 典码输出:=典周层负A芽非头4v, 区签:="__储【周负A非】非4v", 区释:="警惕诱多")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色八灰, 典码输出:=典周层负A芽非头4w, 区签:="__储【周负A非】非4w", 区释:="警惕诱多")
        Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色四灰, 典码输出:=典周层负A芽非头4b, 区签:="__初【周负A非】非4b", 区释:="")
            Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六灰, 典码输出:=典周层负初A震篪, 区签:="持【周负初A】震篪", 区释:="")
            Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六灰, 典码输出:=典周层负初A震芽, 区签:="持【周负初A】震芽", 区释:="")
            Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六灰, 典码输出:=典周层负初A震〇, 区签:="持【周负初A】震〇", 区释:="")
            Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色四灰, 典码输出:=典周层负初A触b〇, 区签:="持【周负初A】触b〇", 区释:="")
            Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色四灰, 典码输出:=典周层负初A触a, 区签:="持【周负初A】触a", 区释:="")
        '----------------------------------------------
        '【周负层G】
            Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六灰, 典码输出:=典周层负主G震篪, 区签:="持【周负主G】震篪", 区释:="")
            Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六灰, 典码输出:=典周层负主G震芽, 区签:="持【周负主G】震芽", 区释:="")
            Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六灰, 典码输出:=典周层负主G震〇, 区签:="持【周负主G】震〇", 区释:="")
            Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色四灰, 典码输出:=典周层负主G触b〇, 区签:="持【周负主G】触b〇", 区释:="")
            Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色四灰, 典码输出:=典周层负主G触a, 区签:="持【周负主G】触a", 区释:="")
        '----------------------------------------------
    End If
    '------------------------------------------------------------------------------------
    '【废区域】
    '------------------------------------------------------------------------------------
    If 出全是否 = True Then
        If (典周废单停牌.Count > 0 Or 典废单错误.Count > 0) Then
            Call IQQQ展擎出程至页(WB, 表名, 节色:=节色, 节签:=节缀 & "【废部分】")
            Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色十红, 典码输出:=典周废单停牌, 区签:="【废】停牌", 区释:="")
            Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色十红, 典码输出:=典废单错误, 区签:="【废】错误", 区释:="")
        End If
    End If
    '------------------------------------------------------------------------------------
End If
'========================================================================================
'按【周护】
'========================================================================================
If 出节模式 = "周护" Then
    '--------------------------------------------------------------------------------
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色主靛, 典码输出:=典周护型_甲乙, 区签:="【周护型】甲乙", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六靛, 典码输出:=典周护型_己, 区签:="【周护型】己", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六靛, 典码输出:=典周护型_丙, 区签:="【周护型】丙", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六青, 典码输出:=典周护型_丁戊, 区签:="【周护型】丁戊", 区释:="")
    '--------------------------------------------------------------------------------
End If
'========================================================================================
'按【周地】
'========================================================================================
If 出节模式 = "周地" Then
    '--------------------------------------------------------------------------------
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色主靛, 典码输出:=典周地型_含0, 区签:="【周地型】含0无", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六靛, 典码输出:=典周地型_含1, 区签:="【周地型】含1栏", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六靛, 典码输出:=典周地型_含2, 区签:="【周地型】含2栅", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六青, 典码输出:=典周地型_含3, 区签:="【周地型】含3杂", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六青, 典码输出:=典周地型_含4暂, 区签:="【周地型】含4暂", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六青, 典码输出:=典周地型_含4蛀, 区签:="【周地型】含4蛀", 区释:="")
    Call IQQQ展擎出程至页(WB, 表名, 谕组, 区色:=常色六黄, 典码输出:=典周地型_余, 区签:="【周地型】出现错误分类", 区释:="")
    '--------------------------------------------------------------------------------
End If
'========================================================================================
'输出：周机
        '精分周类：基于周类开口饭机会的投资策略
        '核心理念：(领悟@20210808)这是一场由周类均线JZ、JA、JC、JE参与的游戏。
        '       当JC小于JE时，是由JZ\JA\JC参与的“小游戏”，即使JZ突破JE，也依然是小游戏；
        '       当JC大于JD后，“小游戏”向“大游戏”继续迈进。
        '       当JC突破JE后，“大游戏”模式正式开启；
        '       当JZ下破JD时，“大游戏”暂停。
        '       综上，《周类1b》是至关重要的状态，部分《周类2i》也十分重要，《周类1w》适当参与。
        '筛选原则：仅仅从周类形态出发进行筛选，基于周类均线JZ、JA、JC、JE进行过滤与筛选。
        '条件要求：
        '（2）上周WBSPA不要过大
        '（3）上周最高点不要过大，不要是上影线或十字星
        '（4）不要连续上涨，可以是连续小阳线，最根本还是不要涨幅太大
        '（5）日线走势符合要求，最低要求为I，最好为D【鼎】
'========================================================================================
'返回
'========================================================================================
    IQQQ展擎筛程至D2节按周层 = MSG
'========================================================================================
End Function
'########################################################################################
'########################################################################################
'#####################################   QQQ  筛程至节   ################################
'########################################################################################
'########################################################################################











'========================================================================================
'注意：【表名输出】（工表的名字）不能是数字类型
'========================================================================================
Function IQQQ展擎出程至页( _
          ByRef WB As Workbook _
        , ByVal 表名输出 As String _
        , Optional ByRef 谕组 As Variant _
        , Optional ByRef 典码输出 As Dictionary _
        , Optional ByVal 区签 As String = "" _
        , Optional ByVal 区色 As Long = 常色主绿 _
        , Optional ByVal 区释 As String = "" _
        , Optional ByVal 区隐 As Boolean = False _
        , Optional ByVal 强列 As Integer = 0 _
        , Optional ByVal 强序 As XlSortOrder = xlDescending _
        , Optional ByVal 节签 As String = "" _
        , Optional ByVal 节色 As Long = 常色主白 _
        , Optional ByVal 节景 As Long = 常色主黑 _
        , Optional ByVal 章签 As String = "" _
        , Optional ByVal 章色 As Long = 常色主绿 _
        , Optional ByVal 是否建表 As Boolean = False _
        , Optional ByVal 神谕归类 As Integer = 0 _
        ) As String
'========================================================================================
'准备工作
'========================================================================================
    '------------------------------------------------------------------------------------
    '建页
    '------------------------------------------------------------------------------------
    Dim WSTO As Worksheet
    If 是否建表 = True Or UTL判断工表存在(表名输出, WB) = False Then
        Call PBASE格程工具_表操工表新增(WSTO, 表名输出, WB:=WB, 基色底:=章色)
        Call IQQQ跨码展擎_按列汇总(WSTO, 基色底:=章色)
    End If
    Set WSTO = WB.Sheets(表名输出)
    Dim 末行 As Integer
    末行 = PBASE格程工具_表参末行指定(WSTO, 1)
    '------------------------------------------------------------------------------------
    '标记：章签
    '------------------------------------------------------------------------------------
    If Len(章签) > 0 Then
        With WSTO.Rows(末行 + 1)
            With .Cells(1, 1).Resize(1, 位谕列终全部)
                .RowHeight = 50
                .Font.Size = 20
                .Font.Color = 常色主黑
                .Interior.Color = 常色主白
                .VerticalAlignment = xlCenter
                .HorizontalAlignment = xlLeft
                .Font.Bold = True
                .Borders(xlInsideVertical).LineStyle = xlNone
                .Borders(xlEdgeTop).Color = 常色四灰
                .Borders(xlEdgeTop).Weight = xlThin
            End With
            .Cells(1, 常列标签类别).Value = ">"
            .Cells(1, 常列标签注释).Value = ">" & 章签
            .Cells(1, 常列标签注释).Font.Color = 章色
        End With
        末行 = 末行 + 1
    End If
    '------------------------------------------------------------------------------------
    '标记：节签
    '------------------------------------------------------------------------------------
    If Len(节签) > 0 Then
        With WSTO.Rows(末行 + 1)
            With .Cells(1, 1).Resize(1, 位谕列终全部)
                .RowHeight = 40
                .Font.Size = 20
                .Interior.Color = 节景
                .VerticalAlignment = xlCenter
                .HorizontalAlignment = xlLeft
                .Font.Bold = True
                .Borders(xlInsideVertical).LineStyle = xlNone
                .Borders(xlEdgeTop).Color = 常色二灰
                .Borders(xlEdgeTop).Weight = xlThin
            End With
            .Cells(1, 常列标签类别).Value = ">"
            .Cells(1, 常列标签注释).Value = ">" & 节签
            .Cells(1, 常列标签注释).Font.Color = 节色
        End With
        末行 = 末行 + 1
    End If
'========================================================================================
'验证
'========================================================================================
    If VBA.IsMissing(谕组) = True Then Exit Function
    If VBA.IsEmpty(谕组) = True Then Exit Function
    '------------------------------------------------------------------------------------
    If 典码输出 Is Nothing Then
        Exit Function
    ElseIf 典码输出.Count = 0 Then
        Exit Function
    End If
    Dim 计数输出 As Integer
    计数输出 = 典码输出.Count
'========================================================================================
'输出：标签
'========================================================================================
    Dim 行号标签 As Integer
    行号标签 = 末行 + 1
    Dim 行号数始 As Integer
    行号数始 = 末行 + 2
    '------------------------------------------------------------------------------------
    '标签
    '------------------------------------------------------------------------------------
            With WSTO.Rows(行号标签)
                With .Cells(1, 1).Resize(1, 位谕列终全部)
                    .RowHeight = 20
                    .Font.Size = 12
                    .Font.Color = 常色主黑
                    .Interior.Color = 常色一灰
                    .Borders(xlInsideVertical).LineStyle = xlNone
        '            .Borders(xlEdgeTop).Color = 常色四灰
        '            .Borders(xlEdgeTop).Weight = xlThin
                    .VerticalAlignment = xlCenter
                    .HorizontalAlignment = xlLeft
                    .Font.Bold = True
                    '.Font.Italic = True
                End With
                .Cells(1, 常列标签类别) = ">" & 区签
                .Cells(1, 常列标签类别).Font.Color = 区色
                .Cells(1, 常列标签计数) = 计数输出 & "只"
                .Cells(1, 常列标签计数).HorizontalAlignment = xlLeft
                .Cells(1, 常列标签计数).Font.Color = 常色二灰
                .Cells(1, 常列标签注释) = 区释
                .Cells(1, 常列标签注释).Font.Color = 常色二灰
            End With
            WSTO.Rows(行号标签).Hidden = 区隐
'========================================================================================
'输出：数据
'========================================================================================
    ReDim ARRTO(1 To 计数输出, LBound(谕组, 2) To UBound(谕组, 2)) As Variant
    '------------------------------------------------------------------------------------
    '准备数据
    '------------------------------------------------------------------------------------
    Dim 定位原序 As Integer
    Dim Y As Integer
    For X = 1 To 典码输出.Count
        定位原序 = 典码输出.Items(X - 1)
        For Y = LBound(谕组, 2) To UBound(谕组, 2)
            ARRTO(X, Y) = 谕组(定位原序, Y)
        Next Y
    Next X
    典码输出.RemoveAll
    Set 典码输出 = Nothing
    '------------------------------------------------------------------------------------
    '输出
    '------------------------------------------------------------------------------------
    Dim 区域数据 As Range
    Set 区域数据 = WSTO.Rows(行号数始).Resize(计数输出, 位谕列终全部)
    区域数据 = ARRTO
    Erase ARRTO
    'Call UTL数据转换_集ARR2WS(ARRTO, WSTO, 行号数始)
'========================================================================================
'格式化
'========================================================================================
    '------------------------------------------------------------------------------------
    '格式化：数据
    '------------------------------------------------------------------------------------
    With WSTO.Cells(行号数始, 1)
        With .Resize(计数输出, 位qt主宽)
            .Interior.Color = 区色
            .Interior.TintAndShade = 0.8
        End With
        With .Cells(1, 位qt代称).Resize(计数输出, 1)
            .Interior.TintAndShade = 0
        End With
    End With
    '------------------------------------------------------------------------------------
    '排序：基本排序
    '------------------------------------------------------------------------------------
    With 区域数据
            .Sort key1:=.Cells(1, 位谕of周层三鳄), order1:=xlAscending, _
                  key2:=.Cells(1, 位谕of周层护型), order2:=xlAscending, _
                  key3:=.Cells(1, 位谕of日层护型), order3:=xlAscending, _
                  Header:=xlNo
        If 强列 <> 0 Then .Sort key1:=.Cells(1, 强列), order1:=强序, Header:=xlNo
    End With
    Set 区域数据 = Nothing
    '------------------------------------------------------------------------------------
    '格式化：归类
    '------------------------------------------------------------------------------------
'    If 神谕归类 <> 0 Then
'        Select Case 神谕归类
'        Case 位谕of周基乾局
'        Case 位谕of日基乾局
'        Case 位谕of日基坤局
'        End Select
'    End If
    '------------------------------------------------------------------------------------
    '格式化：按行校验
    '------------------------------------------------------------------------------------
    Call IQQQ跨码展擎_按行汇总(WSTO, 基行:=行号数始)
'========================================================================================
'返回
'========================================================================================
    Set WSTO = Nothing
    Dim MSG As String
    MSG = ">" & 表名输出 & " " & 区签 & "：" & 计数输出 & vbCrLf
    '标准返回格式：以>开始，以换行结束
    IQQQ展擎出程至页 = MSG
'========================================================================================
End Function
'########################################################################################
'########################################################################################
'#####################################   QQQ  筛选输出   ################################
'########################################################################################
'########################################################################################




'########################################################################################
'########################################################################################
'#####################################   QQQ  废弃代码   ################################
'########################################################################################
'########################################################################################



'########################################################################################
'########################################################################################
'#####################################   QQQ  废弃代码   ################################
'########################################################################################
'########################################################################################

