Attribute VB_Name = "MH历研_A2统时引擎"
'【历研范围】历研统时主要研究：股性、涨停。
'========================================================================================
Public Const 位统时列总始 = 1
'-------------------------------------
Public Const 位统时列CIDL = 位统时列总始 + 0
Public Const 位统时列代称 = 位统时列总始 + 1
'-------------------------------------
Public Const 位统时列波始 = 位统时列总始 + 2
Public Const 位统时列BTHR0 = 位统时列波始 + 0
Public Const 位统时列BTHR1 = 位统时列波始 + 1
Public Const 位统时列BTHR3 = 位统时列波始 + 2
Public Const 位统时列BTHR9 = 位统时列波始 + 3
Public Const 位统时列今幅低 = 位统时列波始 + 4
Public Const 位统时列今幅涨 = 位统时列波始 + 5
Public Const 位统时列今幅高 = 位统时列波始 + 6
Public Const 位统时列波终 = 位统时列波始 + 6
'-------------------------------------
Public Const 位统时列停五符 = 位统时列波始 + 7
'-------------------------------------
Public Const 位统时列十始 = 位统时列波始 + 8
Public Const 位统时列十停数涨 = 位统时列十始 + 0
Public Const 位统时列十停数高 = 位统时列十始 + 1
Public Const 位统时列十停数跌 = 位统时列十始 + 2
Public Const 位统时列十停数低 = 位统时列十始 + 3
Public Const 位统时列十高小比 = 位统时列十始 + 4
Public Const 位统时列十均幅高 = 位统时列十始 + 5
Public Const 位统时列十均幅涨 = 位统时列十始 + 6
Public Const 位统时列十均幅低 = 位统时列十始 + 7
Public Const 位统时列十重心正比 = 位统时列十始 + 8
Public Const 位统时列十计数 = 位统时列十始 + 9
'-------------------------------------
Public Const 位统时列仨始 = 位统时列十计数 + 1
Public Const 位统时列仨停数涨 = 位统时列仨始 + 0
Public Const 位统时列仨停数高 = 位统时列仨始 + 1
Public Const 位统时列仨停数跌 = 位统时列仨始 + 2
Public Const 位统时列仨停数低 = 位统时列仨始 + 3
Public Const 位统时列仨高小比 = 位统时列仨始 + 4
Public Const 位统时列仨均幅高 = 位统时列仨始 + 5
Public Const 位统时列仨均幅涨 = 位统时列仨始 + 6
Public Const 位统时列仨均幅低 = 位统时列仨始 + 7
Public Const 位统时列仨重心正比 = 位统时列仨始 + 8
Public Const 位统时列仨底龄 = 位统时列仨始 + 9
Public Const 位统时列仨底价 = 位统时列仨始 + 10
Public Const 位统时列仨底幅 = 位统时列仨始 + 11
Public Const 位统时列仨顶龄 = 位统时列仨始 + 12
Public Const 位统时列仨顶价 = 位统时列仨始 + 13
Public Const 位统时列仨顶幅 = 位统时列仨始 + 14
Public Const 位统时列仨计数 = 位统时列仨始 + 15
'-------------------------------------
Public Const 位统时列佰始 = 位统时列仨计数 + 1
Public Const 位统时列佰停数涨 = 位统时列佰始 + 0
Public Const 位统时列佰停数高 = 位统时列佰始 + 1
Public Const 位统时列佰停数跌 = 位统时列佰始 + 2
Public Const 位统时列佰停数低 = 位统时列佰始 + 3
Public Const 位统时列佰高小比 = 位统时列佰始 + 4
Public Const 位统时列佰均幅高 = 位统时列佰始 + 5
Public Const 位统时列佰均幅涨 = 位统时列佰始 + 6
Public Const 位统时列佰均幅低 = 位统时列佰始 + 7
Public Const 位统时列佰重心正比 = 位统时列佰始 + 8
Public Const 位统时列佰底龄 = 位统时列佰始 + 9
Public Const 位统时列佰底价 = 位统时列佰始 + 10
Public Const 位统时列佰底幅 = 位统时列佰始 + 11
Public Const 位统时列佰顶龄 = 位统时列佰始 + 12
Public Const 位统时列佰顶价 = 位统时列佰始 + 13
Public Const 位统时列佰顶幅 = 位统时列佰始 + 14
Public Const 位统时列佰计数 = 位统时列佰始 + 15
'-------------------------------------
'-------------------------------------
Public Const 位统时列股性 = 位统时列佰计数 + 1
Public Const 位统时列停牌 = 位统时列佰计数 + 2
Public Const 位统时列交额 = 位统时列佰计数 + 3
Public Const 位统时列市值 = 位统时列佰计数 + 4
Public Const 位统时列结期 = 位统时列佰计数 + 5
'-------------------------------------
Public Const 位统时列总终 = 位统时列佰计数 + 5
'========================================================================================



'待完成：一个是按照代码遍历，统计每个代码涨停数，平均涨幅，就是结算引擎的那些；
'一个是按照日期遍历，统计总交易数，每个涨幅幅度的个数，平均涨幅，涨幅中位数，涨停数


Sub 测试2_历调引擎_4指基()
'========================================================================================
'制作字典
'========================================================================================
    '------------------------------------------------------------------------------------
    '读取花册
    '------------------------------------------------------------------------------------
    Dim WS花册 As Worksheet
    If STBASE外簿工具_花册链接(WS花册, 常花中股) = False Then Exit Sub
    Dim 组花册 As Variant
    Call UTL数据转换_集WS2ARR(组花册, WS花册, 始行:=2, 始列:=1, 总列:=花宽主道)
    '------------------------------------------------------------------------------------
    '制作字典
    '------------------------------------------------------------------------------------
    Dim 典码花册指 As New Dictionary
    Dim 典码花册基 As New Dictionary
    Dim X As Integer
    For X = LBound(组花册, 1) To UBound(组花册, 1)
        CIDL = 组花册(X, 位列花天CIDL)
        代称 = 组花册(X, 位列花天代称)
        If UBCID是中股指(CIDL) = True Then
            典码花册指.Add Key:=CIDL, Item:=代称
        ElseIf UBCID是中股基(CIDL) = True Then
            典码花册基.Add Key:=CIDL, Item:=代称
        End If
'        If 典码花册指.Count > 20 Then Exit For
        If 典码花册基.Count > 20 Then Exit For
        Debug.Print X, CIDL
    Next
    Debug.Print "X, CIDL", 典码花册基.Count
    Stop
'========================================================================================
'输出
'========================================================================================
    Dim 表名输出 As String
'    表名输出 = "HHH72"
'    Call 历研统码引擎1主程(表名输出, 典码花册指, 期类)
'    表名输出 = "ZHHH73"
'    Call 历研统时引擎1主程(表名输出, 典码花册指, 是否输出分表:=False)
    '------------------------------------------------------------------------------------
'    表名输出 = "HHH82"
'    Call 历研统码引擎1主程(表名输出, 典码花册指, 期类)
'    表名输出 = "ZHHH83"
'    Dim 是否输出分表 As Boolean
'    Dim 是否输出涨停 As Boolean
'    是否输出分表 = True
'    是否输出涨停 = False
'    Call 历研统时引擎1主程(表名输出, 典码花册基, 是否输出分表:=是否输出分表, 是否输出涨停:=是否输出涨停)
    '------------------------------------------------------------------------------------
End Sub


Sub 测试2_历调引擎_4股票()
'========================================================================================
'制作字典
'========================================================================================
    Debug.Print "x"
    Dim 典码称 As New Dictionary
    Call STCALL花册工具_提取典码花天按市池(典码称, 包含市指:=True, 包含市基:=False, 包含市票:=False, 测试限数:=-1)
    Stop
'========================================================================================
'输出
'========================================================================================
    Dim 表名输出 As String
''    表名输出 = "ZHHH62"
''    Call 历研统码引擎1主程(表名输出, 典码称, 期类, 显否马赛克:=False)
'    表名输出 = "..ZT"
'    Dim 是否输出分表 As Boolean
'    Dim 是否输出涨停 As Boolean
'    是否输出分表 = True
'    是否输出涨停 = False
'    Call 历研统时引擎1主程(表名输出, 典码称, 是否输出分表:=是否输出分表, 是否输出涨停:=是否输出涨停, 是否更新源TR:=True)
'========================================================================================
End Sub















'########################################################################################
'########################################################################################
'###################################   历研统时引擎   ####################################
'########################################################################################
'########################################################################################
'========================================================================================
'========================================================================================
'功能：统计跨时
'========================================================================================
'========================================================================================
Function 历研统时引擎1主程( _
          表名输出 As String _
        , 典码称 As Dictionary _
        , Optional ByVal 指定期类 As String = 常期类为日 _
        , Optional ByVal 指定结期上限 As Date = 常结期上限市场 _
        , Optional ByVal 指定结期下限 As Date = 常结期下限历短 _
        , Optional ByVal 是否更新源TR As Boolean = False _
        , Optional ByVal 始行 As Integer = 1 _
        , Optional ByVal 始列 As Integer = 1 _
        , Optional ByVal 是否输出分表 As Boolean = False _
        , Optional ByVal 是否输出涨停 As Boolean = False _
        , Optional 基色底 As Long = 常色四青 _
        )
    '====================================================================================
    '生成数据
    '====================================================================================
    Dim 组历统时 As Variant
    Call 历研统时引擎2数程(组历统时, 典码称, 指定期类, 指定结期上限:=指定结期上限, 指定结期下限:=指定结期下限, 是否更新源TR:=是否更新源TR)
    '====================================================================================
    '测试：输出全部
    '====================================================================================
    Dim WSTO As Worksheet
    Call PBASE格程工具_表操工表新增(WSTO, 表名输出, 基色底:=基色底)
    WSTO.Cells.Font.Size = 9
    Call PBASE格程工具_表冻结锁定(WSTO, 1, 2)
    Call 历研统时引擎5格程按列(WSTO, 始列:=1) '注20230730：一定要将格式化放在输出前面，否则会导致【位统时列结期】格式不正确。
    Call UTL数据转换_集ARR2WS(组历统时, WSTO, 2, 1)
    '====================================================================================
    '筛选
    '====================================================================================
    If 是否输出分表 = True Then
        Call 历研统时引擎3统程分布(表名输出, 组历统时)
    End If
    If 是否输出涨停 = True Then
        Call 历研统时引擎3统程涨停(表名输出, 组历统时)
    End If
    '====================================================================================
End Function
Function 历研统时引擎2数程( _
          组历统时 As Variant _
        , 典码称 As Dictionary _
        , Optional 指定期类 As String = 常期类为日 _
        , Optional ByVal 指定结期上限 As Date = 常结期上限市场 _
        , Optional ByVal 指定结期下限 As Date = 常结期下限历短 _
        , Optional ByVal 是否更新源TR As Boolean = False _
        )
    '====================================================================================
    If 典码称 Is Nothing Then Exit Function
    If 典码称.Count = 0 Then Exit Function
    '====================================================================================
    '准备数据
    '====================================================================================
    Dim 矩历码期值 As Variant
    Call 历研数据引擎_基础数据准备(矩历码期值, 典码称, 指定期类, 指定结期上限:=指定结期上限, 指定结期下限:=指定结期下限, 是否更新源TR:=是否更新源TR)
    '====================================================================================
    Dim CIDL As String
    Dim 值幅涨 As Double, 值幅高 As Double, 值幅低 As Double
    Dim 值幅下限 As Double, 值幅上限 As Double
    '------------------------------------------------------------------------------------
    ReDim 组历统时(1 To UBound(矩历码期值, 1), 位统时列总始 To 位统时列总终) As Variant
    '====================================================================================
    '批量查询腾实（逐股HTTP → 一次批量，复用 UBHTTP腾实_查回典批量）
    '====================================================================================
    Dim 代码串 As String
    Dim vKeyQ As Variant
    For Each vKeyQ In 典码称.Keys
        代码串 = 代码串 & vKeyQ & ","
    Next
    Dim 典腾实 As Dictionary
    If Len(代码串) > 1 Then
        Set 典腾实 = UBHTTP腾实_查回典批量(Left(代码串, Len(代码串) - 1))
    Else
        Set 典腾实 = New Dictionary
    End If
    '====================================================================================
    '统计数据
    '====================================================================================
    Dim X As Integer, Y As Integer
    For X = 1 To UBound(矩历码期值, 1) '按码
    CIDL = 矩历码期值(X, 位矩历二维下限, 位矩历三维价收)    '从-1获取CIDL
    值代称 = 矩历码期值(X, 位矩历二维下限, 位矩历三维幅涨)     '从1获取代称
    If UBCID是代码(CIDL) = True Then
            '============================================================================
            '基本信息
            '============================================================================
            组历统时(X, 位统时列CIDL) = CIDL
            组历统时(X, 位统时列代称) = 矩历码期值(X, 位矩历二维下限, 位矩历三维幅涨)
            组历统时(X, 位统时列结期) = 矩历码期值(位矩历一维下限, 1, 位矩历三维幅涨)
            组历统时(X, 位统时列今幅涨) = 矩历码期值(X, 1, 位矩历三维幅涨)
            组历统时(X, 位统时列今幅高) = 矩历码期值(X, 1, 位矩历三维幅高)
            组历统时(X, 位统时列今幅低) = 矩历码期值(X, 1, 位矩历三维幅低)
            If VBA.IsNumeric(矩历码期值(X, 1, 1)) = False Then 组历统时(X, 位统时列停牌) = "S"
            '============================================================================
            '确定 幅度限度
            '============================================================================
            If UBCID是中股票(CIDL) Then
                    值幅下限 = 1.5
                    值幅上限 = 3
            ElseIf UBCID是中股指(CIDL) Or UBCID是中股基(CIDL) Then
                    值幅下限 = 1
                    值幅上限 = 2
            End If
            '============================================================================
            '查询腾实获取信息（批量HTTP，字典取值）
            '============================================================================
            If 典腾实.Exists(CIDL) Then
                Dim aRESP As Variant
                aRESP = 典腾实(CIDL)
                组历统时(X, 位统时列交额) = Round(aRESP(位序腾实交额) / 10000, 2)
                If Len(aRESP(位序腾实总市)) > 0 Then 组历统时(X, 位统时列市值) = Round(aRESP(位序腾实总市), 1)
            End If
            '============================================================================
            '正向遍历统计：短期指标
            '待完成替换：放入神谕生成/放入OS结算
            '============================================================================
            For Y = UBound(矩历码期值, 2) To 1 Step -1   '按日
            If VBA.IsNumeric(矩历码期值(X, Y, 位矩历三维幅涨)) = True Then
                        '================================================================
                        '统计幅
                        '================================================================
                        值幅涨 = 矩历码期值(X, Y, 位矩历三维幅涨)
                        值幅高 = 矩历码期值(X, Y, 位矩历三维幅高)
                        值幅低 = 矩历码期值(X, Y, 位矩历三维幅低)
                        '----------------------------------------------------------------
                        '统计：累时 【已放入OS】
                        '----------------------------------------------------------------
                        组历统时(X, 位统时列BTHR9) = STBASE结算工具_衍生交叉天数(组历统时(X, 位统时列BTHR9), 值幅高, 9)
                        组历统时(X, 位统时列BTHR3) = STBASE结算工具_衍生交叉天数(组历统时(X, 位统时列BTHR3), 值幅高, 3)
                        组历统时(X, 位统时列BTHR1) = STBASE结算工具_衍生交叉天数(组历统时(X, 位统时列BTHR1), 值幅高, 1.5)
                        组历统时(X, 位统时列BTHR0) = STBASE结算工具_衍生交叉天数(组历统时(X, 位统时列BTHR0), 值幅高, 0)
                        '----------------------------------------------------------------
                        '统计：停五符 【已放入神谕】
                        '----------------------------------------------------------------
                        If Y = 1 Then 组历统时(X, 位统时列停五符) = 组历统时(X, 位统时列停五符) + 1000000000 * IIf(值幅高 > 9, 1, 0)
                        If Y = 1 Then 组历统时(X, 位统时列停五符) = 组历统时(X, 位统时列停五符) + 100000000 * IIf(值幅涨 > 9, 1, 0)
                        If Y = 2 Then 组历统时(X, 位统时列停五符) = 组历统时(X, 位统时列停五符) + 10000000 * IIf(值幅高 > 9, 1, 0)
                        If Y = 2 Then 组历统时(X, 位统时列停五符) = 组历统时(X, 位统时列停五符) + 1000000 * IIf(值幅涨 > 9, 1, 0)
                        If Y = 3 Then 组历统时(X, 位统时列停五符) = 组历统时(X, 位统时列停五符) + 100000 * IIf(值幅高 > 9, 1, 0)
                        If Y = 3 Then 组历统时(X, 位统时列停五符) = 组历统时(X, 位统时列停五符) + 10000 * IIf(值幅涨 > 9, 1, 0)
                        If Y = 4 Then 组历统时(X, 位统时列停五符) = 组历统时(X, 位统时列停五符) + 1000 * IIf(值幅高 > 9, 1, 0)
                        If Y = 4 Then 组历统时(X, 位统时列停五符) = 组历统时(X, 位统时列停五符) + 100 * IIf(值幅涨 > 9, 1, 0)
                        If Y = 5 Then 组历统时(X, 位统时列停五符) = 组历统时(X, 位统时列停五符) + 10 * IIf(值幅高 > 9, 1, 0)
                        If Y = 5 Then 组历统时(X, 位统时列停五符) = 组历统时(X, 位统时列停五符) + 1 * IIf(值幅涨 > 9, 1, 0)
                        '----------------------------------------------------------------
                        '统计：各区间属性
                        '----------------------------------------------------------------
                        If Y <= 10 Then
                            组历统时(X, 位统时列十停数涨) = 组历统时(X, 位统时列十停数涨) + IIf(值幅涨 > 9, 1, 0)
                            组历统时(X, 位统时列十停数高) = 组历统时(X, 位统时列十停数高) + IIf(值幅高 > 9, 1, 0)
                            组历统时(X, 位统时列十停数跌) = 组历统时(X, 位统时列十停数跌) + IIf(值幅涨 < -9, 1, 0)
                            组历统时(X, 位统时列十停数低) = 组历统时(X, 位统时列十停数低) + IIf(值幅低 < -9, 1, 0)
                            组历统时(X, 位统时列十均幅涨) = 组历统时(X, 位统时列十均幅涨) + 值幅涨
                            组历统时(X, 位统时列十均幅高) = 组历统时(X, 位统时列十均幅高) + 值幅高
                            组历统时(X, 位统时列十均幅低) = 组历统时(X, 位统时列十均幅低) + 值幅低
                            组历统时(X, 位统时列十高小比) = 组历统时(X, 位统时列十高小比) + IIf(值幅高 < 值幅下限, 1, 0)
                            组历统时(X, 位统时列十重心正比) = 组历统时(X, 位统时列十重心正比) + IIf(值幅高 + 值幅低 >= 0, 1, 0)
                            组历统时(X, 位统时列十计数) = 组历统时(X, 位统时列十计数) + 1
                        End If
                        '================================================================
            End If
            Next
            If 组历统时(X, 位统时列十计数) > 0 Then
                    组历统时(X, 位统时列十均幅涨) = Round(组历统时(X, 位统时列十均幅涨) / 组历统时(X, 位统时列十计数), 1)
                    组历统时(X, 位统时列十均幅高) = Round(组历统时(X, 位统时列十均幅高) / 组历统时(X, 位统时列十计数), 1)
                    组历统时(X, 位统时列十均幅低) = Round(组历统时(X, 位统时列十均幅低) / 组历统时(X, 位统时列十计数), 1)
                    组历统时(X, 位统时列十高小比) = Round(组历统时(X, 位统时列十高小比) / 组历统时(X, 位统时列十计数), 2)
                    组历统时(X, 位统时列十重心正比) = Round(组历统时(X, 位统时列十重心正比) / 组历统时(X, 位统时列十计数), 2)
            End If
            '============================================================================
            '逆向遍历统计：中长期指标
            '============================================================================
            For Y = 1 To UBound(矩历码期值, 2)  '按日
            If VBA.IsNumeric(矩历码期值(X, Y, 位矩历三维幅涨)) = True Then
                        '================================================================
                        '统计幅
                        '================================================================
                        值幅涨 = 矩历码期值(X, Y, 位矩历三维幅涨)
                        值幅高 = 矩历码期值(X, Y, 位矩历三维幅高)
                        值幅低 = 矩历码期值(X, Y, 位矩历三维幅低)
                        '----------------------------------------------------------------
                        '统计：各区间属性 中期/长期
                        '----------------------------------------------------------------
                        If Y <= 30 Then
                            组历统时(X, 位统时列仨停数涨) = 组历统时(X, 位统时列仨停数涨) + IIf(值幅涨 > 9, 1, 0)
                            组历统时(X, 位统时列仨停数高) = 组历统时(X, 位统时列仨停数高) + IIf(值幅高 > 9, 1, 0)
                            组历统时(X, 位统时列仨停数跌) = 组历统时(X, 位统时列仨停数跌) + IIf(值幅涨 < -9, 1, 0)
                            组历统时(X, 位统时列仨停数低) = 组历统时(X, 位统时列仨停数低) + IIf(值幅低 < -9, 1, 0)
                            组历统时(X, 位统时列仨均幅涨) = 组历统时(X, 位统时列仨均幅涨) + 值幅涨
                            组历统时(X, 位统时列仨均幅高) = 组历统时(X, 位统时列仨均幅高) + 值幅高
                            组历统时(X, 位统时列仨均幅低) = 组历统时(X, 位统时列仨均幅低) + 值幅低
                            组历统时(X, 位统时列仨高小比) = 组历统时(X, 位统时列仨高小比) + IIf(值幅高 < 值幅下限, 1, 0)
                            组历统时(X, 位统时列仨重心正比) = 组历统时(X, 位统时列仨重心正比) + IIf(值幅高 + 值幅低 >= 0, 1, 0)
                            组历统时(X, 位统时列仨计数) = 组历统时(X, 位统时列仨计数) + 1
                            If 组历统时(X, 位统时列仨顶价) = 0 Then
                                组历统时(X, 位统时列仨顶价) = 矩历码期值(X, Y, 位矩历三维价高)
                                组历统时(X, 位统时列仨顶龄) = Y
                            ElseIf 矩历码期值(X, Y, 位矩历三维价高) > 组历统时(X, 位统时列仨顶价) Then
                                组历统时(X, 位统时列仨顶价) = 矩历码期值(X, Y, 位矩历三维价高)
                                组历统时(X, 位统时列仨顶龄) = Y
                            End If
                            If 组历统时(X, 位统时列仨底价) = 0 Then
                                组历统时(X, 位统时列仨底价) = 矩历码期值(X, Y, 位矩历三维价低)
                                组历统时(X, 位统时列仨底龄) = Y
                            ElseIf 矩历码期值(X, Y, 位矩历三维价低) < 组历统时(X, 位统时列仨底价) Then
                                组历统时(X, 位统时列仨底价) = 矩历码期值(X, Y, 位矩历三维价低)
                                组历统时(X, 位统时列仨底龄) = Y
                            End If
                        ElseIf Y <= 250 And Y > 30 Then
                            组历统时(X, 位统时列佰停数涨) = 组历统时(X, 位统时列佰停数涨) + IIf(值幅涨 > 9, 1, 0)
                            组历统时(X, 位统时列佰停数高) = 组历统时(X, 位统时列佰停数高) + IIf(值幅高 > 9, 1, 0)
                            组历统时(X, 位统时列佰停数跌) = 组历统时(X, 位统时列佰停数跌) + IIf(值幅涨 < -9, 1, 0)
                            组历统时(X, 位统时列佰停数低) = 组历统时(X, 位统时列佰停数低) + IIf(值幅低 < -9, 1, 0)
                            组历统时(X, 位统时列佰均幅涨) = 组历统时(X, 位统时列佰均幅涨) + 值幅涨
                            组历统时(X, 位统时列佰均幅高) = 组历统时(X, 位统时列佰均幅高) + 值幅高
                            组历统时(X, 位统时列佰均幅低) = 组历统时(X, 位统时列佰均幅低) + 值幅低
                            组历统时(X, 位统时列佰高小比) = 组历统时(X, 位统时列佰高小比) + IIf(值幅高 < 值幅下限, 1, 0)
                            组历统时(X, 位统时列佰重心正比) = 组历统时(X, 位统时列佰重心正比) + IIf(值幅高 + 值幅低 >= 0, 1, 0)
                            组历统时(X, 位统时列佰计数) = 组历统时(X, 位统时列佰计数) + 1
                            If 组历统时(X, 位统时列佰顶价) = 0 Then
                                组历统时(X, 位统时列佰顶价) = 矩历码期值(X, Y, 位矩历三维价高)
                                组历统时(X, 位统时列佰顶龄) = Y
                            ElseIf 矩历码期值(X, Y, 位矩历三维价高) > 组历统时(X, 位统时列佰顶价) Then
                                组历统时(X, 位统时列佰顶价) = 矩历码期值(X, Y, 位矩历三维价高)
                                组历统时(X, 位统时列佰顶龄) = Y
                            End If
                            If 组历统时(X, 位统时列佰底价) = 0 Then
                                组历统时(X, 位统时列佰底价) = 矩历码期值(X, Y, 位矩历三维价低)
                                组历统时(X, 位统时列佰底龄) = Y
                            ElseIf 矩历码期值(X, Y, 位矩历三维价低) < 组历统时(X, 位统时列佰底价) Then
                                组历统时(X, 位统时列佰底价) = 矩历码期值(X, Y, 位矩历三维价低)
                                组历统时(X, 位统时列佰底龄) = Y
                            End If
                        End If
                        '================================================================
            End If
            Next
            '----------------------------------------------------------------------------
            If 组历统时(X, 位统时列仨计数) > 0 Then
                    组历统时(X, 位统时列仨均幅涨) = Round(组历统时(X, 位统时列仨均幅涨) / 组历统时(X, 位统时列仨计数), 2)
                    组历统时(X, 位统时列仨均幅高) = Round(组历统时(X, 位统时列仨均幅高) / 组历统时(X, 位统时列仨计数), 2)
                    组历统时(X, 位统时列仨均幅低) = Round(组历统时(X, 位统时列仨均幅低) / 组历统时(X, 位统时列仨计数), 2)
                    组历统时(X, 位统时列仨高小比) = Round(组历统时(X, 位统时列仨高小比) / 组历统时(X, 位统时列仨计数), 2)
                    组历统时(X, 位统时列仨重心正比) = Round(组历统时(X, 位统时列仨重心正比) / 组历统时(X, 位统时列仨计数), 2)
            End If
            If 组历统时(X, 位统时列佰计数) > 0 Then
                    组历统时(X, 位统时列佰均幅涨) = Round(组历统时(X, 位统时列佰均幅涨) / 组历统时(X, 位统时列佰计数), 2)
                    组历统时(X, 位统时列佰均幅高) = Round(组历统时(X, 位统时列佰均幅高) / 组历统时(X, 位统时列佰计数), 2)
                    组历统时(X, 位统时列佰均幅低) = Round(组历统时(X, 位统时列佰均幅低) / 组历统时(X, 位统时列佰计数), 2)
                    组历统时(X, 位统时列佰高小比) = Round(组历统时(X, 位统时列佰高小比) / 组历统时(X, 位统时列佰计数), 2)
                    组历统时(X, 位统时列佰重心正比) = Round(组历统时(X, 位统时列佰重心正比) / 组历统时(X, 位统时列佰计数), 2)
            End If
            If VBA.IsNumeric(矩历码期值(X, 1, 位矩历三维价收)) = True Then
                    组历统时(X, 位统时列仨顶幅) = Round(组历统时(X, 位统时列仨顶价) / 矩历码期值(X, 1, 位矩历三维价收) - 1, 2)
                    组历统时(X, 位统时列仨底幅) = Round(组历统时(X, 位统时列仨底价) / 矩历码期值(X, 1, 位矩历三维价收) - 1, 2)
                    组历统时(X, 位统时列佰顶幅) = Round(组历统时(X, 位统时列佰顶价) / 矩历码期值(X, 1, 位矩历三维价收) - 1, 2)
                    组历统时(X, 位统时列佰底幅) = Round(组历统时(X, 位统时列佰底价) / 矩历码期值(X, 1, 位矩历三维价收) - 1, 2)
            End If
            '============================================================================
            '衍生股性
            '============================================================================
                    If InStr(值代称, "ST") > 0 Or InStr(值代称, "退") > 0 Then
                            组历统时(X, 位统时列股性) = "0ST退"
                    ElseIf 组历统时(X, 位统时列停牌) = "S" Then
                            组历统时(X, 位统时列股性) = "0停"
                    ElseIf 组历统时(X, 位统时列佰计数) < 150 Then
                            组历统时(X, 位统时列股性) = "0新"
                    ElseIf 组历统时(X, 位统时列佰均幅高) < 1 Then
                            组历统时(X, 位统时列股性) = "0萎"
                    '-------------------------------------------------
                    '过滤均高幅：佰小 应分为三类
                    ElseIf 组历统时(X, 位统时列佰均幅高) < 值幅下限 Then
                        If 组历统时(X, 位统时列仨均幅高) < 值幅下限 Then
                            组历统时(X, 位统时列股性) = "11蔫"
                        ElseIf 组历统时(X, 位统时列仨均幅高) < 值幅上限 Then
                            组历统时(X, 位统时列股性) = "12变活"
                        Else
                            组历统时(X, 位统时列股性) = "13变活"
                        End If
                    '-------------------------------------------------
                    '过滤均高幅：佰中
                    ElseIf 组历统时(X, 位统时列佰均幅高) < 值幅上限 Then
                        If 组历统时(X, 位统时列仨均幅高) < 值幅下限 Then
                            组历统时(X, 位统时列股性) = "21变蔫"
                        ElseIf 组历统时(X, 位统时列仨均幅高) < 值幅上限 Then
                            组历统时(X, 位统时列股性) = "22中"
                        Else
                            组历统时(X, 位统时列股性) = "23变活"
                        End If
                    '-------------------------------------------------
                    '过滤均高幅：佰大 应分为三类
                    Else
                        If 组历统时(X, 位统时列仨均幅高) < 值幅下限 Then
                            组历统时(X, 位统时列股性) = "31变蔫"
                        ElseIf 组历统时(X, 位统时列仨均幅高) < 值幅上限 Then
                            组历统时(X, 位统时列股性) = "32变蔫"
                        Else
                            组历统时(X, 位统时列股性) = "33活"
                        End If
                    End If
            '============================================================================
    End If
    Next
    '====================================================================================
    '返回
    '====================================================================================
End Function




Function 历研统时引擎3统程分布(表名输出 As String, 组历统时 As Variant)
'========================================================================================
'定义
'========================================================================================
    Dim 值幅下限 As Double, 值幅上限 As Double
    '------------------------------------------------------------------------------------
    Dim 典跨时类22中十常 As New Dictionary
    Dim 典跨时类22中十低 As New Dictionary
    Dim 典跨时类23变活 As New Dictionary
    Dim 典跨时类22中 As New Dictionary
    Dim 典跨时类21变蔫 As New Dictionary
    Dim 典跨时类33活 As New Dictionary
    Dim 典跨时类32变蔫 As New Dictionary
    Dim 典跨时类31变蔫 As New Dictionary
    Dim 典跨时类13变活 As New Dictionary
    Dim 典跨时类12变活 As New Dictionary
    Dim 典跨时类11蔫 As New Dictionary
    Dim 典跨时类OST退 As New Dictionary
    Dim 典跨时类O停 As New Dictionary
    Dim 典跨时类O新 As New Dictionary
    Dim 典跨时类O萎 As New Dictionary
'========================================================================================
'筛选
'========================================================================================
    Dim X As Integer
    For X = 1 To UBound(组历统时, 1)  '按码
        CIDL = 组历统时(X, 位统时列CIDL)
        代称 = 组历统时(X, 位统时列代称)
        If UBCID是中股票(CIDL) Then
                '------------------------------------------------------------------------
                '设置波动上下限
                '------------------------------------------------------------------------
                If UBCID是中股票(CIDL) Then
                        值幅下限 = 1.5
                        值幅上限 = 3
                ElseIf UBCID是中股指(CIDL) Or UBCID是中股基(CIDL) Then
                        值幅下限 = 1
                        值幅上限 = 2
                End If
                '------------------------------------------------------------------------
                '注意20230730：以下赋值会覆盖原有程序，但是不需要改变。本程序属于试验性质，用于探索适当的参数，如果参数有调整，反过去修改数程就行了。
                '------------------------------------------------------------------------
                If 组历统时(X, 位统时列股性) = "0ST退" Then
                        典跨时类OST退.Add Item:=代称, Key:=CIDL
                ElseIf 组历统时(X, 位统时列股性) = "0停" Then
                        典跨时类O停.Add Item:=代称, Key:=CIDL
                ElseIf 组历统时(X, 位统时列股性) = "0新" Then
                        典跨时类O新.Add Item:=代称, Key:=CIDL
                ElseIf 组历统时(X, 位统时列股性) = "0萎" Then
                        典跨时类O萎.Add Item:=代称, Key:=CIDL
                '-------------------------------------------------
                '过滤均高幅：佰小 应分为三类
                ElseIf 组历统时(X, 位统时列佰均幅高) < 值幅下限 Then
                    If 组历统时(X, 位统时列仨均幅高) < 值幅下限 Then
                        组历统时(X, 位统时列股性) = "11蔫"
                        典跨时类11蔫.Add Item:=代称, Key:=CIDL
                    ElseIf 组历统时(X, 位统时列仨均幅高) < 值幅上限 Then
                        组历统时(X, 位统时列股性) = "12变活"
                        典跨时类12变活.Add Item:=代称, Key:=CIDL
                    Else
                        组历统时(X, 位统时列股性) = "13变活"
                        典跨时类13变活.Add Item:=代称, Key:=CIDL
                    End If
                '-------------------------------------------------
                '过滤均高幅：佰中
                ElseIf 组历统时(X, 位统时列佰均幅高) < 值幅上限 Then
                    If 组历统时(X, 位统时列仨均幅高) < 值幅下限 Then
                            组历统时(X, 位统时列股性) = "21变蔫"
                            典跨时类21变蔫.Add Item:=代称, Key:=CIDL
                    ElseIf 组历统时(X, 位统时列仨均幅高) < 值幅上限 Then
                            组历统时(X, 位统时列股性) = "22中"
                            典跨时类22中.Add Item:=代称, Key:=CIDL
                    Else
                            组历统时(X, 位统时列股性) = "23变活"
                            典跨时类23变活.Add Item:=代称, Key:=CIDL
                    End If
                '-------------------------------------------------
                '过滤均高幅：佰大 应分为三类
                Else
                    If 组历统时(X, 位统时列仨均幅高) < 值幅下限 Then
                        组历统时(X, 位统时列股性) = "31变蔫"
                        典跨时类31变蔫.Add Item:=代称, Key:=CIDL
                    ElseIf 组历统时(X, 位统时列仨均幅高) < 值幅上限 Then
                        组历统时(X, 位统时列股性) = "32变蔫"
                        典跨时类32变蔫.Add Item:=代称, Key:=CIDL
                    Else
                        组历统时(X, 位统时列股性) = "33活"
                        典跨时类33活.Add Item:=代称, Key:=CIDL
                    End If
                End If
        '                '-------------------------------------------------
        ''                If 组历统时(X, 位统时列十均幅高) <值幅下限 Then
        '                If 组历统时(X, 位统时列仨均幅高) + 组历统时(X, 位统时列仨均幅低) > 0 Then
        '                    '远期正常中期正常近期萎靡 冲高回落
        '                    典跨时类22中十低.Add Item:=代称, Key:=CIDL
        '                '过滤：佰均幅高(非小)仨均幅高(非小)
        '                Else
        '                        '远期正常中期正常近期正常
        '                    典跨时类22中十常.Add Item:=代称, Key:=CIDL
        '                End If
        '                '-------------------------------------------------
                '-------------------------------------------------
        End If
    Next
'========================================================================================
'输出
'========================================================================================
    '-------------------------------------------------
    Call 历研统时引擎4输程(".跨时0", 组历统时, 典跨时类O新, 节色:=常色二灰, 节签:="新股", 是否建表:=True)
    Call 历研统时引擎4输程(".跨时0", 组历统时, 典跨时类OST退, 节色:=常色二灰, 节签:="ST & 退市")
    Call 历研统时引擎4输程(".跨时0", 组历统时, 典跨时类O萎, 节色:=常色二灰, 节签:="长期萎靡")
    Call 历研统时引擎4输程(".跨时0", 组历统时, 典跨时类O停, 节色:=常色二灰, 节签:="停牌")
    '-------------------------------------------------
    Call 历研统时引擎4输程(".跨时32", 组历统时, 典跨时类32变蔫, 是否建表:=True, 节色:=常色八黄, 节签:="32变蔫  变得不活跃")
    Call 历研统时引擎4输程(".跨时31", 组历统时, 典跨时类31变蔫, 是否建表:=True, 节色:=常色八黄, 节签:="31变蔫  突然变得不活跃")
    Call 历研统时引擎4输程(".跨时21", 组历统时, 典跨时类21变蔫, 是否建表:=True, 节色:=常色八黄, 节签:="21变蔫  变得不活跃")
    Call 历研统时引擎4输程(".跨时11", 组历统时, 典跨时类11蔫, 是否建表:=True, 节色:=常色四灰, 节签:="11蔫  股性就是萎靡")
    '-------------------------------------------------
    Call 历研统时引擎4输程(".跨时33", 组历统时, 典跨时类33活, 是否建表:=True, 节色:=常色四靛, 节签:="33活  股性就是活跃")
    Call 历研统时引擎4输程(".跨时23", 组历统时, 典跨时类23变活, 是否建表:=True, 节色:=常色43绿, 节签:="23变活   ")
    Call 历研统时引擎4输程(".跨时13", 组历统时, 典跨时类13变活, 是否建表:=True, 节色:=常色43绿, 节签:="13变活  变得很活跃")
    Call 历研统时引擎4输程(".跨时12", 组历统时, 典跨时类12变活, 是否建表:=True, 节色:=常色43绿, 节签:="12变活  变得活跃")
    '-------------------------------------------------
    Call 历研统时引擎4输程(".跨时22", 组历统时, 典跨时类22中, 是否建表:=True, 节色:=常色六青, 节签:="22中  正常活跃 ")
'========================================================================================
End Function






Sub 测试中间_历研统时引擎3统程分布_分析股性()
    Dim 表名输出 As String
    表名输出 = 常花中股
    Dim WSTO As Worksheet
    Set WSTO = ThisWorkbook.Sheets(表名输出)
    Dim 组历统时 As Variant
    Call UTL数据转换_集WS2ARR(组历统时, WSTO, 2, 花列统道)
'========================================================================================
'筛选
'========================================================================================
    Call 历研统时引擎3统程分布(表名输出, 组历统时)
'    Call 历研统时引擎3统程涨停(表名输出, 组历统时)
End Sub

Sub 测试中间_历研统时引擎3统程分布_分析股性2()
    Dim 表名输出 As String
    表名输出 = "..ZT"
    Dim WSTO As Worksheet
    Set WSTO = ThisWorkbook.Sheets(表名输出)
    Dim 组历统时 As Variant
    Call UTL数据转换_集WS2ARR(组历统时, WSTO, 2, 1)
'========================================================================================
'筛选
'========================================================================================
    Call 历研统时引擎3统程分布(表名输出, 组历统时)
'    Call 历研统时引擎3统程涨停(表名输出, 组历统时)
End Sub



'========================================================================================
'========================================================================================
'功能：按照【典码称输出】所含代码输出【组历统时】
'========================================================================================
'========================================================================================
Function 历研统时引擎4输程( _
          表名输出 As String _
        , 组历统时 As Variant _
        , 典码称输出 As Dictionary _
        , 节签 As String _
        , Optional 节色 As Long = 常色四靛 _
        , Optional 是否建表 As Boolean = False _
        , Optional 始列 As Integer = 1 _
        , Optional 基色底 As Long = 常色主绿 _
      )
'========================================================================================
'建立工表
'========================================================================================
    基色底 = IIf(InStr(表名输出, "停") > 0, 常色主绿, 常色四青)
    Dim WSTO As Worksheet
    If 是否建表 = True Or UTL判断工表存在(表名输出) = False Then
        Call PBASE格程工具_表操工表新增(WSTO, 表名输出, 基色底:=基色底)
        Call PBASE格程工具_表冻结锁定(WSTO, 1, 始列 + 位统时列代称 - 1)
        WSTO.Cells.Interior.Color = 常色主黑
        WSTO.Cells.Font.Size = 8
        Call 历研统时引擎5格程按列(WSTO, 始列:=始列)
    End If
    Set WSTO = ThisWorkbook.Sheets(表名输出)
'========================================================================================
'验证
'========================================================================================
    If VBA.IsEmpty(组历统时) Then Exit Function
    If 典码称输出.Count = 0 Then Exit Function
'========================================================================================
'输出数据
'========================================================================================
    Dim 典组历统时 As New Dictionary
    For X = LBound(组历统时, 1) To UBound(组历统时, 1)
        CIDL = 组历统时(X, 1)
        典组历统时.Add Item:=X, Key:=CIDL
    Next
    '------------------------------------------------------------------------------------
    ReDim 组输出(1 To 典码称输出.Count, LBound(组历统时, 2) To UBound(组历统时, 2)) As Variant
    '------------------------------------------------------------------------------------
    For X = 1 To 典码称输出.Count
        CIDL = 典码称输出.Keys(X - 1)
        定位组历统时 = 典组历统时(CIDL)
        For Y = LBound(组历统时, 2) To UBound(组历统时, 2)
            组输出(X, Y) = 组历统时(定位组历统时, Y)
        Next
    Next
'========================================================================================
'输出标签
'========================================================================================
    Dim 始行 As Integer
    始行 = PBASE格程工具_表参末行指定(WSTO, 始列) + 2
    '------------------------------------------------------------------------------------
    With WSTO.Rows(始行)
        .Cells(1, 始列) = 节签 & "  #" & 典码称输出.Count
        .Interior.Color = 节色
        .Font.Color = 常色主白
        .RowHeight = 50
        .Font.Size = 20
        .Font.Bold = True
    End With
    始行 = 始行 + 2
'========================================================================================
'格式化
'========================================================================================
    '------------------------------------------------------------------------------------
    '输出
    '------------------------------------------------------------------------------------
    Call UTL数据转换_集ARR2WS(组输出, WSTO, 始行, 始列)
    Set 典组历统时 = Nothing
    Dim 总行数 As Integer
    总行数 = UBound(组输出, 1) - LBound(组输出, 1) + 1
    '------------------------------------------------------------------------------------
    '格式化：
    '------------------------------------------------------------------------------------
    With WSTO.Cells(始行, 始列).Resize(总行数, 位统时列总终)
        .Font.Size = 9
        .Interior.ColorIndex = 37
    End With
    '纵列
    With WSTO.Cells(始行, 始列).Cells(1, 位统时列CIDL).Resize(总行数, 1)
        .Interior.Color = 常色四灰
        .Font.Color = 常色四灰
        .Font.TintAndShade = -0.1
        .Font.Size = 10
    End With
    With WSTO.Cells(始行, 始列).Cells(1, 位统时列代称).Resize(总行数, 1)
        .Interior.Color = 常色四灰
        .Font.Color = 常色主白
        .Font.Size = 10
    End With
    '------------------------------------------------------------------------------------
    '格式化：单元格
    '------------------------------------------------------------------------------------
    For X = 1 To 总行数
        目行 = 始行 + X - 1
        For Y = 位统时列波始 To 位统时列总终
            目列 = 始列 + Y - 1
            With WSTO.Cells(目行, 目列)
                If .Value = 0 Then
                    .Font.Color = .Interior.Color
                    .Font.TintAndShade = -0.1
                End If
            End With
        Next
    Next
    '------------------------------------------------------------------------------------
    '格式化：排序
    '------------------------------------------------------------------------------------
    With WSTO.Cells(始行, 始列).Resize(总行数, 位统时列总终)
            .Sort key1:=.Cells(1, 位统时列十均幅高), order1:=xlDescending, _
                  key2:=.Cells(1, 位统时列仨均幅涨), order2:=xlDescending, _
                  Header:=xlNo
            .Sort key1:=.Cells(1, 位统时列停五符), order1:=xlDescending, _
                  key2:=.Cells(1, 位统时列十停数高), order2:=xlDescending, _
                  key3:=.Cells(1, 位统时列BTHR9), order3:=xlDescending, _
                  Header:=xlNo              '序：涨停时间>涨停次数>涨停倒数
    End With
    '------------------------------------------------------------------------------------
    '格式化：边框
    '------------------------------------------------------------------------------------
    With WSTO.Cells(始行, 始列)
        '--------------------------------------------------------------------------------
        .Cells(1, 位统时列十停数涨).Resize(总行数, 1).Interior.ColorIndex = 36
        .Cells(1, 位统时列十停数高).Resize(总行数, 1).Interior.ColorIndex = 36
        .Cells(1, 位统时列十停数跌).Resize(总行数, 1).Interior.ColorIndex = 35
        .Cells(1, 位统时列十停数低).Resize(总行数, 1).Interior.ColorIndex = 35
        .Cells(1, 位统时列仨停数涨).Resize(总行数, 1).Interior.ColorIndex = 36
        .Cells(1, 位统时列仨停数高).Resize(总行数, 1).Interior.ColorIndex = 36
        .Cells(1, 位统时列仨停数跌).Resize(总行数, 1).Interior.ColorIndex = 35
        .Cells(1, 位统时列仨停数低).Resize(总行数, 1).Interior.ColorIndex = 35
        .Cells(1, 位统时列佰停数涨).Resize(总行数, 1).Interior.ColorIndex = 36
        .Cells(1, 位统时列佰停数高).Resize(总行数, 1).Interior.ColorIndex = 36
        .Cells(1, 位统时列佰停数跌).Resize(总行数, 1).Interior.ColorIndex = 35
        .Cells(1, 位统时列佰停数低).Resize(总行数, 1).Interior.ColorIndex = 35
        '--------------------------------------------------------------------------------
        .Cells(1, 位统时列仨顶龄).Resize(总行数, 1).Interior.Color = 常色六灰
        .Cells(1, 位统时列仨顶价).Resize(总行数, 1).Interior.Color = 常色四灰
        .Cells(1, 位统时列仨顶幅).Resize(总行数, 1).Interior.Color = 常色八灰
        .Cells(1, 位统时列仨底龄).Resize(总行数, 1).Interior.Color = 常色六灰
        .Cells(1, 位统时列仨底价).Resize(总行数, 1).Interior.Color = 常色四灰
        .Cells(1, 位统时列仨底幅).Resize(总行数, 1).Interior.Color = 常色八灰
        .Cells(1, 位统时列佰顶龄).Resize(总行数, 1).Interior.Color = 常色六灰
        .Cells(1, 位统时列佰顶价).Resize(总行数, 1).Interior.Color = 常色四灰
        .Cells(1, 位统时列佰顶幅).Resize(总行数, 1).Interior.Color = 常色八灰
        .Cells(1, 位统时列佰底龄).Resize(总行数, 1).Interior.Color = 常色六灰
        .Cells(1, 位统时列佰底价).Resize(总行数, 1).Interior.Color = 常色四灰
        .Cells(1, 位统时列佰底幅).Resize(总行数, 1).Interior.Color = 常色八灰
        '--------------------------------------------------------------------------------
    End With
    '------------------------------------------------------------------------------------
    '格式化：边框
    '------------------------------------------------------------------------------------
    With WSTO.Cells(始行, 始列).Cells(1, 位统时列十始).Resize(总行数, 1).Borders(xlLeft)
       .Color = 常色主黑
       .Weight = xlThick
    End With
    With WSTO.Cells(始行, 始列).Cells(1, 位统时列仨始).Resize(总行数, 1).Borders(xlLeft)
       .Color = 常色主黑
       .Weight = xlThick
    End With
    With WSTO.Cells(始行, 始列).Cells(1, 位统时列佰始).Resize(总行数, 1).Borders(xlLeft)
       .Color = 常色主黑
       .Weight = xlThick
    End With
    With WSTO.Cells(始行, 始列).Cells(1, 位统时列股性).Resize(总行数, 1).Borders(xlLeft)
       .Color = 常色主黑
       .Weight = xlThick
    End With
        With WSTO.Cells(始行, 始列).Cells(1, 位统时列今幅低).Resize(总行数, 1).Borders(xlLeft)
           .Color = 常色主黑
           .Weight = xlThin
        End With
        With WSTO.Cells(始行, 始列).Cells(1, 位统时列停五符).Resize(总行数, 1).Borders(xlLeft)
           .Color = 常色主黑
           .Weight = xlThin
        End With
        With WSTO.Cells(始行, 始列).Cells(1, 位统时列停牌).Resize(总行数, 1).Borders(xlLeft)
           .Color = 常色主黑
           .Weight = xlThin
        End With
        With WSTO.Cells(始行, 始列).Cells(1, 位统时列停牌).Resize(总行数, 1).Borders(xlRight)
           .Color = 常色主黑
           .Weight = xlThin
        End With
'========================================================================================
End Function


Private Sub 历研统时引擎5格程按列_测试()
Dim WS花册 As Worksheet
If STBASE外簿工具_花册链接(WS花册, 常花中股) = False Then Exit Sub
Call 历研统时引擎5格程按列(WS花册, 始行:=1, 始列:=花列统道)
End Sub

'========================================================================================
'========================================================================================
'功能：进行按列格式化（首行/列格式）
'========================================================================================
'========================================================================================
Function 历研统时引擎5格程按列(WSTO As Worksheet _
        , Optional 始行 As Integer = 1 _
        , Optional 始列 As Integer = 1 _
        , Optional 基色底 As Long = 常色四青 _
        ) As Integer
    '====================================================================================
    If WSTO Is Nothing Then Exit Function
    '====================================================================================
    '格式化：按列
    '====================================================================================
    With WSTO.Cells(始行, 始列)
        .Cells(1, 位统时列CIDL) = "CIDL"
        .Cells(1, 位统时列代称) = "代称"
        .Cells(1, 位统时列停牌) = "停牌"
        .Cells(1, 位统时列股性) = "股性"
        .Cells(1, 位统时列交额) = "成交额"
        .Cells(1, 位统时列市值) = "总市值"
        .Cells(1, 位统时列结期) = "结期"
        '-------------------------------------
        .Cells(1, 位统时列今幅涨) = "幅涨"
        .Cells(1, 位统时列今幅高) = "幅高"
        .Cells(1, 位统时列今幅低) = "幅低"
        '-------------------------------------
        .Cells(1, 位统时列停五符) = "S五符"
        .Cells(1, 位统时列BTHR9) = "#S龄9"
        .Cells(1, 位统时列BTHR3) = "#S龄3"
        .Cells(1, 位统时列BTHR1) = "#S龄a"
        .Cells(1, 位统时列BTHR0) = "#S龄0"
        '-------------------------------------
        .Cells(1, 位统时列十停数涨) = "#S涨" & vbCrLf & "十"
        .Cells(1, 位统时列十停数高) = "#S高" & vbCrLf & "十"
        .Cells(1, 位统时列十停数跌) = "#S跌" & vbCrLf & "十"
        .Cells(1, 位统时列十停数低) = "#S低" & vbCrLf & "十"
        .Cells(1, 位统时列十均幅涨) = "%m涨" & vbCrLf & "十"
        .Cells(1, 位统时列十均幅高) = "%m高" & vbCrLf & "十"
        .Cells(1, 位统时列十高小比) = "%高<下限" & vbCrLf & "十"
        .Cells(1, 位统时列十均幅低) = "%m低" & vbCrLf & "十"
        .Cells(1, 位统时列十重心正比) = "%心正" & vbCrLf & "十"
        .Cells(1, 位统时列十计数) = "#十"
        '-------------------------------------
        .Cells(1, 位统时列仨停数涨) = "#S涨" & vbCrLf & "仨"
        .Cells(1, 位统时列仨停数高) = "#S高" & vbCrLf & "仨"
        .Cells(1, 位统时列仨停数跌) = "#S跌" & vbCrLf & "仨"
        .Cells(1, 位统时列仨停数低) = "#S低" & vbCrLf & "仨"
        .Cells(1, 位统时列仨均幅涨) = "%m涨" & vbCrLf & "仨"
        .Cells(1, 位统时列仨均幅高) = "%m高" & vbCrLf & "仨"
        .Cells(1, 位统时列仨高小比) = "%高<下限"
        .Cells(1, 位统时列仨均幅低) = "%m低" & vbCrLf & "仨"
        .Cells(1, 位统时列仨重心正比) = "%心正" & vbCrLf & "仨"
        .Cells(1, 位统时列仨顶价) = "顶价" & vbCrLf & "仨"
        .Cells(1, 位统时列仨顶龄) = "顶龄" & vbCrLf & "仨"
        .Cells(1, 位统时列仨顶幅) = "顶幅" & vbCrLf & "仨"
        .Cells(1, 位统时列仨底价) = "底价" & vbCrLf & "仨"
        .Cells(1, 位统时列仨底龄) = "底龄" & vbCrLf & "仨"
        .Cells(1, 位统时列仨底幅) = "底幅" & vbCrLf & "仨"
        .Cells(1, 位统时列仨计数) = "#仨"
        '-------------------------------------
        .Cells(1, 位统时列佰停数涨) = "#S涨" & vbCrLf & "佰"
        .Cells(1, 位统时列佰停数高) = "#S高" & vbCrLf & "佰"
        .Cells(1, 位统时列佰停数跌) = "#S跌" & vbCrLf & "佰"
        .Cells(1, 位统时列佰停数低) = "#S低" & vbCrLf & "佰"
        .Cells(1, 位统时列佰均幅涨) = "%m涨" & vbCrLf & "佰"
        .Cells(1, 位统时列佰均幅高) = "%m高" & vbCrLf & "佰"
        .Cells(1, 位统时列佰高小比) = "%高<下限"
        .Cells(1, 位统时列佰均幅低) = "%m低" & vbCrLf & "佰"
        .Cells(1, 位统时列佰重心正比) = "%心正" & vbCrLf & "佰"
        .Cells(1, 位统时列佰顶价) = "顶价" & vbCrLf & "佰"
        .Cells(1, 位统时列佰顶龄) = "顶龄" & vbCrLf & "佰"
        .Cells(1, 位统时列佰顶幅) = "顶幅" & vbCrLf & "佰"
        .Cells(1, 位统时列佰底价) = "底价" & vbCrLf & "佰"
        .Cells(1, 位统时列佰底龄) = "底龄" & vbCrLf & "佰"
        .Cells(1, 位统时列佰底幅) = "底幅" & vbCrLf & "佰"
        .Cells(1, 位统时列佰计数) = "#佰"
        '-------------------------------------
    End With
    '------------------------------------------------------------------------------------
    '格式化：列
    '------------------------------------------------------------------------------------
    With WSTO.Cells(始行, 始列).Cells(1, 位统时列总始).Resize(1, 位统时列总终 - 位统时列总始 + 1).EntireColumn
        .ColumnWidth = 4
        .Interior.Color = 基色底
        .Font.Size = 9
        .NumberFormatLocal = "[黑色]0_);[蓝色](0)"
    End With
    With WSTO.Cells(始行, 始列).Cells(1, 位统时列波始).Resize(1, 位统时列波终 - 位统时列波始 + 1).EntireColumn
        .Interior.TintAndShade = 0.1
    End With
    With WSTO.Cells(始行, 始列).Cells(1, 位统时列十始).Resize(1, 位统时列十计数 - 位统时列十始 + 1).EntireColumn
        .Interior.TintAndShade = -0.2
    End With
    With WSTO.Cells(始行, 始列).Cells(1, 位统时列仨始).Resize(1, 位统时列仨计数 - 位统时列仨始 + 1).EntireColumn
        .Interior.TintAndShade = -0.4
    End With
    With WSTO.Cells(始行, 始列).Cells(1, 位统时列佰始).Resize(1, 位统时列佰计数 - 位统时列佰始 + 1).EntireColumn
        .Interior.TintAndShade = -0.6
    End With
    With WSTO.Columns(始列)
        .Columns(位统时列CIDL).ColumnWidth = 9
        .Columns(位统时列代称).ColumnWidth = 12
        .Columns(位统时列停五符).ColumnWidth = 12
        .Columns(位统时列股性).ColumnWidth = 6
        .Columns(位统时列结期).ColumnWidth = 10
    End With
    WSTO.Columns(始列).Columns(位统时列结期).NumberFormatLocal = 全设格式of日期
    With WSTO.Columns(始列)
        .Columns(位统时列十高小比).NumberFormatLocal = 全设格式of百分
        .Columns(位统时列仨高小比).NumberFormatLocal = 全设格式of百分
        .Columns(位统时列佰高小比).NumberFormatLocal = 全设格式of百分
        .Columns(位统时列十重心正比).NumberFormatLocal = 全设格式of百分
        .Columns(位统时列仨重心正比).NumberFormatLocal = 全设格式of百分
        .Columns(位统时列佰重心正比).NumberFormatLocal = 全设格式of百分
        .Columns(位统时列仨顶幅).NumberFormatLocal = 全设格式of百分
        .Columns(位统时列仨底幅).NumberFormatLocal = 全设格式of百分
        .Columns(位统时列佰顶幅).NumberFormatLocal = 全设格式of百分
        .Columns(位统时列佰底幅).NumberFormatLocal = 全设格式of百分
        .Columns(位统时列交额).NumberFormatLocal = 全设格式of零位
        .Columns(位统时列市值).NumberFormatLocal = 全设格式of零位
        .Columns(位统时列今幅涨).NumberFormatLocal = "[黑色]0_);[红色](0)"
        .Columns(位统时列今幅高).NumberFormatLocal = "[黑色]0_);[红色](0)"
        .Columns(位统时列今幅低).NumberFormatLocal = "[黑色]0_);[红色](0)"
    End With
    '------------------------------------------------------------------------------------
    '格式化：首行
    '------------------------------------------------------------------------------------
    With WSTO.Cells(始行, 始列).Resize(1, 位统时列总终)
        .Font.Bold = True
        .Interior.Color = 基色底
        .Font.Color = 常色主黑
        .Font.Size = 8
    End With
    '------------------------------------------------------------------------------------
    '格式化：隐藏列
    '------------------------------------------------------------------------------------
    WSTO.Columns(始列).Columns(位统时列十计数).Hidden = True
    WSTO.Columns(始列).Columns(位统时列仨计数).Hidden = True
    WSTO.Columns(始列).Columns(位统时列佰计数).Hidden = True
    WSTO.Columns(始列).Columns(位统时列仨顶价).Hidden = True
    WSTO.Columns(始列).Columns(位统时列仨底价).Hidden = True
    WSTO.Columns(始列).Columns(位统时列佰顶价).Hidden = True
    WSTO.Columns(始列).Columns(位统时列佰底价).Hidden = True
    '====================================================================================
End Function
'########################################################################################
'########################################################################################
'###################################   历研统时引擎   ####################################
'########################################################################################
'########################################################################################



















'########################################################################################
'########################################################################################
'#####################################    归集涨停   ####################################
'########################################################################################
'########################################################################################
Sub 历研统时调程涨停()
'========================================================================================
'制作字典
'========================================================================================
    '------------------------------------------------------------------------------------
    '读取花册
    '------------------------------------------------------------------------------------
    Dim WS花册 As Worksheet
    If STBASE外簿工具_花册链接(WS花册, 常花中股) = False Then Exit Sub
    Dim 组花册 As Variant
    Call UTL数据转换_集WS2ARR(组花册, WS花册, 始行:=2, 始列:=1, 总列:=花宽主道)
    '------------------------------------------------------------------------------------
    '制作字典
    '------------------------------------------------------------------------------------
    Dim 典码花册 As New Dictionary
    Dim X As Integer
    For X = LBound(组花册, 1) To UBound(组花册, 1)
        CIDL = 组花册(X, 位列花天CIDL)
        代称 = 组花册(X, 位列花天代称)
        If UBCID是中股票(CIDL) = True Then
            典码花册.Add Key:=CIDL, Item:=代称
        End If
'        If 典码花册.Count > 500 Then Exit For
        Debug.Print X, CIDL
    Next
    Stop
'========================================================================================
'输出
'========================================================================================
    Dim 表名输出 As String
    表名输出 = "..ZT"
    Dim 是否输出分表 As Boolean
    Dim 是否输出涨停 As Boolean
    是否输出分表 = False
    是否输出涨停 = True
    Call 历研统时引擎1主程(表名输出, 典码花册, 基色底:=常色主绿, 是否输出分表:=是否输出分表, 是否输出涨停:=是否输出涨停, 是否更新源TR:=True)
'========================================================================================
End Sub


Sub 历研统时调程涨停由中间表()
    Dim 表名输出 As String
    表名输出 = "..ZT"
    Dim WSTO As Worksheet
    Set WSTO = ThisWorkbook.Sheets(表名输出)
    Dim 组历统时 As Variant
    Call UTL数据转换_集WS2ARR(组历统时, WSTO, 2, 1)
    '------------------------------------------------------------------------------------
    '筛选
    '------------------------------------------------------------------------------------
'    Call 历研统时引擎3统程分布(表名输出, 组历统时)
    Call 历研统时引擎3统程涨停(表名输出, 组历统时)
End Sub



'已转移至【IQQQ展擎筛程_筛程至表涨停】
Function 历研统时引擎3统程涨停(表名输出 As String, 组历统时 As Variant)
'========================================================================================
'定义
'========================================================================================
    Dim 典跨时类停高一佰小 As New Dictionary
    Dim 典跨时类停高二佰小 As New Dictionary
    Dim 典跨时类停高十佰小 As New Dictionary
    Dim 典跨时类停高一佰中 As New Dictionary
    Dim 典跨时类停高二佰中 As New Dictionary
    Dim 典跨时类停高十佰中 As New Dictionary
    Dim 典跨时类停高一佰大 As New Dictionary
    Dim 典跨时类停高二佰大 As New Dictionary
    Dim 典跨时类停高十佰大 As New Dictionary
    '------------------------------------------------------------------------------------
    Dim 典跨时类停高十类0 As New Dictionary
'========================================================================================
'筛选
'========================================================================================
    Dim X As Integer
    For X = 1 To UBound(组历统时, 1)  '按码
        CIDL = 组历统时(X, 位统时列CIDL)
        代称 = 组历统时(X, 位统时列代称)
        If UBCID是代码(CIDL) Then
                '------------------------------------------------------------------------
                '设置波动上下限
                '------------------------------------------------------------------------
                If UBCID是中股票(CIDL) Then
                        值幅下限 = 1.5
                        值幅上限 = 3
                ElseIf UBCID是中股指(CIDL) Or UBCID是中股基(CIDL) Then
                        值幅下限 = 1
                        值幅上限 = 2
                End If
                '------------------------------------------------------------------------
                If 组历统时(X, 位统时列股性) Like "0*" Then
                    If 组历统时(X, 位统时列十停数高) > 0 Then 典跨时类停高十类0.Add Item:=代称, Key:=CIDL
                '-------------------------------------------------
                '过滤均高幅：佰小 应分为三类
                ElseIf 组历统时(X, 位统时列佰均幅高) <= 值幅下限 Then
                    If 组历统时(X, 位统时列十停数高) > 0 Then 典跨时类停高十佰小.Add Item:=代称, Key:=CIDL
                '-------------------------------------------------
                '过滤均高幅：佰大 应分为三类
                ElseIf 组历统时(X, 位统时列佰均幅高) >= 值幅上限 Then
                    If 组历统时(X, 位统时列十停数高) > 0 Then 典跨时类停高十佰大.Add Item:=代称, Key:=CIDL
                '-------------------------------------------------
                '过滤均高幅：佰中
                Else
                    If 组历统时(X, 位统时列十停数高) > 0 Then 典跨时类停高十佰中.Add Item:=代称, Key:=CIDL
                End If
                '-------------------------------------------------
        End If
    Next
'========================================================================================
'输出：涨停
'========================================================================================
    '-------------------------------------------------
    Call 历研统时引擎4输程(".停0", 组历统时, 典跨时类停高十类0, 节色:=常色主绿, 节签:="高停十类0", 是否建表:=True)
    '-------------------------------------------------
    Call 历研统时引擎4输程(".停小", 组历统时, 典跨时类停高一佰小, 节色:=常色主绿, 节签:="高停一佰小", 是否建表:=True)
    Call 历研统时引擎4输程(".停小", 组历统时, 典跨时类停高二佰小, 节色:=常色主绿, 节签:="高停二佰小")
    Call 历研统时引擎4输程(".停小", 组历统时, 典跨时类停高十佰小, 节色:=常色主绿, 节签:="高停十佰小")
    '-------------------------------------------------
    Call 历研统时引擎4输程(".停中", 组历统时, 典跨时类停高一佰中, 节色:=常色六青, 节签:="高停一佰中", 是否建表:=True)
    Call 历研统时引擎4输程(".停中", 组历统时, 典跨时类停高二佰中, 节色:=常色六青, 节签:="高停二佰中")
    Call 历研统时引擎4输程(".停中", 组历统时, 典跨时类停高十佰中, 节色:=常色六青, 节签:="高停十佰中")
    '-------------------------------------------------
    Call 历研统时引擎4输程(".停大", 组历统时, 典跨时类停高一佰大, 节色:=常色四靛, 节签:="高停一佰大", 是否建表:=True)
    Call 历研统时引擎4输程(".停大", 组历统时, 典跨时类停高二佰大, 节色:=常色四靛, 节签:="高停二佰大")
    Call 历研统时引擎4输程(".停大", 组历统时, 典跨时类停高十佰大, 节色:=常色四靛, 节签:="高停十佰大")
'========================================================================================
End Function
'########################################################################################
'########################################################################################
'#####################################    归集涨停   ####################################
'########################################################################################
'########################################################################################












