Attribute VB_Name = "PX算研_RAP算展8算析"
Public Const 位统算基础代码 = 1
Public Const 位统算基础代称 = 2
Public Const 位统算基础期类 = 3
'-------------------------------------------
Public Const 位统算明细始行 = 4
Public Const 位统算明细终行 = 5
Public Const 位统算明细始日 = 6
Public Const 位统算按持 = 7
Public Const 位统算明细终日 = 8
Public Const 位统算按次 = 9
'-------------------------------------------
Public Const 位统算累涨合计 = 10
Public Const 位统算累赚合计 = 11
Public Const 位统算累赚最高 = 12
Public Const 位统算累赚最低 = 13
Public Const 位统算今赚最高 = 14
Public Const 位统算今赚最低 = 15
Public Const 位统算算法名称 = 16
'-------------------------------------------
Public Const 位统算列数汇总 = 16
'-------------------------------------------
Public Const 位统算链接 = 17
'-------------------------------------------
Public Const 位统算龄年 = 位统算明细始行
Public Const 位统算龄日 = 位统算明细终行
Public Const 位统算总持 = 位统算按持
Public Const 位统算总次 = 位统算按次
Public Const 位统算累赚均持 = 位统算明细始日
Public Const 位统算累赚均次 = 位统算明细终日
Public Const 位统算算法胜率 = 位统算今赚最低
'========================================================================================









'########################################################################################
'########################################################################################
'##################################    统持  基程    #####################################
'########################################################################################
'########################################################################################
'========================================================================================
'========================================================================================
'功能：统计持有盈亏效率通用调用程序
'========================================================================================
'========================================================================================
Function XL算析统持基程( _
          来组 As Variant _
        , 来道基位 As Integer _
        , WSTO As Worksheet _
        , 基行 As Integer _
        , Optional 基列 As Integer = 1 _
        , Optional WSIN As Worksheet _
        ) As Integer
'========================================================================================
    '数据分析
    '------------------------------------------------------------------------------------
    Dim 统组 As Variant
    Call XL算析统持数程(统组, 来组, 来道基位)
    '------------------------------------------------------------------------------------
    '输出格式化
    '------------------------------------------------------------------------------------
    If Not WSIN Is Nothing Then
        XL算析统持基程 = XL算析统持格程(统组, WSTO, 基行, 基列:=基列, WSIN:=WSIN)
    Else
        XL算析统持基程 = XL算析统持格程(统组, WSTO, 基行, 基列:=基列)
    End If
    '------------------------------------------------------------------------------------
    Erase 统组
'========================================================================================
End Function





Function XL算析统持数程( _
          统组 As Variant _
        , 来组 As Variant _
        , 来道基位 As Integer _
        ) As Integer
'========================================================================================
'行列设置
'========================================================================================
    '------------------------------------------------------------------------------------
    '设置行位
    '------------------------------------------------------------------------------------
    Dim 去行标题 As Integer
    去行标题 = 1
    Dim 去行汇总 As Integer
    去行汇总 = 去行标题 + 1
    '------------------------------------------------------------------------------------
    '设置数组
    '------------------------------------------------------------------------------------
    Dim 临统组() As Variant
    ReDim 临统组(1 To 位统算列数汇总, 1 To 去行汇总) As Variant
    '------------------------------------------------------------------------------------
    '初始化标题
    '------------------------------------------------------------------------------------
    临统组(位统算基础代码, 去行标题) = "代" & vbCrLf & "码"
    临统组(位统算基础代称, 去行标题) = "代" & vbCrLf & "称"
    临统组(位统算基础期类, 去行标题) = "期" & vbCrLf & "类"
    临统组(位统算明细始行, 去行标题) = "始行"
    临统组(位统算明细终行, 去行标题) = "终行"
    临统组(位统算明细始日, 去行标题) = "始日"
    临统组(位统算明细终日, 去行标题) = "终日"
    临统组(位统算按次, 去行标题) = "按次"
    临统组(位统算按持, 去行标题) = "按持"
    临统组(位统算累涨合计, 去行标题) = "累涨" & vbCrLf & "本次" & vbCrLf & "[合计]"
    临统组(位统算累赚合计, 去行标题) = "累赚" & vbCrLf & "本次" & vbCrLf & "[合计]"
    临统组(位统算累赚最高, 去行标题) = "累赚" & vbCrLf & "最高" & vbCrLf & "[合计]"
    临统组(位统算累赚最低, 去行标题) = "累赚" & vbCrLf & "最低" & vbCrLf & "[合计]"
    临统组(位统算今赚最高, 去行标题) = "今赚" & vbCrLf & "最高" & vbCrLf & "[合计]"
    临统组(位统算今赚最低, 去行标题) = "今赚" & vbCrLf & "最低"
    临统组(位统算算法名称, 去行标题) = "算法" & vbCrLf & "名称"
    
    临统组(位统算龄年, 去行标题) = 临统组(位统算龄年, 去行标题) & vbCrLf & "[龄年]"
    临统组(位统算龄日, 去行标题) = 临统组(位统算龄日, 去行标题) & vbCrLf & "[龄日]"
    临统组(位统算总持, 去行标题) = 临统组(位统算总持, 去行标题) & vbCrLf & "[总持]"
    临统组(位统算总次, 去行标题) = 临统组(位统算总次, 去行标题) & vbCrLf & "[总次]"
    临统组(位统算累赚均持, 去行标题) = 临统组(位统算累赚均持, 去行标题) & vbCrLf & "[赚每持]"
    临统组(位统算累赚均次, 去行标题) = 临统组(位统算累赚均次, 去行标题) & vbCrLf & "[赚每次]"
    临统组(位统算算法胜率, 去行标题) = 临统组(位统算算法胜率, 去行标题) & vbCrLf & "[胜率]"
'========================================================================================
'变量声明
'========================================================================================
    Dim 当行 As Integer
    '------------------------------------------------------------------------------------
    Dim 值今日 As Date, 前值今日 As Date
    Dim 值累持 As Integer, 前值累持 As Integer
    Dim 值今涨 As Double
    Dim 值今赚 As Long
    Dim 值累赚 As Long
    '------------------------------------------------------------------------------------
    Dim 口代码 As String
    Dim 口期类 As String
    Dim 口算法 As String
    口代码 = 来组(LBound(来组, 1), 来道基位 + 位os代码)
    口期类 = 来组(LBound(来组, 1), 来道基位 + 位os期类)
    口算法 = 来组(LBound(来组, 1), 来道基位 + 位os算法名)
    Dim 口名称 As String
    口名称 = STCALL花册工具_花天查询单码名称(口代码)
    '------------------------------------------------------------------------------------
    Dim 口按次 As Integer
    Dim 口按持 As Integer
    Dim 口明细始日 As Date
    Dim 口明细终日 As Date
    Dim 口明细始行 As Integer
    Dim 口明细终行 As Integer
    Dim 口累涨清仓 As Double
    Dim 口今赚最高 As Long
    Dim 口今赚最低 As Long
    Dim 口累赚清仓 As Long
    Dim 口累赚最高 As Long
    Dim 口累赚最低 As Long
    '------------------------------------------------------------------------------------
    Dim 值观测 As String
    Dim 口观测链串 As String
'========================================================================================
'对期类进行统计
'========================================================================================
    口按次 = 0
    值累持 = 0
    口观测链串 = ""
    '------------------------------------------------------------------------------------
    Dim 行号遍历 As Integer
    For 行号遍历 = LBound(来组, 1) To UBound(来组, 1)
        '--------------------------------------------------------------------------------
        '读取原始数据
        '--------------------------------------------------------------------------------
        前值今日 = 值今日
        值今日 = 来组(行号遍历, 来道基位 + 位os结期)
        前值累持 = 值累持
        值累持 = 来组(行号遍历, 来道基位 + 位os算累持)
        
        值今涨 = 来组(行号遍历, 来道基位 + 位os结幅PR0)
        值今赚 = 来组(行号遍历, 来道基位 + 位os算今赚)
        值累赚 = 来组(行号遍历, 来道基位 + 位os算累赚)
        '--------------------------------------------------------------------------------
        '统计交易开平数据
        '--------------------------------------------------------------------------------
        If 值累持 = 1 Then
            If 值今日 <> 前值今日 Then
                口按次 = 口按次 + 1
                当行 = 去行汇总 + 口按次
                ReDim Preserve 临统组(LBound(临统组, 1) To UBound(临统组, 1), 1 To 当行) As Variant
                
                口明细始行 = 行号遍历
                口明细始日 = 值今日
                
                口累涨清仓 = 0
                口今赚最高 = 0
                口今赚最低 = 0
                口累赚清仓 = 0
                口累赚最高 = 0
                口累赚最低 = 0
            End If
        ElseIf 值累持 > 1 Then
            If 值今日 <> 前值今日 Then
                口按持 = 值累持
                口明细终行 = 行号遍历
                口明细终日 = 来组(行号遍历, 来道基位 + 位os结期)
                
                口累涨清仓 = (1 + 口累涨清仓) * (1 + 值今涨 / 100) - 1
                If 值今赚 > 口今赚最高 Then 口今赚最高 = 值今赚
                If 值今赚 < 口今赚最低 Then 口今赚最低 = 值今赚
                口累赚清仓 = 值累赚
                If 值累赚 > 口累赚最高 Then 口累赚最高 = 值累赚
                If 值累赚 < 口累赚最低 Then 口累赚最低 = 值累赚
            End If
        ElseIf 值累持 = 0 And 前值累持 > 0 Then
                口按持 = 前值累持
                口明细终行 = 行号遍历
                口明细终日 = 值今日
                
                口累涨清仓 = (1 + 口累涨清仓) * (1 + 值今涨 / 100) - 1
                If 值今赚 > 口今赚最高 Then 口今赚最高 = 值今赚
                If 值今赚 < 口今赚最低 Then 口今赚最低 = 值今赚
                口累赚清仓 = 值累赚
                If 值累赚 > 口累赚最高 Then 口累赚最高 = 值累赚
                If 值累赚 < 口累赚最低 Then 口累赚最低 = 值累赚
        End If
        '--------------------------------------------------------------------------------
        '记录统计数据
        '--------------------------------------------------------------------------------
        If 口按次 > 0 Then
                临统组(位统算基础代码, 当行) = 口代码
                临统组(位统算基础代称, 当行) = 口名称
                临统组(位统算基础期类, 当行) = 口期类
                
                临统组(位统算算法名称, 当行) = 口算法
                
                临统组(位统算按次, 当行) = 口按次
                临统组(位统算按持, 当行) = 口按持
                
                临统组(位统算明细始行, 当行) = 口明细始行
                临统组(位统算明细终行, 当行) = 口明细终行
                临统组(位统算明细始日, 当行) = 口明细始日
                临统组(位统算明细终日, 当行) = 口明细终日
                
                临统组(位统算累涨合计, 当行) = Round(口累涨清仓, 2)
                临统组(位统算累赚合计, 当行) = 口累赚清仓
                临统组(位统算累赚最高, 当行) = 口累赚最高
                临统组(位统算累赚最低, 当行) = 口累赚最低
                临统组(位统算今赚最高, 当行) = 口今赚最高
                临统组(位统算今赚最低, 当行) = 口今赚最低
        End If
        '--------------------------------------------------------------------------------
        
        
        
''        '################################################################################
''        '特殊设置需要观察的指标：用于进行持仓过程的压力测试
''        '是否统计今赚 今持等特征
''        '################################################################################
''        '--------------------------------------------------------------------------------
''        '指定观测指标
''        '--------------------------------------------------------------------------------
''        值观测 = 来组(行号遍历, 花偏甲道 + 位os阶林) & 来组(行号遍历, 花偏乙道 + 位os阶林) & 来组(行号遍历, 花偏丙道 + 位os阶林)
''        '--------------------------------------------------------------------------------
''        '按日：统计观测指标
''        '--------------------------------------------------------------------------------
''        If 值累持 = 1 Then
''            If 值今日 <> 前值今日 Then
''                口观测链串 = "[" & 值观测 & "]"
''            Else
''                口观测链串 = 口观测链串 & "." & 值观测
''            End If
''        ElseIf 值累持 > 1 Then
''            If 值今日 <> 前值今日 Then
''                口观测链串 = 口观测链串 & ".[" & 值观测 & "]"
''            Else
''                口观测链串 = 口观测链串 & "." & 值观测
''            End If
''        ElseIf 值累持 = 0 And 前值累持 > 0 Then
''            口观测链串 = 口观测链串 & "#[" & 值观测 & "]"
''        End If
''        '--------------------------------------------------------------------------------
''        '输出
''        '--------------------------------------------------------------------------------
''        If 口按次 > 0 Then
''        'If 统计链串 = True Then
''            临统组(位统算算法名称, 当行) = 口观测链串
''        'End If
''        End If
''        '--------------------------------------------------------------------------------
''        '################################################################################
        
    
    
    Next 行号遍历
'========================================================================================
'合计统计
'========================================================================================
    Dim 口胜次 As Integer
    Dim 口总次 As Integer
    口总次 = 口按次
    
    Dim 口首日 As Date
    Dim 口末日 As Date
    口首日 = 来组(LBound(来组, 1), 来道基位 + 位os结期)
    口末日 = 来组(UBound(来组, 1), 来道基位 + 位os结期)
    Dim 口总年 As Double
    口总年 = Round((口末日 - 口首日) / 365, 1) ' DateDiff("yyyy", 口首日, 口末日)
    
    Dim 口总龄 As Integer
    口总龄 = UBound(来组, 1) - LBound(来组, 1) + 1
    '------------------------------------------------------------------------------------
    '汇总：加和
    '------------------------------------------------------------------------------------
    临统组(位统算基础代码, 去行汇总) = 口代码
    临统组(位统算基础代称, 去行汇总) = 口名称
    临统组(位统算基础期类, 去行汇总) = 口期类
    临统组(位统算算法名称, 去行汇总) = 口算法
    
    临统组(位统算龄年, 去行汇总) = 口总年
    临统组(位统算龄日, 去行汇总) = 口总龄
    临统组(位统算总次, 去行汇总) = 口按次
    
    For N = 1 To 口总次
        当行 = 去行汇总 + N
        
        临统组(位统算总持, 去行汇总) = 临统组(位统算总持, 去行汇总) + 临统组(位统算按持, 当行)
        临统组(位统算累涨合计, 去行汇总) = 临统组(位统算累涨合计, 去行汇总) + 临统组(位统算累涨合计, 当行)
        If 临统组(位统算累涨合计, 当行) > 0 Then 口胜次 = 口胜次 + 1
        
        临统组(位统算累赚合计, 去行汇总) = 临统组(位统算累赚合计, 去行汇总) + 临统组(位统算累赚合计, 当行)
        临统组(位统算累赚最高, 去行汇总) = 临统组(位统算累赚最高, 去行汇总) + 临统组(位统算累赚最高, 当行)
        临统组(位统算累赚最低, 去行汇总) = 临统组(位统算累赚最低, 去行汇总) + 临统组(位统算累赚最低, 当行)
        临统组(位统算今赚最高, 去行汇总) = 临统组(位统算今赚最高, 去行汇总) + 临统组(位统算今赚最高, 当行)
        临统组(位统算今赚最低, 去行汇总) = 临统组(位统算今赚最低, 去行汇总) + 临统组(位统算今赚最低, 当行)
    Next N
    If 口总次 > 0 Then 临统组(位统算算法胜率, 去行汇总) = Round(口胜次 / 口总次, 2)
    '------------------------------------------------------------------------------------
    '汇总：统计均值
    '------------------------------------------------------------------------------------
    Dim 值累赚合计 As Long
    值累赚合计 = 临统组(位统算累赚合计, 去行汇总)
    
    Dim 值总次 As Long
    Dim 值总持 As Long
    值总次 = 临统组(位统算总次, 去行汇总)
    值总持 = 临统组(位统算总持, 去行汇总)
    
    Dim 值累赚均次 As Long
    Dim 值累赚均持 As Long
    If 值总次 > 0 Then 值累赚均次 = 值累赚合计 / 值总次
    If 值总持 > 0 Then 值累赚均持 = 值累赚合计 / 值总持
    临统组(位统算累赚均次, 去行汇总) = 值累赚均次
    临统组(位统算累赚均持, 去行汇总) = 值累赚均持
'========================================================================================
'输出
'========================================================================================
    统组 = Application.Transpose(临统组)
    Erase 临统组
'========================================================================================
'返回
'========================================================================================
    XL算析统持数程 = 基行 + 口总次 + 2
End Function







Function XL算析统持格程( _
          统组 As Variant _
        , WSTO As Worksheet _
        , 基行 As Integer _
        , Optional 基列 As Integer = 1 _
        , Optional WSIN As Worksheet _
        ) As Integer
'========================================================================================
'输出
'========================================================================================
    Call UTL数据转换_集ARR2WS(统组, WSTO, 基行, 基列)
    '====================================================================================
    '建立超链接：取决于是否提供展示簿
    '====================================================================================
    Dim 口明细始行 As Integer
    Dim 口明细终行 As Integer
    Dim N As Integer
    
    If Not WSIN Is Nothing Then
    For N = LBound(统组, 1) + 2 To UBound(统组, 1)
        '--------------------------------------------------------------------------------
        口明细始行 = 统组(N, 位统算明细始行) + 1
        WSTO.Hyperlinks.Add _
              Anchor:=WSTO.Cells(基行, 基列).Cells(N, 位统算明细始日) _
            , Address:="" _
            , SubAddress:=WSIN.Name & "!" & WSIN.Cells(口明细始行, 2).Address(0, 0)
        '--------------------------------------------------------------------------------
        口明细终行 = 统组(N, 位统算明细终行) + 1
        WSTO.Hyperlinks.Add _
              Anchor:=WSTO.Cells(基行, 基列).Cells(N, 位统算明细终日) _
            , Address:="" _
            , SubAddress:=WSIN.Name & "!" & WSIN.Cells(口明细终行, 2).Address(0, 0)
        '--------------------------------------------------------------------------------
    Next N
    End If
'========================================================================================
'格式化
'========================================================================================
    Dim 基元 As Range
    Set 基元 = WSTO.Cells(基行, 基列)
    Dim 行数 As Integer
    行数 = UBound(统组, 1) - LBound(统组, 1) + 1
    '------------------------------------------------------------------------------------
    '行标题
    '------------------------------------------------------------------------------------
    With 基元.Resize(1, 位统算列数汇总)
        .Font.Bold = True
        .VerticalAlignment = xlTop
        .HorizontalAlignment = xlRight
    End With
    '------------------------------------------------------------------------------------
    '列格式
    '------------------------------------------------------------------------------------
    WSTO.Columns(基列).Columns(位统算基础代码).HorizontalAlignment = xlLeft
    WSTO.Columns(基列).Columns(位统算基础代称).HorizontalAlignment = xlLeft
    WSTO.Columns(基列).Columns(位统算基础期类).HorizontalAlignment = xlLeft
    WSTO.Columns(基列).Columns(位统算算法名称).HorizontalAlignment = xlRight
    WSTO.Columns(基列).Columns(位统算明细始日).NumberFormatLocal = 全设格式of日期
    WSTO.Columns(基列).Columns(位统算明细终日).NumberFormatLocal = 全设格式of日期
    WSTO.Columns(基列).Columns(位统算累涨合计).NumberFormatLocal = 全设格式of百分
    WSTO.Columns(基列).Columns(位统算累涨合计).Font.Bold = True
    WSTO.Columns(基列).Columns(位统算累赚合计).Font.Bold = True
    '------------------------------------------------------------------------------------
    '底纹
    '------------------------------------------------------------------------------------
    '全部底纹
    基元.Resize(行数, 位统算列数汇总).Interior.ColorIndex = 37
    '行汇总
    WSTO.Cells(基行 + 1, 基列).Resize(1, 位统算列数汇总).Interior.Color = 常色十靛
    'WSTO.Rows(基行 + 1).Font.Bold = True
    基元.Cells(2, 位统算累赚均持).Font.Bold = True
    基元.Cells(2, 位统算累赚均次).Font.Bold = True
    基元.Cells(2, 位统算累赚均持).NumberFormatLocal = "0"
    基元.Cells(2, 位统算累赚均次).NumberFormatLocal = "0"
    '列汇总
    基元.Cells(1, 位统算累涨合计).Resize(行数, 1).Interior.Color = 常色主绿
    基元.Cells(1, 位统算累涨合计).Resize(行数, 1).Interior.TintAndShade = 0.3
    基元.Cells(1, 位统算累赚合计).Resize(行数, 1).Interior.ColorIndex = 36
    基元.Cells(1, 位统算累赚最高).Resize(行数, 1).Interior.Color = 常色主靛
    基元.Cells(1, 位统算累赚最低).Resize(行数, 1).Interior.Color = 常色主靛
    基元.Cells(1, 位统算今赚最高).Resize(行数, 1).Interior.ColorIndex = 56
    基元.Cells(1, 位统算今赚最低).Resize(行数, 1).Interior.ColorIndex = 56
    基元.Cells(1, 位统算算法名称).Resize(行数, 1).Interior.ColorIndex = 35
    基元.Cells(2, 位统算算法胜率).Interior.ColorIndex = 35
    基元.Cells(2, 位统算算法胜率).NumberFormatLocal = "0%"
    '行标题
    基元.Resize(1, 位统算列数汇总).Interior.Color = 常色主靛
    '------------------------------------------------------------------------------------
    '列格式：列宽
    '------------------------------------------------------------------------------------
    WSTO.Columns(基列).Columns(位统算基础代码).ColumnWidth = 9
    WSTO.Columns(基列).Columns(位统算基础代称).ColumnWidth = 8
    WSTO.Columns(基列).Columns(位统算基础期类).ColumnWidth = 2
    WSTO.Columns(基列).Columns(位统算明细始行).ColumnWidth = 6
    WSTO.Columns(基列).Columns(位统算明细终行).ColumnWidth = 6
    WSTO.Columns(基列).Columns(位统算明细始日).ColumnWidth = 9
    WSTO.Columns(基列).Columns(位统算明细终日).ColumnWidth = 9
    WSTO.Columns(基列).Columns(位统算按持).ColumnWidth = 6
    WSTO.Columns(基列).Columns(位统算按次).ColumnWidth = 6
    WSTO.Columns(基列).Columns(位统算累涨合计).ColumnWidth = 6
    WSTO.Columns(基列).Columns(位统算累赚合计).ColumnWidth = 7
    WSTO.Columns(基列).Columns(位统算累赚最低).ColumnWidth = 7
    WSTO.Columns(基列).Columns(位统算累赚最高).ColumnWidth = 7
    WSTO.Columns(基列).Columns(位统算今赚最低).ColumnWidth = 7
    WSTO.Columns(基列).Columns(位统算今赚最高).ColumnWidth = 7
    WSTO.Columns(基列).Columns(位统算算法名称).ColumnWidth = 8
    '------------------------------------------------------------------------------------
    '边框
    '------------------------------------------------------------------------------------
    With 基元.Resize(行数, 位统算列数汇总)
        With .Borders(xlEdgeLeft)
            .LineStyle = xlContinuous
            .Color = 常色主黑
            .Weight = xlMedium
        End With
        With .Borders(xlEdgeRight)
            .LineStyle = xlContinuous
            .Color = 常色主黑
            .Weight = xlMedium
        End With
    End With
'========================================================================================
'汇总：统地
'========================================================================================
'此处需要详细格式化
'单独成为函数 统地输出
    '------------------------------------------------------------------------------------
    '设置：工表
    '------------------------------------------------------------------------------------
    Dim 工表统地  As Worksheet
    If UTL判断工表存在(常表名统地) = False Then
        Call PBASE格程工具_表操工表新增(工表统地, 常表名统地, 基色底:=常色研究)
        工表统地.Cells.Interior.ColorIndex = 1
    Else
        Set 工表统地 = ThisWorkbook.Sheets(常表名统地)
    End If
    '------------------------------------------------------------------------------------
    '格式化：标题
    '------------------------------------------------------------------------------------
    '基元.Resize(1, 位统算列数汇总).Copy 工表统地.Cells(1, 1)
    Dim X As Integer
    For X = 1 To 位统算列数汇总
        With 工表统地.Cells(1, X)
            .Value = 基元.Cells(1, X)
        End With
    Next
    With 工表统地.Cells(1, 1).Resize(1, 位统算列数汇总)
        .Interior.Color = 常色主靛
        .Font.Bold = True
        .VerticalAlignment = xlTop
    End With
    工表统地.Cells(1, 位统算龄年) = "[龄年]"
    工表统地.Cells(1, 位统算龄日) = "[龄日]"
    工表统地.Cells(1, 位统算总持) = "[总持]"
    工表统地.Cells(1, 位统算总次) = "[总次]"
    工表统地.Cells(1, 位统算累赚均持) = "赚" & vbCrLf & "每持"
    工表统地.Cells(1, 位统算累赚均次) = "赚" & vbCrLf & "每次"
    工表统地.Cells(1, 位统算累涨合计) = "累涨" & vbCrLf & "全次" & vbCrLf & "合计"
    工表统地.Cells(1, 位统算累赚合计) = "累赚" & vbCrLf & "全次" & vbCrLf & "合计"
    工表统地.Cells(1, 位统算今赚最高) = "今赚" & vbCrLf & "最高" & vbCrLf & "合计"
    工表统地.Cells(1, 位统算算法胜率) = "算法" & vbCrLf & "胜率"
    工表统地.Cells(1, 位统算算法名称) = "算法" & vbCrLf & "名称"
    '------------------------------------------------------------------------------------
    '格式化：记录
    '------------------------------------------------------------------------------------
    Dim 统地目行 As Integer
    统地目行 = PBASE格程工具_表参末行指定(工表统地, 1) + 1
    
    '基元.Offset(1, 0).Resize(1, 位统算列数汇总).Copy 工表统地.Cells(统地目行, 1)
    For X = 1 To 位统算列数汇总
        With 工表统地.Cells(统地目行, X)
            .Value = 基元.Offset(1, 0).Cells(1, X)
            .Interior.Color = 基元.Offset(1, 0).Cells(1, X).Interior.Color
        End With
    Next
    工表统地.Rows(统地目行).Font.Bold = False
    工表统地.Columns(位统算累涨合计).NumberFormatLocal = "0%"
    工表统地.Columns(位统算算法胜率).NumberFormatLocal = "0%"
    工表统地.Columns(位统算累赚均持).Font.Bold = True
    工表统地.Columns(位统算累赚均次).Font.Bold = True
    工表统地.Columns(位统算累涨合计).Font.Bold = True
    工表统地.Columns(位统算算法胜率).Font.Bold = True
    '------------------------------------------------------------------------------------
    '格式化
    '------------------------------------------------------------------------------------
    '格式化：链接
    工表统地.Hyperlinks.Add _
                  Anchor:=工表统地.Cells(统地目行, 位统算链接) _
                , Address:="" _
                , SubAddress:=WSTO.Parent.Name & "!" & 基元.Address(0, 0) _
                , TextToDisplay:="链接"
    '格式化：时间戳
    工表统地.Cells(统地目行, 位统算链接 + 1) = Now
    '------------------------------------------------------------------------------------
    工表统地.Columns.AutoFit
    Call PBASE格程工具_表冻结锁定(工表统地)
    Set 工表统地 = Nothing
'========================================================================================
'返回
'========================================================================================
    Set 基元 = Nothing
    XL算析统持格程 = 基列 + 位统算列数汇总
End Function
'########################################################################################
'########################################################################################
'##################################       统持      #####################################
'########################################################################################
'########################################################################################









