Attribute VB_Name = "PX算研_RAP算展9算灌引擎"







Function XL算比模板前调粗比( _
          被研期类 As String _
        , Optional 是否外簿 As Boolean = True _
        )
    '------------------------------------------------------------------------------------
    Dim 组被研算法 As Variant
    
    组被研算法 = Array(常算比类型为粗比 _
            , "s@持日", "s@决策日DE" _
            , "s@乾坤C", "s@乾坤D", "s@乾坤DG" _
            , "s@均权大周期" _
            , "s@均<AB>", "s@均<AC>", "s@均<AD>", "s@均<AE>", "s@均<AF>", "s@均<AG>" _
            , "s@均<BC>" _
            , "s@均<CD>" _
            , "s@均<CE>" _
            , "s@均<DE>" _
            , "s@均<CF>" _
            , "s@均<EF>" _
            , "s@均<CG>", "s@均<EG>", "s@均<FG>" _
            )
    组被研算法 = Array(常算比类型为粗比 _
            , "s@持日", "s@决策日DE" _
            , "s@乾坤C", "s@乾坤D", "s@乾坤DG" _
            )
    '------------------------------------------------------------------------------------
    Call XL算比模板前调基程( _
              被研期类:=被研期类 _
            , 组被研算法:=组被研算法 _
            , 是否外簿:=是否外簿 _
            )
    '------------------------------------------------------------------------------------
End Function









'########################################################################################
'########################################################################################
'###################################   算灌引擎跨期   ####################################
'########################################################################################
'########################################################################################
'========================================================================================
'========================================================================================
'算法对比：跨期算法
'========================================================================================
'========================================================================================
Function XL算灌引擎跨期( _
          ARRLLL As Variant _
        , 规则算法 As String _
        ) As Integer
'========================================================================================
'检查
'========================================================================================
    If VBA.IsEmpty(ARRLLL) Or Len(规则算法) = 0 Then
        GoTo 返点
    End If
'========================================================================================
'变量声明
'========================================================================================
    Dim 基位 As Integer
    Dim 规则月类 As Boolean
    Dim 规则周类 As Boolean
    Dim 规则日类 As Boolean
    '====================================================================================
    Dim 周类今日 As Date
    Dim 周类前日 As Date
    '---------------------
    Dim 周类今收 As Double
    Dim 周类前收 As Double
    '------------------------------------------------
    Dim 周类前仓 As Double
    Dim 周类前手 As Double
    '---------------------
    Dim 周类今仓 As Double
    Dim 周类今手 As Double
    Dim 周类今资 As Long
    Dim 周类今赚 As Long
    Dim 周类累赚 As Long
    Dim 周类累持 As Integer
    '------------------------------------------------
    Dim 周类JZ#, 周类JA#, 周类JB#, 周类JC#, 周类JD#, 周类JE#, 周类JF#, 周类JG#
    Dim 周类BTZA%
    Dim 周类BTZB%, 周类BTAB%
    Dim 周类BTZC%, 周类BTAC%, 周类BTBC%
    Dim 周类BTAG%, 周类BTAD%, 周类BTCG%, 周类BTCD%
    Dim 周类BTEG%, 周类BTAE%, 周类BTFG%, 周类BTCE%, 周类BTDE%
    Dim 周类BTAF%
    Dim 周类MDIF#, 周类MDEA#, 周类MACD#
    '====================================================================================
    Dim 日类今日 As Date
    Dim 日类前日 As Date
    '---------------------
    Dim 日类今收 As Double
    Dim 日类前收 As Double
    '------------------------------------------------
    Dim 日类前仓 As Double
    Dim 日类前手 As Double
    '---------------------
    Dim 日类今仓 As Double
    Dim 日类今手 As Double
    Dim 日类今资 As Long
    Dim 日类今赚 As Long
    Dim 日类累赚 As Long
    Dim 日类累持 As Integer
    '------------------------------------------------
    Dim 日类JZ#, 日类JA#, 日类JB#, 日类JC#, 日类JD#, 日类JE#, 日类JF#, 日类JG#
    Dim 日类BTZA%
    Dim 日类BTZB%, 日类BTAB%
    Dim 日类BTZC%, 日类BTAC%, 日类BTBC%
    Dim 日类BTZG%, 日类BTAD%, 日类BTCG%, 日类BTCD%
    Dim 日类BTEG%, 日类BTAE%, 日类BTFG%, 日类BTCE%, 日类BTDE%
    Dim 日类BTAF%
    Dim 日类MDIF#, 日类MDEA#, 日类MACD#
'========================================================================================
'遍历
'========================================================================================
    Dim 行号遍历 As Integer
    For 行号遍历 = LBound(ARRLLL, 1) To UBound(ARRLLL, 1)
        '================================================================================
        '获取变量：周类
        '================================================================================
        基位 = 花偏乙道
        '------------------------------------------
        周类前日 = 周类今日
        周类今日 = ARRLLL(行号遍历, 基位 + 位os结期)
        If 周类前日 <> 周类今日 Then
            周类前仓 = 周类今仓
            周类前手 = 周类今手
        End If
        '------------------------------------------
        周类今收 = ARRLLL(行号遍历, 基位 + 位os结收)
        周类前收 = ARRLLL(行号遍历, 基位 + 位os前收)
        周类JZ = ARRLLL(行号遍历, 基位 + 位osJZ)
        周类JA = ARRLLL(行号遍历, 基位 + 位osJA)
        周类JB = ARRLLL(行号遍历, 基位 + 位osJB)
        周类JC = ARRLLL(行号遍历, 基位 + 位osJC)
        周类JD = ARRLLL(行号遍历, 基位 + 位osJD)
        周类JE = ARRLLL(行号遍历, 基位 + 位osJE)
        周类BTZA = ARRLLL(行号遍历, 基位 + 位osBTZA)
        周类BTZB = ARRLLL(行号遍历, 基位 + 位osBTZB)
        周类BTAB = ARRLLL(行号遍历, 基位 + 位osBTAB)
        周类BTZC = ARRLLL(行号遍历, 基位 + 位osBTZC)
        周类BTAC = ARRLLL(行号遍历, 基位 + 位osBTAC)
        周类BTBC = ARRLLL(行号遍历, 基位 + 位osBTBC)
        周类BTAG = ARRLLL(行号遍历, 基位 + 位osBTAG)
        周类BTAD = ARRLLL(行号遍历, 基位 + 位osBTAD)
        周类BTCG = ARRLLL(行号遍历, 基位 + 位osBTCG)
        周类BTCD = ARRLLL(行号遍历, 基位 + 位osBTCD)
        周类BTEG = ARRLLL(行号遍历, 基位 + 位osBTEG)
        周类BTAE = ARRLLL(行号遍历, 基位 + 位osBTAE)
        周类BTFG = ARRLLL(行号遍历, 基位 + 位osBTFG)
        周类BTCE = ARRLLL(行号遍历, 基位 + 位osBTCE)
        周类BTDE = ARRLLL(行号遍历, 基位 + 位osBTDE)
        周类BTAF = ARRLLL(行号遍历, 基位 + 位osBTAF)
        周类BTEF = ARRLLL(行号遍历, 基位 + 位osBTEF)
        '================================================================================
        '获取变量：日类
        '================================================================================
        基位 = 花偏甲道
        '------------------------------------------
        日类前日 = 日类今日
        日类今日 = ARRLLL(行号遍历, 基位 + 位os结期)
            日类前仓 = 日类今仓
            日类前手 = 日类今手
        '------------------------------------------
        日类今收 = ARRLLL(行号遍历, 基位 + 位os结收)
        日类前收 = ARRLLL(行号遍历, 基位 + 位os前收)
        日类JZ = ARRLLL(行号遍历, 基位 + 位osJZ)
        日类JA = ARRLLL(行号遍历, 基位 + 位osJA)
        日类JB = ARRLLL(行号遍历, 基位 + 位osJB)
        日类JC = ARRLLL(行号遍历, 基位 + 位osJC)
        日类JD = ARRLLL(行号遍历, 基位 + 位osJD)
        日类JE = ARRLLL(行号遍历, 基位 + 位osJE)
        日类JF = ARRLLL(行号遍历, 基位 + 位osJF)
        日类JG = ARRLLL(行号遍历, 基位 + 位osJG)
        日类BTZA = ARRLLL(行号遍历, 基位 + 位osBTZA)
        日类BTZB = ARRLLL(行号遍历, 基位 + 位osBTZB)
        日类BTAB = ARRLLL(行号遍历, 基位 + 位osBTAB)
        日类BTZC = ARRLLL(行号遍历, 基位 + 位osBTZC)
        日类BTAC = ARRLLL(行号遍历, 基位 + 位osBTAC)
        日类BTBC = ARRLLL(行号遍历, 基位 + 位osBTBC)
        日类BTZD = ARRLLL(行号遍历, 基位 + 位osBTZD)
        日类BTAD = ARRLLL(行号遍历, 基位 + 位osBTAD)
        日类BTCG = ARRLLL(行号遍历, 基位 + 位osBTCG)
        日类BTCD = ARRLLL(行号遍历, 基位 + 位osBTCD)
        日类BTEG = ARRLLL(行号遍历, 基位 + 位osBTEG)
        日类BTZE = ARRLLL(行号遍历, 基位 + 位osBTZE)
        日类BTAE = ARRLLL(行号遍历, 基位 + 位osBTAE)
        日类BTFG = ARRLLL(行号遍历, 基位 + 位osBTFG)
        日类BTCE = ARRLLL(行号遍历, 基位 + 位osBTCE)
        日类BTDE = ARRLLL(行号遍历, 基位 + 位osBTDE)
        日类BTZF = ARRLLL(行号遍历, 基位 + 位osBTZF)
        日类BTEF = ARRLLL(行号遍历, 基位 + 位osBTEF)
        '================================================================================
        



'########################################################################################
'########################################################################################
'算法规则汇总
'########################################################################################
'########################################################################################
    '====================================================================================
    '规则【均线】：JZ JB | 改进算法，主要比较周类与日类，是否需要按小周期进行操作
    '====================================================================================
    '(月类JZ >= 月类JB) = (月类阶丑 = "U" Or 月类阶丑 = "t")
    '====================================================================================
    '规则【均线】：JZ JB | 改进算法，主要比较周类与日类，是否需要按小周期进行操作
    '====================================================================================
    If 规则算法 = "T@乾坤" Then
'        规则周类 = IIf(周类JZ > 周类JD And 周类BTAB > 0 And 周类BTZC > 0, True, False)
'        规则日类 = IIf(日类BTAE > 0 And 日类BTCD > 0 And 日类BTAD > 0, True, False)
'        规则周类 = IIf(周类JZ > 周类JD And 周类BTCD > 0, True, False)
'        规则日类 = IIf(日类BTAF > 0 And 日类BTEF > 0, True, False)
        规则周类 = IIf(周类BTZC > 0 And 周类BTZB > 0, True, False)
        规则日类 = IIf(日类BTZE > 0 And 日类BTZD > 0, True, False)
    ElseIf 规则算法 = "T@乾坤B" Then
        规则周类 = IIf(周类JZ > 周类JE And 周类BTAD > 0 And 周类BTZC > 0 And 周类BTZB > 0, True, False)
        规则日类 = IIf(日类BTAF > 0 And 日类BTCE > 0 And 日类BTZC > 0, True, False)
    '====================================================================================
    '规则【均线】：JZ JC | 改进算法，主要比较周类与日类，是否需要按小周期进行操作
    '====================================================================================
    '均线JC 远逊于 均线JB，考虑以或为关系对 JB与JC 进行验证
    ElseIf 规则算法 = "S@均<ZC>" Then
        规则周类 = (周类JZ >= 周类JC)
        规则日类 = (日类JZ >= 日类JC)
'========================================================================================
    End If
'########################################################################################
'########################################################################################
'########################################################################################
'########################################################################################
        
        
        
    
        
        
    '====================================================================================
    '持仓规则：周
    '====================================================================================
        If 周类前日 <> 周类今日 Then
            If 规则周类 Then
                周类今仓 = 1
            Else
                周类今仓 = 0
            End If
        
            '周类今资 = 周类今仓 * 10000
            '周类今手 = Round(周类今资 / 周类JZ, 2)
            If 周类今仓 > 0 Then
                If 周类前手 = 0 Then 周类今手 = Round(10000 / 周类JZ, 2)
            Else
                周类今手 = 0
            End If
            '-------------------------------------------------------------------------------
            If 规则算法 = "T@山丘" Then
            
                周类今仓 = 1 * IIf(周类BTAB > 0, 1, -1) _
                                + 1 * IIf(周类BTAC > 0, 1, -1) _
                                + 1 * IIf(周类BTAD > 0, 1, -1) _
                                + 1 * IIf(周类BTAE > 0, 1, -1)
                                
                周类变仓 = 1 * IIf(周类BTAB = 1, 1, 0) _
                            - 1 * IIf(周类BTAB = -1, 1, 0) _
                            + 1 * IIf(周类BTAC = 1, 1, 0) _
                            - 1 * IIf(周类BTAC = -1, 1, 0) _
                            + 1 * IIf(周类BTAD = 1, 1, 0) _
                            - 1 * IIf(周类BTAD = -1, 1, 0) _
                            + 1 * IIf(周类BTAE = 1, 1, 0) _
                            - 1 * IIf(周类BTAE = -1, 1, 0)
                            
                If 周类今仓 > 0 Then
                    If 周类变仓 <> 0 Then
                        周类今手 = Round(2500 * 周类今仓 / 周类JZ, 2)
                    Else
                        周类今手 = 周类前手
                    End If
                Else
                    周类今手 = 0
                End If
            End If
            '-------------------------------------------------------------------------------
            周类今赚 = 周类前手 * (周类今收 - 周类前收)
            周类累赚 = IIf(周类前仓 > 0, 周类累赚 + 周类今赚, 0)
            周类累持 = IIf(周类今仓 > 0, 周类累持 + 1, 0)
        End If
        '--------------------------------------------------------------------------------
        '回写
        '--------------------------------------------------------------------------------
        ARRLLL(行号遍历, 花偏乙道 + 位os算今仓) = 周类今仓
        ARRLLL(行号遍历, 花偏乙道 + 位os算今手) = 周类今手
        ARRLLL(行号遍历, 花偏乙道 + 位os算今赚) = 周类今赚
        ARRLLL(行号遍历, 花偏乙道 + 位os算累赚) = 周类累赚
        ARRLLL(行号遍历, 花偏乙道 + 位os算累持) = 周类累持
        ARRLLL(行号遍历, 花偏乙道 + 位os算法名) = 规则算法
    '====================================================================================
    '持仓规则：日
    '====================================================================================
        If 规则日类 = True Then
            日类今仓 = 1
        Else
            日类今仓 = 0
        End If
        
        '日类今资 = 日类今仓 * 10000
        '日类今手 = Round(日类今资 / 日类JZ, 2)
        If 日类今仓 > 0 Then
            If 日类前手 = 0 Then 日类今手 = Round(10000 / 日类JZ, 2)
        Else
            日类今手 = 0
        End If
        '--------------------------------------------------------------------------------
        日类今赚 = 日类前手 * (日类今收 - 日类前收)
        日类累赚 = IIf(日类前仓 > 0, 日类累赚 + 日类今赚, 0)
        日类累持 = IIf(日类今仓 > 0, 日类累持 + 1, 0)
        '--------------------------------------------------------------------------------
        '回写
        '--------------------------------------------------------------------------------
        ARRLLL(行号遍历, 花偏甲道 + 位os算今仓) = 日类今仓
        ARRLLL(行号遍历, 花偏甲道 + 位os算今手) = 日类今手
        ARRLLL(行号遍历, 花偏甲道 + 位os算今赚) = 日类今赚
        ARRLLL(行号遍历, 花偏甲道 + 位os算累赚) = 日类累赚
        ARRLLL(行号遍历, 花偏甲道 + 位os算累持) = 日类累持
        ARRLLL(行号遍历, 花偏甲道 + 位os算法名) = 规则算法
    '====================================================================================
    Next 行号遍历
'========================================================================================
'返回
'========================================================================================
返点:
    XL算灌引擎跨期 = 基行
End Function
'########################################################################################
'########################################################################################
'###################################   算灌引擎跨期   ####################################
'########################################################################################
'########################################################################################



'增加一个路数组，ARRAL，作为算法专道
'设置仓位哲学的思考：如果仅仅以是否突破某条均线来设置1/0仓位，其实是用堵的方法；而用多只均线按照权重来设置，是用疏导的办法。
'########################################################################################
'########################################################################################
'###################################   算灌引擎单期   ####################################
'########################################################################################
'########################################################################################
'========================================================================================
'========================================================================================
'算法对比：单期算法
'========================================================================================
'========================================================================================
Function XL算灌引擎单期( _
          ARRLA As Variant _
        , 规则算法 As String _
        ) As Integer
'========================================================================================
'检查
'========================================================================================
    '不设置算法即采用默认算法
    If VBA.IsEmpty(ARRLA) Or Len(规则算法) = 0 Then
        GoTo 返点
    End If
'========================================================================================
'变量声明
'========================================================================================
    Dim 基位 As Integer
    Dim 规则本类 As Boolean
    '====================================================================================
    Dim 本类今日 As Date
    '---------------------
    Dim 本类今收 As Double
    Dim 本类前收 As Double
    '------------------------------------------------
    Dim 本类前仓 As Double
    Dim 本类前手 As Double
    '---------------------
    Dim 本类今仓 As Double
    Dim 本类今手 As Double
    Dim 本类今资 As Long
    Dim 本类今赚 As Long
    Dim 本类累赚 As Long
    Dim 本类累持 As Integer
    '------------------------------------------------
    Dim 本类JZ#, 本类JA#, 本类JB#, 本类JC#, 本类JD#, 本类JE#, 本类JF#, 本类JG#
    Dim 本类BTZA%, 本类BTZB%, 本类BTZC%
    Dim 本类BTAB%
    Dim 本类BTAC%, 本类BTBC%
    Dim 本类BTAD%, 本类BTCD%
    Dim 本类BTAE%, 本类BTCE%, 本类BTDE%
    Dim 本类BTAF%, 本类BTEF%
    Dim 本类BTAG%, 本类BTCG%, 本类BTEG%, 本类BTFG%
    '------------------------------------------------
    Dim 本类阶金 As Integer, 本类阶鍂 As Integer, 本类阶鑫 As String
    Dim 本类阶口 As Integer, 本类阶吕 As Integer, 本类阶品 As String
    Dim 本类阶木 As Integer, 本类阶林 As Integer, 本类阶森 As String
'========================================================================================
'遍历
'========================================================================================
    Dim 行号遍历 As Integer
    For 行号遍历 = LBound(ARRLA, 1) To UBound(ARRLA, 1)
        '================================================================================
        '获取变量
        '================================================================================
        基位 = 花偏甲道
        '------------------------------------------
        本类前仓 = 本类今仓
        本类前手 = 本类今手
        '------------------------------------------
        本类今日 = ARRLA(行号遍历, 基位 + 位os结期)
        本类今收 = ARRLA(行号遍历, 基位 + 位os结收)
        本类前收 = ARRLA(行号遍历, 基位 + 位os前收)
        '------------------------------------------
        本类JZ = ARRLA(行号遍历, 基位 + 位osJZ)
        本类JA = ARRLA(行号遍历, 基位 + 位osJA)
        本类JB = ARRLA(行号遍历, 基位 + 位osJB)
        本类JC = ARRLA(行号遍历, 基位 + 位osJC)
        本类JD = ARRLA(行号遍历, 基位 + 位osJD)
        本类JE = ARRLA(行号遍历, 基位 + 位osJE)
        本类JF = ARRLA(行号遍历, 基位 + 位osJF)
        本类JG = ARRLA(行号遍历, 基位 + 位osJG)
        '------------------------------------------
        本类BTZA = ARRLA(行号遍历, 基位 + 位osBTZA)
        本类BTZB = ARRLA(行号遍历, 基位 + 位osBTZB)
        本类BTAB = ARRLA(行号遍历, 基位 + 位osBTAB)
        本类BTZC = ARRLA(行号遍历, 基位 + 位osBTZC)
        本类BTAC = ARRLA(行号遍历, 基位 + 位osBTAC)
        本类BTBC = ARRLA(行号遍历, 基位 + 位osBTBC)
        本类BTAD = ARRLA(行号遍历, 基位 + 位osBTAD)
        本类BTCD = ARRLA(行号遍历, 基位 + 位osBTCD)
        本类BTAE = ARRLA(行号遍历, 基位 + 位osBTAE)
        本类BTCE = ARRLA(行号遍历, 基位 + 位osBTCE)
        本类BTDE = ARRLA(行号遍历, 基位 + 位osBTDE)
        本类BTAF = ARRLA(行号遍历, 基位 + 位osBTAF)
        本类BTEF = ARRLA(行号遍历, 基位 + 位osBTEF)
        本类BTAG = ARRLA(行号遍历, 基位 + 位osBTAG)
        本类BTCG = ARRLA(行号遍历, 基位 + 位osBTCG)
        本类BTEG = ARRLA(行号遍历, 基位 + 位osBTEG)
        本类BTFG = ARRLA(行号遍历, 基位 + 位osBTFG)
        '------------------------------------------
        本类阶金 = 1 * IIf(本类JE >= 本类JF, 1, 0) + 2 * IIf(本类JE >= 本类JG, 1, 0) + 4 * IIf(本类JF >= 本类JG, 1, 0)
        本类阶鍂 = 1 * IIf(本类JC >= 本类JE, 1, 0) + 2 * IIf(本类JC >= 本类JF, 1, 0) + 4 * IIf(本类JC >= 本类JG, 1, 0)
        本类阶鑫 = CStr(本类阶金) & "_" & CStr(本类阶鍂)
        '------------------------------------------
        本类阶口 = 1 * IIf(本类JC >= 本类JD, 1, 0) + 2 * IIf(本类JC >= 本类JE, 1, 0) + 4 * IIf(本类JD >= 本类JE, 1, 0)
        本类阶吕 = 1 * IIf(本类JA >= 本类JC, 1, 0) + 2 * IIf(本类JA >= 本类JD, 1, 0) + 4 * IIf(本类JA >= 本类JE, 1, 0)
        本类阶品 = CStr(本类阶口) & "_" & CStr(本类阶吕)
        '------------------------------------------
        本类阶木 = 1 * IIf(本类JA >= 本类JB, 1, 0) + 2 * IIf(本类JA >= 本类JC, 1, 0) + 4 * IIf(本类JB >= 本类JC, 1, 0)
        本类阶林 = 1 * IIf(本类JZ >= 本类JA, 1, 0) + 2 * IIf(本类JZ >= 本类JB, 1, 0) + 4 * IIf(本类JZ >= 本类JC, 1, 0)
        本类阶森 = CStr(本类阶木) & "_" & CStr(本类阶林)
        '================================================================================
        
        
    

'########################################################################################
'########################################################################################
'算法归类：非加权算法
'########################################################################################
'########################################################################################
Select Case 规则算法
    '====================================================================================
    '规则：均线
    '====================================================================================
    Case "s@均<ZA>"
        规则本类 = (本类JZ >= 本类JA)
    '--------------------------------
    Case "s@均<ZB>"
        规则本类 = (本类JZ >= 本类JB)
    Case "s@均<AB>"
        规则本类 = (本类JA >= 本类JB)
    '--------------------------------
    Case "s@均<ZC>"
        规则本类 = (本类JZ >= 本类JC)
    Case "s@均<AC>"
        规则本类 = (本类JA >= 本类JC)
    Case "s@均<BC>"
        规则本类 = (本类JB >= 本类JC)
    '--------------------------------
    Case "s@均<AD>"
        规则本类 = (本类JA >= 本类JD)
    Case "s@均<CD>"
        规则本类 = (本类JC >= 本类JD)
    '--------------------------------
    Case "s@均<ZE>"
        规则本类 = (本类JZ >= 本类JE)
    Case "s@均<AE>"
        规则本类 = (本类JA >= 本类JE)
    Case "s@均<BE>"
        规则本类 = (本类JB >= 本类JE)
    Case "s@均<CE>"
        规则本类 = (本类JC >= 本类JE)
    Case "s@均<DE>"
        规则本类 = (本类JD >= 本类JE)
    '--------------------------------
    Case "s@均<AF>"
        规则本类 = (本类JA >= 本类JF)
    Case "s@均<BF>"
        规则本类 = (本类JB >= 本类JF)
    Case "s@均<CF>"
        规则本类 = (本类JC >= 本类JF)
    Case "s@均<DF>"
        规则本类 = (本类JD >= 本类JF)
    Case "s@均<EF>"
        规则本类 = (本类JE >= 本类JF)
    '--------------------------------
    Case "s@均<AG>"
        规则本类 = (本类JA >= 本类JG)
    Case "s@均<CG>"
        规则本类 = (本类JC >= 本类JG)
    Case "s@均<EG>"
        规则本类 = (本类JE >= 本类JG)
    Case "s@均<FG>"
        规则本类 = (本类JF >= 本类JG)
    '====================================================================================
'非均线算法均有待参考，不一定效果好
    '====================================================================================
    '规则：持日 待删除
    '====================================================================================
'    Case "s@持日1"
'        规则本类 = (本类JZ >= 本类JE And 本类JZ >= 本类JF)
'    Case "s@持日2"
'        规则本类 = (本类JZ >= 本类JE And 本类JZ >= 本类JF) And (本类JZ >= 本类JG)
    Case "s@持日"
        规则本类 = (本类JZ >= 本类JE And 本类JZ >= 本类JF) And (本类JZ >= 本类JG) And (本类JZ >= 本类JD)
    Case "s@决策日DE"
        规则本类 = (本类JZ >= 本类JE And 本类JZ >= 本类JE) And (本类JZ >= 本类JG) And (本类JD >= 本类JE)
    '====================================================================================
    '规则：持日 待删除
    '====================================================================================
    Case "s@乾坤C"
        规则本类 = (本类JA >= 本类JF And 本类JC >= 本类JE) And (本类JZ >= 本类JC)
    Case "s@乾坤D"
        规则本类 = (本类JA >= 本类JF And 本类JC >= 本类JE) And (本类JZ >= 本类JD)
    Case "s@乾坤DG"
        规则本类 = (本类JA >= 本类JF And 本类JC >= 本类JE) And (本类JZ >= 本类JD) And (本类JZ >= 本类JG)
    '====================================================================================
    '规则：阶森
    '====================================================================================
    Case "s@阶鑫<IA>"
        规则本类 = (本类阶鑫 = "7_7")
    '------------------------------------------------------------------------------------
    Case "s@阶鑫<IAB>"
        规则本类 = (本类阶鑫 = "7_7") _
                Or (本类阶鑫 = "3_7")
    '------------------------------------------------------------------------------------
    Case "s@阶鑫<IABC>"
        规则本类 = (本类阶鑫 = "7_7") _
                Or (本类阶鑫 = "3_7") _
                Or (本类阶鑫 = "1_7" Or 本类阶鑫 = "1_3")
    '------------------------------------------------------------------------------------
    Case "s@阶鑫<IABCD>"
        规则本类 = (本类阶鑫 = "7_7") _
                Or (本类阶鑫 = "3_7") _
                Or (本类阶鑫 = "1_7" Or 本类阶鑫 = "1_3") _
                Or (本类阶鑫 = "0_7" Or 本类阶鑫 = "0_3")
    '====================================================================================
    '规则：阶品
    '====================================================================================
    Case "s@阶品<IA>"
        规则本类 = (本类阶品 = "7_7")
    '------------------------------------------------------------------------------------
    Case "s@阶品<IAB>"
        规则本类 = (本类阶品 = "7_7") _
                Or (本类阶品 = "3_7")
    '------------------------------------------------------------------------------------
    Case "s@阶品<IABC>"
        规则本类 = (本类阶品 = "7_7") _
                Or (本类阶品 = "3_7") _
                Or (本类阶品 = "1_7" Or 本类阶品 = "1_3")
    '------------------------------------------------------------------------------------
    Case "s@阶品<IABCD>"
        规则本类 = (本类阶品 = "7_7") _
                Or (本类阶品 = "3_7") _
                Or (本类阶品 = "1_7" Or 本类阶品 = "1_3") _
                Or (本类阶品 = "0_7" Or 本类阶品 = "0_3")
    '====================================================================================
    '====================================================================================
    Case "s@常在"
        规则本类 = 1
    Case Else
    '====================================================================================
End Select
本类今仓 = IIf(规则本类, 1, 0)
'########################################################################################
'########################################################################################
'算法归类：无仓位变化
'########################################################################################
'########################################################################################
        '修改 本类今仓 算法，使得仓位参考更多因素
        '修改 规则本类 算法，使得图谱更加光滑，至少在一个趋势之中
        '================================================================================
        '持仓规则：确定仓位
        '================================================================================
        '对于加权算法
        If 规则算法 = "s@均权大周期" Then
            本类今仓 = _
                  IIf(本类JZ >= 本类JF, 1, 0) * 0.5 _
                + IIf(本类JZ >= 本类JE, 1, 0) * 0.2 _
                + IIf(本类JZ >= 本类JD, 1, 0) * 0.2 _
                + IIf(本类JZ >= 本类JC, 1, 0) * 0.1
        
        
        '选择重要性均线进行组合，并赋以适当的权重
        '以下几个算法要废弃
        ElseIf 规则算法 = "s@均权E" Then
            本类今仓 = _
                  IIf(本类JA >= 本类JE, 1, 0) * 0.4 _
                + IIf(本类JA >= 本类JD, 1, 0) * 0.4 _
                + IIf(本类JA >= 本类JC, 1, 0) * 0.2
        ElseIf 规则算法 = "s@均权DE" Then
            本类今仓 = _
                  IIf(本类JA >= 本类JE, 1, 0) * 0.5 _
                + IIf(本类JA >= 本类JD, 1, 0) * 0.5
        ElseIf 规则算法 = "s@均同DE" Then
            本类今仓 = _
                  IIf(本类JA >= 本类JD And 本类JA >= 本类JE, 1, 0)
        ElseIf 规则算法 = "s@均权D" Then
            本类今仓 = _
                  IIf(本类JA >= 本类JD, 1, 0) * 0.5 _
                + IIf(本类JA >= 本类JC, 1, 0) * 0.5
        ElseIf 规则算法 = "s@均权C" Then
            本类今仓 = _
                  IIf(本类JA >= 本类JC, 1, 0) * 0.6 _
                + IIf(本类JA >= 本类JB, 1, 0) * 0.4
        End If
'########################################################################################
'########################################################################################
'########################################################################################
'########################################################################################
        
        
        
        
        

        '================================================================================
        '持仓规则：本类
        '================================================================================
'        本类今资 = 本类今仓 * 10000
'        本类今手 = Round(本类今资 / 本类JZ, 2)
        
        If 本类今仓 > 0 Then
            If 本类前手 = 0 Or 本类今仓 <> 本类前仓 Then
                本类今手 = Round(10000 * 本类今仓 / 本类JZ, 2)
            End If
        Else
            本类今手 = 0
        End If
        '================================================================================
        本类今赚 = 本类前手 * (本类今收 - 本类前收)
        本类累赚 = IIf(本类前仓 > 0, 本类累赚 + 本类今赚, 0)
        本类累持 = IIf(本类今仓 > 0, 本类累持 + 1, 0)
        '================================================================================
        '回写
        '================================================================================
        ARRLA(行号遍历, 花偏甲道 + 位os算今仓) = 本类今仓
        ARRLA(行号遍历, 花偏甲道 + 位os算今手) = 本类今手
        ARRLA(行号遍历, 花偏甲道 + 位os算今赚) = 本类今赚
        ARRLA(行号遍历, 花偏甲道 + 位os算累赚) = 本类累赚
        ARRLA(行号遍历, 花偏甲道 + 位os算累持) = 本类累持
        ARRLA(行号遍历, 花偏甲道 + 位os算法名) = 规则算法
        '================================================================================
    Next 行号遍历
'========================================================================================
'返回
'========================================================================================
返点:
    XL算灌引擎单期 = 基位
End Function
'########################################################################################
'########################################################################################
'###################################   算灌引擎单期   ####################################
'########################################################################################
'########################################################################################





'========================================================================================
'========================================================================================
'功能：算法适用数据的类型 单期/跨期
'========================================================================================
'========================================================================================
Function XL算灌引擎判断算法类型(被研算法 As String) As String
    '------------------------------------------------------------------------------------
    Dim 算法类型 As String
    '------------------------------------------------------------------------------------
    Select Case Left(被研算法, 1)
    Case "S", "T", "B"
        算法类型 = 常算法类型为跨期
    Case Else
        算法类型 = 常算法类型为单期
    End Select
    '------------------------------------------------------------------------------------
    XL算灌引擎判断算法类型 = 算法类型
End Function

