Attribute VB_Name = "ROS据管_DM2池管理"
'需要根据各行业指数的走势（月局、周局）区分：经过长底调整的主升、次升/未经过调整的震荡/下降趋势/底部震荡/顶部震荡
'急需完成的任务








'########################################################################################
'########################################################################################
'##################################    池引擎_索引   #####################################
'########################################################################################
'########################################################################################
'========================================================================================
'========================================================================================
'功能：统计各池的行业分类
'功能：实现各池的排斥勾稽关系
'========================================================================================
'========================================================================================
Sub STBASE池管理_索引调程cCCC_ZW今()
    MSG = STBASE池管理_索引基程(是否索引池今:=True)
    MsgBox MSG, Title:="池索引引擎"
End Sub
'----------------------------------------------------------------------------------------
'以下池具有排斥关系
'----------------------------------------------------------------------------------------
Sub STBASE池管理_索引调程cCCC_ZZ金()
    MSG = STBASE池管理_索引基程(是否索引池金:=True)
    MsgBox MSG, Title:="池索引引擎"
End Sub
Sub STBASE池管理_索引调程cCCC_ZY银()
    MSG = STBASE池管理_索引基程(是否索引池银:=True)
    MsgBox MSG, Title:="池索引引擎"
End Sub
Sub STBASE池管理_索引调程cCCC_ZX铜()
    MSG = STBASE池管理_索引基程(是否索引池铜:=True)
    MsgBox MSG, Title:="池索引引擎"
End Sub
Sub STBASE池管理_索引调程cCCC_ZN黑()
    MSG = STBASE池管理_索引基程(是否索引池黑:=True)
    MsgBox MSG, Title:="池索引引擎"
End Sub
'----------------------------------------------------------------------------------------
'刷新所有池
'以下池具有排斥关系
'----------------------------------------------------------------------------------------
Sub STBASE池管理_索引调程cCCC_金银铜()
    MSG = STBASE池管理_索引基程(实结类型:="cCCC", 是否索引池金:=True, 是否索引池银:=True, 是否索引池铜:=True)
    MsgBox MSG, Title:="池索引引擎"
End Sub
Sub STBASE池管理_索引调程sSCC_金银铜()
    MSG = STBASE池管理_索引基程(实结类型:="sSCC", 是否索引池金:=True, 是否索引池银:=True, 是否索引池铜:=True)
    MsgBox MSG, Title:="池索引引擎"
End Sub
Sub STBASE池管理_索引调程sSSC_金银铜()
    MSG = STBASE池管理_索引基程(实结类型:="sSSC", 是否索引池金:=True, 是否索引池银:=True, 是否索引池铜:=True)
    MsgBox MSG, Title:="池索引引擎"
End Sub
Sub STBASE池管理_索引调程sSSS_金银铜()
    MSG = STBASE池管理_索引基程(实结类型:="sSSS", 是否索引池金:=True, 是否索引池银:=True, 是否索引池铜:=True)
    MsgBox MSG, Title:="池索引引擎"
End Sub
'========================================================================================
'========================================================================================
'这个sub的核心任务就是：寻找符合题材风口且顺应行业走势的龙头股
'========================================================================================
'========================================================================================
Function STBASE池管理_索引基程( _
      Optional ByVal 实结类型 As String = "cCCC" _
    , Optional ByVal 是否索引池金 As Boolean = False _
    , Optional ByVal 是否索引池银 As Boolean = False _
    , Optional ByVal 是否索引池铜 As Boolean = False _
    , Optional ByVal 是否索引池黑 As Boolean = False _
    , Optional ByVal 是否索引池今 As Boolean = False _
    ) As String
'========================================================================================
'验证文件存在
'========================================================================================
'========================================================================================
    UTL宏工具_BEGIN
    '------------------------------------------------------------------------------------
    Dim TT As Long
    TT = Timer
    Dim TTT As Long
    Dim MSG As String
'========================================================================================
'准备：谕组
'========================================================================================
    Dim 计数全息 As Integer
    Dim 谕组 As Variant
    计数全息 = IQQQ跨码据擎_数程生成全息(谕组, 常花中股, 实结类型:=实结类型)
    If 计数全息 = 0 Then
        UTL宏工具_END
        Exit Function
'========================================================================================
'交叉校验五池关系：【池今】与其他池无排斥关系
'作用：去除本池重复
'作用：去除池间重复
'========================================================================================
    Dim 典集池金 As New Dictionary
    Dim 典集池银 As New Dictionary
    Dim 典集池铜 As New Dictionary
    Dim 典集池黑 As New Dictionary
    Dim 典集池今 As New Dictionary
    Dim 典码输出 As New Dictionary
    '------------------------------------------------------------------------------------
    Dim CIDL As String
    Dim X As Integer
    For X = LBound(谕组, 1) To UBound(谕组, 1)
        CIDL = 谕组(X, 1)
        If 谕组(X, 位qt在池) = 常池名金 Then
            If 典集池金.Exists(CIDL) = False Then 典集池金.Add Item:=X, Key:=CIDL
            If 典码输出.Exists(CIDL) = False And 是否索引池金 = True Then 典码输出.Add Item:=X, Key:=CIDL
        ElseIf 谕组(X, 位qt在池) = 常池名银 Then
            If 典集池银.Exists(CIDL) = False Then 典集池银.Add Item:=X, Key:=CIDL
            If 典码输出.Exists(CIDL) = False And 是否索引池银 = True Then 典码输出.Add Item:=X, Key:=CIDL
        ElseIf 谕组(X, 位qt在池) = 常池名铜 Then
            If 典集池铜.Exists(CIDL) = False Then 典集池铜.Add Item:=X, Key:=CIDL
            If 典码输出.Exists(CIDL) = False And 是否索引池铜 = True Then 典码输出.Add Item:=X, Key:=CIDL
        ElseIf 谕组(X, 位qt在池) = 常池名黑 Then
            If 典集池黑.Exists(CIDL) = False Then 典集池黑.Add Item:=X, Key:=CIDL
            If 典码输出.Exists(CIDL) = False And 是否索引池黑 = True Then 典码输出.Add Item:=X, Key:=CIDL
        End If
        If 谕组(X, 位qt今池) <> "" Then
            If 典集池今.Exists(CIDL) = False Then 典集池今.Add Item:=X, Key:=CIDL
            If 典码输出.Exists(CIDL) = False And 是否索引池今 = True Then 典码输出.Add Item:=X, Key:=CIDL
        End If
    Next
'========================================================================================
'整理信息：行业
'注意：每页自上向下搜索从而保证输出自左向右变差
'========================================================================================
    Dim 典集行业 As New Dictionary
    Dim 值行业 As String
    '------------------------------------------------------------------------------------
    '设置全局信息：行业大类
    '------------------------------------------------------------------------------------
    Dim 典集行业大类 As New Dictionary
    Call STBASE池管理_设置必选行业(典集行业大类)
    '------------------------------------------------------------------------------------
    '整理信息：行业
    '补充信息：港股、未分类
    '------------------------------------------------------------------------------------
    For I = 1 To 典码输出.Count
        CIDL = 典码输出.Keys(I - 1)
        X = 典码输出.Items(I - 1)
        值行业 = 谕组(X, 位qt行益)
        If UBCID是港股票(CIDL) = True Then
            值行业 = "港股"
        ElseIf Len(值行业) = 0 Then
            值行业 = "未分类"
        End If
        If 典集行业.Exists(CIDL) = False Then
            典集行业.Add Item:=值行业, Key:=CIDL
        End If
        If 典集行业大类.Exists(值行业) = False Then
            典集行业大类.Add Item:="未分类", Key:=值行业
        End If
    Next
    '----------------------------------------------------------
    Dim 典集行业索引 As New Dictionary
    For I = 1 To 典集行业大类.Count
        典集行业索引.Add Item:=I, Key:=典集行业大类.Keys(I - 1)
    Next
'========================================================================================
'进行列表
'========================================================================================
    '------------------------------------------------------------------------------------
    '建立页
    '------------------------------------------------------------------------------------
    Dim WSTO As Worksheet
    Call PBASE格程工具_表操工表新增(WSTO, 常簿缀选日 & "ZZZ", 基色底:=常色四蓝)
    With WSTO
        .Cells.Interior.Color = 常色主黑
        .Columns(1).Font.Color = 常色主白
        .Columns(2).Font.Color = 常色主白
    End With
    '------------------------------------------------------------------------------------
    '输出纵向索引
    '------------------------------------------------------------------------------------
    Dim 标类宽数 As Integer
    标类宽数 = 2
    Dim 目行输出 As Integer, 目列输出 As Integer
    For I = 1 To 典集行业大类.Count
        目行输出 = 1 + (I - 1) * 标类宽数
        With WSTO.Cells(目行输出, 1)
            .Cells(1, 1) = 典集行业大类.Items(I - 1)
            .Cells(1, 2) = 典集行业大类.Keys(I - 1)
        End With
    Next
    With WSTO
        .Cells.Font.Size = 11
        .Columns.ColumnWidth = 9
        With .Columns(1)
            .ColumnWidth = 8
            .Font.Bold = True
        End With
        With .Columns(2)
            .ColumnWidth = 12
            .Font.Bold = True
        End With
        .Cells(1, 1).Activate
    End With
    '------------------------------------------------------------------------------------
    '遍历输出
    '------------------------------------------------------------------------------------
    Dim 值周层三鳄 As String
    Dim 值注释 As String
    On Error Resume Next
    For I = 1 To 典码输出.Count
            '----------------------------------------------------------------------------
            CIDL = 典码输出.Keys(I - 1)
            定位谕组行号 = 典码输出.Items(I - 1)
            '----------------------------------------------------------------------------
            '定位输出位置
            值行业 = 典集行业(CIDL)
            目行输出 = 1 + (典集行业索引(值行业) - 1) * 标类宽数
            目列输出 = PBASE格程工具_表参末列指定(WSTO, 目行输出) + 1
            '进行输出
            With WSTO.Cells(目行输出, 目列输出)
                '------------------------------------------------------
                .Cells(2, 1) = CIDL
                .Cells(1, 1) = 谕组(定位谕组行号, 位qt代称)
                '设置背景色
                值周层三鳄 = 谕组(定位谕组行号, 位谕of周层三鳄)
                值势局色度 = STBASE结算工具_衍生色度按鳄鱼(值周层三鳄)
                .Cells(1, 1).Interior.Color = 值势局色度
                '------------------------------------------------------
                '设置字体
                If 典集池金.Exists(CIDL) = True Then
                    值池名 = "金"
                    .Font.Size = 11
                    设定scheme = 10        '蓝色
                ElseIf 典集池银.Exists(CIDL) = True Then
                    值池名 = "银"
                    .Font.Size = 10
                    设定scheme = 50        '嫩绿色
                ElseIf 典集池铜.Exists(CIDL) = True Then
                    值池名 = "非"
                    .Font.Size = 9
                    设定scheme = 57        '深绿色
                ElseIf 典集池今.Exists(CIDL) = True Then
                    值池名 = "今"
                    .Font.Size = 10
                    设定scheme = 34        '黄色
                ElseIf 典集池黑.Exists(CIDL) = True Then
                    值池名 = "黑"
                    .Font.Size = 8
                    设定scheme = 34        '黄色
                End If
                '------------------------------------------------------
                '设置注释
                '值注释 = 谕组(定位谕组行号, 位谕of周道乾坤) _
                        & vbCrLf & "池  " & 值池名
                值注释 = vbCrLf & "池  " & 值池名
                With .Cells(1, 1)
                        .Comment.Delete
                        .AddComment
                        .Comment.Visible = False
                        .Comment.Shape.Width = 320
                        .Comment.Shape.Height = 120
                        .Comment.Shape.TextFrame.Characters.Font.Size = 10
                        .Comment.Shape.TextFrame.Characters.Font.Name = "宋体"
                        .Comment.Shape.Fill.Solid
                        .Comment.Text Text:=值注释
                        .Comment.Shape.Fill.ForeColor.SchemeColor = 设定scheme
                End With
                '------------------------------------------------------
            End With
            '----------------------------------------------------------------------------
    Next
    On Error GoTo 0
    Set 典集行业 = Nothing
    Set 典集池名 = Nothing
    Set 典集行号 = Nothing
'========================================================================================
'格式化
'========================================================================================
    '------------------------------------------------------------------------------------
    '隐藏空行
    '------------------------------------------------------------------------------------
    'WSTO.Rows.Hidden = True
    For I = 1 To 典集行业大类.Count
        目行输出 = 1 + (I - 1) * 标类宽数
        With WSTO.Rows(目行输出)
            .Hidden = IIf(Len(.Cells(1, 3)) = 0, True, False)
            .Rows(2).Hidden = True
        End With
    Next
    '------------------------------------------------------------------------------------
    '总结
    '------------------------------------------------------------------------------------
    目行输出 = 1 + (典集行业大类.Count) * 标类宽数
    With WSTO.Cells(目行输出, 1)
        当行 = 1
        .Cells(当行, 1) = "池今" & 常池名今
        .Cells(当行, 2) = 典集池今.Count
        当行 = 当行 + 1
        .Cells(当行, 1) = "池黑" & 常池名黑
        .Cells(当行, 2) = 典集池黑.Count
        当行 = 当行 + 1
        .Cells(当行, 1) = "池白汇总"
        .Cells(当行, 2) = 典集池金.Count + 典集池银.Count + 典集池铜.Count
        当行 = 当行 + 1
        .Cells(当行, 1) = "池金" & 常池名金
        .Cells(当行, 2) = 典集池金.Count
        当行 = 当行 + 1
        .Cells(当行, 1) = "池银" & 常池名银
        .Cells(当行, 2) = 典集池银.Count
        当行 = 当行 + 1
        .Cells(当行, 1) = "池铜" & 常池名铜
        .Cells(当行, 2) = 典集池铜.Count
    End With
    '------------------------------------------------------------------------------------
    '首列合并
    '------------------------------------------------------------------------------------
    Dim 值前类别 As String
    Dim 行始合并 As Integer
    Dim 行终合并 As Integer
    Dim 列待合并 As Integer
    '---------------------------------------------------------------
    '合并：第一列
    列待合并 = 1
    值前类别 = WSTO.Cells(1, 列待合并)
    行始合并 = 1
    For I = 2 To 目行输出
        If WSTO.Cells(I, 列待合并) <> "" Then
            If WSTO.Cells(I, 列待合并) <> 值前类别 Then
                行终合并 = I - 1
                With WSTO.Cells(行始合并, 列待合并).Resize(行终合并 - 行始合并 + 1, 1)
                    .ClearContents
                    .Merge
                    .Value = 值前类别
                    .VerticalAlignment = xlTop
                    .Interior.Color = 常色四靛
                    .Font.Color = 常色六灰
                End With
                With WSTO.Rows(I)
                        .Borders(xlEdgeTop).Color = 常色六灰
                        .Borders(xlEdgeTop).Weight = xlThin
                End With
                值前类别 = WSTO.Cells(I, 列待合并)
                行始合并 = I
            Else
            End If
        End If
    Next
    '---------------------------------------------------------------
    '合并：第二列
    列待合并 = 2
    值前类别 = WSTO.Cells(1, 列待合并)
    行始合并 = 1
    For I = 2 To 目行输出
        If WSTO.Cells(I, 列待合并) <> "" Then
            If WSTO.Cells(I, 列待合并) <> 值前类别 Then
                行终合并 = I - 1
                With WSTO.Cells(行始合并, 列待合并).Resize(行终合并 - 行始合并 + 1, 1)
                    .ClearContents
                    .Merge
                    .Value = 值前类别
                    .VerticalAlignment = xlTop
                    .Interior.Color = 常色四靛
                    .Font.Color = 常色四灰
                End With
                值前类别 = WSTO.Cells(I, 列待合并)
                行始合并 = I
            Else
            End If
        End If
    Next
'========================================================================================
'展示
'========================================================================================
    Dim WB As Workbook
    Set WB = ThisWorkbook
    Dim 表名 As String
    '------------------------------------------------------------------------------------
    '在池
    '------------------------------------------------------------------------------------
    表名 = 常簿缀选日 & 常池名黑
    MSG = MSG & vbCrLf
    MSG = MSG & IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:="月护", 出节模式:="周层", 典码输出:=典集池黑, 是否建表:=True, 章色:=常色八青, 章签:="池黑")
    '------------------------------------------------------------------------------------
    表名 = 常簿缀选日 & 常池名铜
    MSG = MSG & IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:="月护", 出节模式:="周层", 典码输出:=典集池铜, 是否建表:=True, 章色:=常色八青, 章签:="池铜")
    '------------------------------------------------------------------------------------
    表名 = 常簿缀选日 & 常池名银
    MSG = MSG & IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:="月护", 出节模式:="周层", 典码输出:=典集池银, 是否建表:=True, 章色:=常色八青, 章签:="池银")
    '------------------------------------------------------------------------------------
    表名 = 常簿缀选日 & 常池名金
    MSG = MSG & IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:="月护", 出节模式:="周层", 典码输出:=典集池金, 是否建表:=True, 章色:=常色八青, 章签:="池金")
    '------------------------------------------------------------------------------------
    '特殊处理：区分池外/在池
    '------------------------------------------------------------------------------------
    表名 = 常簿缀选日 & 常池名今
'    MSG = MSG & vbCrLf & IQQQ展擎筛程至B1书按池(WB, 表名, 谕组, 典集池今, 是否建表:=True, 章色:=常色二青, 章签:="今池")
    MSG = MSG & IQQQ展擎筛程至C0章按通用(WB, 表名, 谕组, 出章模式:="月护", 出节模式:="周层", 典码输出:=典集池今, 是否建表:=True, 章色:=常色二青, 章签:="池今")
'========================================================================================
'返回
'========================================================================================
    UTL宏工具_END
    '------------------------------------------------------------------------------------
    MSG = MSG & "池索引全部耗时：" & CInt(Timer - TT)
    STBASE池管理_索引基程 = MSG
    Debug.Print MSG
'========================================================================================
End Function



Function STBASE池管理_设置必选行业(典集行业分类 As Dictionary)
    典集行业分类.RemoveAll
'========================================================================================
'设置基本行业分类
'每周进行调整：名单、顺序
'========================================================================================
    With 典集行业分类
        '---------------------------------------
        .Add Item:="必须", Key:="港股"
        .Add Item:="必须", Key:="未分类"
'----------------------------------------------------------------------------------------
'上升趋势
'----------------------------------------------------------------------------------------
        '---------------------------------------
        '类别：TMT
        .Add Item:="TMT行业", Key:="通信设备"
        .Add Item:="TMT行业", Key:="通信服务"
        .Add Item:="TMT行业", Key:="IT设备"
        .Add Item:="TMT行业", Key:="电子设备"
        .Add Item:="TMT行业", Key:="软件服务"
        .Add Item:="TMT行业", Key:="电子元器件"
        .Add Item:="TMT行业", Key:="通用设备"
        .Add Item:="TMT行业", Key:="专用设备"
        '---------------------------------------
        '类别：军工
        .Add Item:="军工制造", Key:="航天国防"
        .Add Item:="军工制造", Key:="船舶制造"
        .Add Item:="军工制造", Key:="仪器仪表"
        .Add Item:="军工制造", Key:="机床设备"
        '---------------------------------------
        '类别：汽车相关
        .Add Item:="汽车制造", Key:="汽车制造"
        .Add Item:="汽车制造", Key:="汽车服务"
        .Add Item:="汽车制造", Key:="电机"
        .Add Item:="汽车制造", Key:="汽车零部件"
        '---------------------------------------
        '类别：碳中和
        .Add Item:="电力", Key:="电力"
        .Add Item:="电力", Key:="电气智能化设备"
        .Add Item:="电力", Key:="高低压设备"
        .Add Item:="电力", Key:="电源设备"
        '---------------------------------------
        '类别：原材料
        .Add Item:="原材料", Key:="化学制品"
        .Add Item:="原材料", Key:="化学原料"
        .Add Item:="原材料", Key:="金属制品"
        .Add Item:="原材料", Key:="新材料"
        .Add Item:="原材料", Key:="玻璃制造"
        .Add Item:="原材料", Key:="塑料"
        .Add Item:="原材料", Key:="造纸"
        '---------------------------------------
        '类别：人口刺激
        .Add Item:="文化娱乐", Key:="互联网传媒"
        .Add Item:="文化娱乐", Key:="文化传媒"
        .Add Item:="文化娱乐", Key:="营销传播"
        .Add Item:="文化娱乐", Key:="包装印刷"
        '---------------------------------------
        '类别：交运类
        .Add Item:="交运", Key:="航空运输"
        .Add Item:="交运", Key:="高速公路"
        .Add Item:="交运", Key:="港口"
        .Add Item:="交运", Key:="水上运输"
        .Add Item:="交运", Key:="公共交通"
        .Add Item:="交运", Key:="铁路运输"
        .Add Item:="交运", Key:="仓储物流"
        .Add Item:="交运", Key:="其他交运设备"
        '---------------------------------------
        .Add Item:="关税", Key:="纺织"
        .Add Item:="关税", Key:="服装"
        .Add Item:="关税", Key:="轻工产品"
        .Add Item:="关税", Key:="化纤"
        .Add Item:="关税", Key:="贸易"
'----------------------------------------------------------------------------------------
'震荡
'----------------------------------------------------------------------------------------
        '---------------------------------------
        '类别：基建类
        .Add Item:="基建", Key:="工程建筑"
        .Add Item:="基建", Key:="工程机械"
        .Add Item:="基建", Key:="水泥"
        .Add Item:="基建", Key:="建材"
        .Add Item:="基建", Key:="轻工机械"
        .Add Item:="基建", Key:="重型机械"
        '---------------------------------------
        '类别：石油石化
        .Add Item:="石化碳中和", Key:="石油石化"
        .Add Item:="石化碳中和", Key:="采掘服务业"
        .Add Item:="石化碳中和", Key:="其他采掘"
        '---------------------------------------
        '类别：黑色
        .Add Item:="黑色碳中和", Key:="煤炭开采"
        .Add Item:="黑色碳中和", Key:="有色金属"
        .Add Item:="黑色碳中和", Key:="钢铁"
        '---------------------------------------
        '类别：环保 碳中和
        .Add Item:="环保", Key:="环境保护"
        .Add Item:="环保", Key:="园林工程"
        .Add Item:="环保", Key:="公用事业"
        .Add Item:="环保", Key:="综合行业"
'----------------------------------------------------------------------------------------
'下降趋势
'----------------------------------------------------------------------------------------
        '---------------------------------------
        '类别：大消费
        .Add Item:="消费", Key:="景点"
        .Add Item:="消费", Key:="旅游综合"
        .Add Item:="消费", Key:="酒店餐饮"
        .Add Item:="消费", Key:="零售业"
        .Add Item:="消费", Key:="影视动漫"
        '---------------------------------------
        '类别：月2e
        .Add Item:="大消费", Key:="饮料制造"
        .Add Item:="大消费", Key:="酿酒"
        .Add Item:="大消费", Key:="食品加工"
        '---------------------------------------
        '类别：医疗行业
        .Add Item:="医疗行业", Key:="医药制造"
        .Add Item:="医疗行业", Key:="生物制品"
        .Add Item:="医疗行业", Key:="中药"
        .Add Item:="医疗行业", Key:="医疗服务"
        .Add Item:="医疗行业", Key:="医疗器械"
        .Add Item:="医疗行业", Key:="医药流通"
        '---------------------------------------
        '类别：房地产
        .Add Item:="房地产", Key:="房地产"
        .Add Item:="房地产", Key:="装修装饰"
        .Add Item:="房地产", Key:="家电"
        '---------------------------------------
        '类别：金融
        .Add Item:="金融", Key:="银行"
        .Add Item:="金融", Key:="证券期货"
        .Add Item:="金融", Key:="多元金融"
        '---------------------------------------
        '类别：农业
        .Add Item:="农业", Key:="农林"
        .Add Item:="农业", Key:="化肥"
        .Add Item:="农业", Key:="农药"
        .Add Item:="农业", Key:="牧渔"
        .Add Item:="农业", Key:="饲料加工"
        .Add Item:="农业", Key:="农业服务"
        '---------------------------------------
    End With
End Function
'########################################################################################
'########################################################################################
'##################################    池引擎_索引   #####################################
'########################################################################################
'########################################################################################








'########################################################################################
'##################################   STBASE池管理_归入  ###################################
'########################################################################################
Sub STBASE池管理_归入调程ZW池今()
    Call UGSOP拣选引擎花册归集子程(设置值:=常池名今, 设置列:=位列花天今池)
End Sub
Sub STBASE池管理_归入调程ZZ池金()
    Call UGSOP拣选引擎花册归集子程(设置值:=常池名金, 设置列:=位列花天在池)
End Sub
Sub STBASE池管理_归入调程ZY池银()
    Call UGSOP拣选引擎花册归集子程(设置值:=常池名银, 设置列:=位列花天在池)
End Sub
Sub STBASE池管理_归入调程ZX池铜()
    Call UGSOP拣选引擎花册归集子程(设置值:=常池名铜, 设置列:=位列花天在池)
End Sub
Sub STBASE池管理_归入调程ZN池黑()
    Call UGSOP拣选引擎花册归集子程(设置值:=常池名黑, 设置列:=位列花天在池)
End Sub
'########################################################################################
'##################################   STBASE池管理_归出  ###################################
'########################################################################################
Sub STBASE池管理_归出调程池今()
    Call UGSOP拣选引擎花册归集子程(设置值:="", 设置列:=位列花天今池)
End Sub
Sub STBASE池管理_归出调程池全()
    Call UGSOP拣选引擎花册归集子程(设置值:="", 设置列:=位列花天在池)
End Sub
Sub STBASE池管理_归出调程仓宝彦()
    Call UGSOP拣选引擎花册归集子程(设置值:="", 设置列:=位列花天仓宝彦)
End Sub
Sub STBASE池管理_归出调程仓宝福()
    Call UGSOP拣选引擎花册归集子程(设置值:="", 设置列:=位列花天仓宝福)
End Sub
'########################################################################################
'########################################################################################
'########################################################################################
Function UGSOP拣选引擎花册归集子程( _
          ByVal 设置值 As String _
        , Optional ByVal 设置列 As Integer = 位列花天在池 _
        ) As Integer
'========================================================================================
    UTL宏工具_BEGIN
'========================================================================================
'归集
'========================================================================================
    Dim WSIN As Worksheet
    Set WSIN = ActiveSheet
    '因为引用了ActiveSheet，所以必须放到下面建页的前面
    Dim 当前表名 As String
    当前表名 = WSIN.Name
    '------------------------------------------------------------------------------------
    Dim 集合归集代码 As New Dictionary
    Dim 计数归集 As Integer
    计数归集 = UGSOP拣选质程_归集代码从通用(集合归集代码, WSIN)
    Set WSIN = Nothing
'========================================================================================
'花册设置
'========================================================================================
    '====================================================================================
    '验证文件存在
    '====================================================================================
    Dim WS花册 As Worksheet
    If STBASE外簿工具_花册链接(WS花册, 常花中股) = False Then
        Debug.Print 常花中股 & "不存在"
        UTL宏工具_END
        Exit Function
    End If
    '====================================================================================
    '输入
    '====================================================================================
    Dim 组花册 As Variant
    Call UTL数据转换_集WS2ARR(组花册, WS花册, 始行:=2, 始列:=1, 总列:=花宽主道)
    '====================================================================================
    '设置：信息
    '====================================================================================
    For X = LBound(组花册, 1) To UBound(组花册, 1)
                        '----------------------------------------------------------------
                        CIDL = 组花册(X, 位列花天CIDL)
                        If UBCID是代码(CIDL) = True Then
                            If 集合归集代码.Exists(CIDL) = True Then
                                If 设置值 = 常池名金 Then
                                    组花册(X, 设置列) = 设置值
                                Else
                                    组花册(X, 设置列) = 设置值
                                End If
                            End If
                        End If
                        '----------------------------------------------------------------
    Next
    '====================================================================================
    '输出：花册
    '====================================================================================
    Call UTL数据转换_集ARR2WS(组花册, WS花册, 始行:=2, 始列:=1)
    Erase 组花册
    Set WS花册 = Nothing
'========================================================================================
'返回
'========================================================================================
    UTL宏工具_END
    UGSOP拣选引擎花册归集子程 = MSG
End Function






'########################################################################################
'##################################   池引擎_控制显隐  ###################################
'########################################################################################
Sub STBASE池管理_清理池金银非黑()
    UTL宏工具_BEGIN
    '====================================================================================
    '更新花册
    '====================================================================================
    MSG = STCALL花册管理_重制花天P9正程设置信息(是否更新在池:=True)
    '====================================================================================
    '删除
    '====================================================================================
    Application.DisplayAlerts = False
    Dim 表名池 As String
    表名池 = 常池名金
    If UTL判断工表存在(表名池) = True Then ThisWorkbook.Sheets(表名池).Delete
    表名池 = 常池名银
    If UTL判断工表存在(表名池) = True Then ThisWorkbook.Sheets(表名池).Delete
    表名池 = 常池名铜
    If UTL判断工表存在(表名池) = True Then ThisWorkbook.Sheets(表名池).Delete
    表名池 = 常池名黑
    If UTL判断工表存在(表名池) = True Then ThisWorkbook.Sheets(表名池).Delete
    Application.DisplayAlerts = True
    '====================================================================================
    UTL宏工具_END
End Sub
'########################################################################################
'########################################################################################
'########################################################################################



'########################################################################################
'########################################################################################
'##################################   池引擎_表导入  #####################################
'########################################################################################
'########################################################################################
'========================================================================================
'功能：从桌面导入固定文件
'金1/银2/非3/今4/
'========================================================================================
Public Sub STBASE池管理_表导入调程由指定文件池五()
    '====================================================================================
    Dim 指定池名 As String
    Dim 导入路径 As String
    Dim 导入计数 As Integer
    Dim MSG As String
    '====================================================================================
    '导入
    '====================================================================================
    MSG = "导入文件计数："
    '------------------------------------------------------------------------------------
    指定池名 = 常池名今
    导入路径 = "C:\Users\SharkWork\Desktop\0.xls"
    导入计数 = STBASE池管理_表导入基程由指定文件(指定池名, 导入路径)
    MSG = MSG & vbCrLf & ">>" & 指定池名 & "：" & 导入计数
    '------------------------------------------------------------------------------------
    '------------------------------------------------------------------------------------
    指定池名 = 常池名金
    导入路径 = "C:\Users\SharkWork\Desktop\1.xls"
    导入计数 = STBASE池管理_表导入基程由指定文件(指定池名, 导入路径)
    MSG = MSG & vbCrLf & ">>" & 指定池名 & "：" & 导入计数
    '------------------------------------------------------------------------------------
    指定池名 = 常池名银
    导入路径 = "C:\Users\SharkWork\Desktop\2.xls"
    导入计数 = STBASE池管理_表导入基程由指定文件(指定池名, 导入路径)
    MSG = MSG & vbCrLf & ">>" & 指定池名 & "：" & 导入计数
    '------------------------------------------------------------------------------------
    指定池名 = 常池名铜
    导入路径 = "C:\Users\SharkWork\Desktop\3.xls"
    导入计数 = STBASE池管理_表导入基程由指定文件(指定池名, 导入路径)
    MSG = MSG & vbCrLf & ">>" & 指定池名 & "：" & 导入计数
    '------------------------------------------------------------------------------------
    指定池名 = 常池名黑
    导入路径 = "C:\Users\SharkWork\Desktop\4.xls"
    导入计数 = STBASE池管理_表导入基程由指定文件(指定池名, 导入路径)
    MSG = MSG & vbCrLf & ">>" & 指定池名 & "：" & 导入计数
    '====================================================================================
    '更新花册
    '====================================================================================
    MSG = MSG & vbCrLf & STCALL花册管理_重制花天P9正程设置信息(是否更新在池:=True)
    '====================================================================================
    '索引
    '主要目的：输出五池
    '====================================================================================
    MSG = MSG & vbCrLf & STBASE池管理_索引基程(实结类型:="cCCC", 是否索引池金:=True, 是否索引池银:=True, 是否索引池铜:=True)
    '====================================================================================
    '返回
    '====================================================================================
    MsgBox MSG, vbOKOnly, "池导入 & 池索引"
End Sub
'========================================================================================
'TS：导入文件 由弹出框选择文件
'可接受文件类型包括：益盟到处文件/本程序导出文件
'========================================================================================
Public Function STBASE池管理_表导入基程由选择文件(表名输出 As String) As String
    '------------------------------------------------------------------------------------
    Dim FILEOPEN
    FILEOPEN = Application.GetOpenFilename("xls文件,*.xls*", , "请选择持仓文件：益盟/本程序导出文件", , False)
    If FILEOPEN = False Then
        Exit Function
    End If
    '------------------------------------------------------------------------------------
    Dim 导入路径 As String
    导入路径 = FILEOPEN
    Dim 计数导入 As Integer
    计数导入 = STBASE池管理_表导入基程由指定文件(表名输出, 导入路径)
    '------------------------------------------------------------------------------------
    MSG = "工表已导入：" & 表名输出 _
        & vbCrLf & "股数已导入：" & 计数导入
    STBASE池管理_表导入基程由选择文件 = MSG
    'MsgBox MSG, vbOKOnly, "池导入"
    '------------------------------------------------------------------------------------
End Function
Public Sub STBASE池管理_表导入调程由选择文件池今()
    '====================================================================================
    Dim 指定池名 As String
    Dim 导入路径 As String
    Dim 导入计数 As Integer
    Dim MSG As String
    '====================================================================================
    '导入
    '====================================================================================
    MSG = "导入文件计数："
    '------------------------------------------------------------------------------------
    指定池名 = 常池名今
    MSG = MSG & vbCrLf & STBASE池管理_表导入基程由选择文件(指定池名)
    MSG = MSG & vbCrLf & ">>" & 指定池名 & "：" & 导入计数
    '====================================================================================
    '更新花册
    '====================================================================================
    MSG = MSG & vbCrLf & STCALL花册管理_重制花天P9正程设置信息(是否更新在池:=True)
    '====================================================================================
    '索引
    '主要目的：输出五池
    '====================================================================================
    UTL宏工具_BEGIN
    'MSG = MSG & vbCrLf & STBASE池管理_索引基程(实结类型:="sSCC", 是否索引池今:=True, 是否索引池铜:=False)
    Call IQQQ乾坤分布质程(常池名今, 常花中股, 实结类型:="sSCC", 采样列号:=位列花天今池, 采样列值:=常池名今, 基色底:=常色主黑, 出章模式:="月护", 出节模式:="日层")
    '====================================================================================
    '返回
    '====================================================================================
    UTL宏工具_END
    MsgBox MSG, vbOKOnly, "池导入 & 池索引"
End Sub
'========================================================================================
'========================================================================================
'注20260526：临时导入，用于对益盟自选股进行排序，不进入花册。
'========================================================================================
'========================================================================================
Public Sub STBASE池管理_表导入调程由选择文件池临时()
    '====================================================================================
    Dim 指定池名 As String
    Dim 导入路径 As String
    Dim 导入计数 As Integer
    Dim MSG As String
    '====================================================================================
    '导入
    '====================================================================================
    MSG = "导入文件计数："
    指定池名 = 常簿缀选日 & "临"
    UTL宏工具_BEGIN
    MSG = MSG & vbCrLf & STBASE池管理_表导入基程由选择文件(指定池名)
    UTL宏工具_END
    '-------------------------------
    UTL宏工具_BEGIN
    Call IQQQ展擎瓜页引擎基程(ThisWorkbook.Sheets(指定池名), 瓜分类型:="日乾日层", 实结类型:="sSCC", 基色底:=常色十蓝)
    MSG = MSG & vbCrLf & ">>" & 指定池名 & "：" & 导入计数
    UTL宏工具_END
    '====================================================================================
    '返回
    '====================================================================================
    MsgBox MSG, vbOKOnly, "临时导入，用于对益盟自选股进行排序，不进入花册。"
End Sub


'========================================================================================
'========================================================================================
'TS：导入文件 由指定文件位置
'可接受文件类型包括：益盟到处文件/本程序导出文件
'========================================================================================
'========================================================================================
Public Function STBASE池管理_表导入基程由指定文件(表名输出 As String, FILEOPEN As String) As Integer
'========================================================================================
'验证文件是否存在
'========================================================================================
    If UTL判断文件存在(FILEOPEN) = False Then Exit Function
'========================================================================================
'导入数组
'========================================================================================
    'Application.DisplayAlerts = False
    '-------------------------------
    Dim 所在区域 As Range
    Dim 位列TS代码 As Integer
    Dim 位元TS代码 As Range
    '-------------------------------
    Dim WBTS As Workbook
    Set WBTS = GetObject(FILEOPEN)
    Dim ARRTS  As Variant
    With WBTS.ActiveSheet
            Set 所在区域 = .Cells(1, 1).CurrentRegion
            ARRTS = 所在区域
            
            Set 位元TS代码 = 所在区域.Rows(1).Find(What:="代码")
            If 位元TS代码 Is Nothing Then
                Set 位元TS代码 = 所在区域.Rows(1).Find(What:="CID")
            End If
            If 位元TS代码 Is Nothing Then
                MsgBox "错误：代码列未找到"
                Exit Function
            Else
                位列TS代码 = 位元TS代码.Column
            End If
            Set 位元TS代码 = Nothing
            Set 所在区域 = Nothing
    End With
    WBTS.Close False
    Set WBTS = Nothing
    '-------------------------------
    'Application.DisplayAlerts = True
'========================================================================================
'常花中股：导入股票列表
'========================================================================================
    Dim 工表持仓 As Worksheet
    Call PBASE格程工具_表操工表新增(工表持仓, 表名输出, WB:=ThisWorkbook, 基色底:=常色主靛)
'========================================================================================
'常花中股：导入股票列表
'========================================================================================
    Dim sdate As String
    Dim CIDV As Variant
    '====================================================================================
    '导入
    '====================================================================================
    Dim 计数导入 As Integer
    Dim 主列行号 As Integer
    Dim 遍历序号 As Integer
    计数导入 = 0
    主列行号 = 1
    For 遍历序号 = LBound(ARRTS, 1) + 1 To UBound(ARRTS, 1)
        '--------------------------------------------------------------------------------
        '处理代码
        '--------------------------------------------------------------------------------
        CIDV = ARRTS(遍历序号, 位列TS代码)
        计数导入 = 计数导入 + 1
        主列行号 = 主列行号 + 1
        工表持仓.Cells(主列行号, 1) = UBCID规制代码(CIDV)
        '--------------------------------------------------------------------------------
        Debug.Print "益盟股票池导入>>>"; 遍历序号
        '--------------------------------------------------------------------------------
    Next
    Erase ARRTS
'========================================================================================
'更新
'========================================================================================
    UTL宏工具_BEGIN
    Call IQQQ展擎瓜页引擎基程(工表持仓, "更新排否", 实结类型:="sSCC", 基色底:=常色指金)
    Set 工表持仓 = Nothing
    UTL宏工具_END
'========================================================================================
    STBASE池管理_表导入基程由指定文件 = 计数导入
End Function
'########################################################################################
'########################################################################################
'##################################   池引擎_表导入  #####################################
'########################################################################################
'########################################################################################









'########################################################################################
'########################################################################################
'##################################   池引擎_表导出  #####################################
'########################################################################################
'########################################################################################
'========================================================================================
'注20220824：由于池信息均已写入花册，完全可以借用花册的快照导入导出功能。
Public Sub STBASE池管理_表导出调程池全()
    Call STCALL花册工具_快照导出通程(常花中股)
End Sub
'========================================================================================
'########################################################################################
'########################################################################################
'##################################   池引擎_表导出  #####################################
'########################################################################################
'########################################################################################








'########################################################################################
'########################################################################################
'##################################   池甄别  池黑  #####################################
'########################################################################################
'########################################################################################
'========================================================================================
'========================================================================================
'功能：查看股性分布，主要用来调试池黑
'========================================================================================
'========================================================================================
Sub STBASE池管理甄别调程_查看股性分布池黑()
    Dim 典码称 As New Dictionary
    Call STCALL花册工具_提取典码花天按市池(典码称, 包含市指:=False, 包含市基:=False, 包含市票:=True, 是否池金:=False, 是否池银:=False, 是否池铜:=False, 是否池外:=False, 是否池黑:=True, 测试限数:=-1)
    MSG = STBASE池管理甄别调程_查看股性分布正程(典码称, 章色:=常色八黄)
    MsgBox MSG, vbOKOnly, "查看股性分布"
    Debug.Print MSG
End Sub
Sub STBASE池管理甄别调程_查看股性分布非池黑()
    Dim 典码称 As New Dictionary
    Call STCALL花册工具_提取典码花天按市池(典码称, 包含市指:=False, 包含市基:=False, 包含市票:=True, 是否池金:=True, 是否池银:=True, 是否池铜:=True, 是否池外:=True, 是否池黑:=False, 测试限数:=-1)
    MSG = STBASE池管理甄别调程_查看股性分布正程(典码称, 章色:=常色八绿)
    MsgBox MSG, vbOKOnly, "查看股性分布"
    Debug.Print MSG
End Sub
Sub STBASE池管理甄别调程_查看股性分布全池()
    Dim 典码称 As New Dictionary
    Call STCALL花册工具_提取典码花天按市池(典码称, 包含市指:=False, 包含市基:=False, 包含市票:=True, 是否池金:=True, 是否池银:=True, 是否池铜:=True, 是否池外:=True, 是否池黑:=True, 测试限数:=-1)
    MSG = STBASE池管理甄别调程_查看股性分布正程(典码称, 章色:=常色六绿)
    MsgBox MSG, vbOKOnly, "查看股性分布"
    Debug.Print MSG
End Sub

Function STBASE池管理甄别调程_查看股性分布正程(典码称 As Dictionary, Optional ByVal 章色 As Long = 常色八黄)
    '------------------------------------------------------------------------------------
    '制作谕组
    '------------------------------------------------------------------------------------
    Dim 谕组 As Variant
    计数全息 = IQQQ跨码据擎_数程生成全息(谕组, 常花中股, 采样典码:=典码称, 实结类型:="cCCC")
    '------------------------------------------------------------------------------------
    '制作典码位
    '------------------------------------------------------------------------------------
    Dim 典码位 As New Dictionary
    Dim 码数 As Integer
    码数 = UTL数据转换_集典码2典码位(典码位, 谕组, 典码称)
    '------------------------------------------------------------------------------------
    '查看股性分布
    '------------------------------------------------------------------------------------
    Dim WB As Workbook
    Set WB = ThisWorkbook
    UTL宏工具_BEGIN
    MSG = IQQQ展擎筛程至A9册按股性(WB, 谕组, 典码位, 章色:=章色)
    UTL宏工具_END
    '------------------------------------------------------------------------------------
    STBASE池管理甄别调程_查看股性分布正程 = MSG
End Function
'########################################################################################
'########################################################################################
'##################################   池甄别  池黑  #####################################
'########################################################################################
'########################################################################################




