Attribute VB_Name = "UTL_基4据工具"



'########################################################################################
'##################################    UTL数据转换     ##################################
'########################################################################################
Private Sub 测试_UTL数据转换_串2组4腾历()
    Dim aLINE As Variant
    Dim sLINE As String
    Dim aLINE As Variant
    '---------------------------------------------------------------------------------
    Dim 原件代码 As String
    原件代码 = "sh600113"
    Dim 指定文夹 As String
    指定文夹 = 全设基夹中股
    Dim 原件路径 As String
    原件路径 = 指定文夹 & "\" & 原件代码 & ".csv"
    Dim 指定路径 As String
    指定路径 = 原件路径
    Dim FileNum
    FileNum = FreeFile()
    Open 指定路径 For Input As #FileNum
    Do While Not EOF(1)
        Line Input #FileNum, sLINE
        读入行号 = 读入行号 + 1
        If 读入行号 = 4 Then Exit Do
    Loop
    Close #FileNum
    '---------------------------------------------------------------------------------
    Debug.Print UTL数据转换_串2组4CSV(aLINE, sLINE)
    Debug.Print UTL数据转换_组转串4CSV(aLINE)
    '---------------------------------------------------------------------------------
    aLINE = Split(sLINE, ",")
    Debug.Print LBound(aLINE); UBound(aLINE)
    '---------------------------------------------------------------------------------
'    For I = LBound(aLINE) To UBound(aLINE)
'        Debug.Print I, aLINE(I)
'    Next
    '---------------------------------------------------------------------------------
End Sub


'########################################################################################
'##################################    UTL数据转换      ##################################
'########################################################################################
'========================================================================================
'功能：将CSV行串 转化为 数组
'========================================================================================
Function UTL数据转换_串2组4腾历(aLINE As Variant, sLINE As String) As Integer
        If Not sLINE Like "###### *" Then Exit Function
        '--------------------------------------------------------------------------------
        ARR = Split(sLINE, " ")
        If UBound(ARR) >= 5 Then
            UTL数据转换_串2组4腾历 = UBound(ARR) - LBound(ARR) + 1
            
            ReDim aLINE(位列TS下限 To 位列TS上限单期) As Variant
            sdate = ARR(0)
            aLINE(位列TS结期) = DateSerial(Left(sdate, 2), Mid(sdate, 3, 2), Mid(sdate, 5, 2))
            aLINE(位列TS结开) = ARR(1)
            aLINE(位列TS结收) = ARR(2)
            aLINE(位列TS结高) = ARR(3)
            aLINE(位列TS结低) = ARR(4)
            'aLINE(位列TS结量) = arr(5)
        Else
            UTL数据转换_串2组4腾历 = 0
        End If
        '--------------------------------------------------------------------------------
        '        arr = Split(sLINE, " ")
        '        sdate = arr(0)
        '        今日 = DateSerial(Left(sdate, 2), Mid(sdate, 3, 2), Mid(sdate, 5, 2))
        '        今收 = arr(2)
        '        今开 = arr(1)
        '        今高 = arr(3)
        '        今低 = arr(4)
        '        今量 = arr(5)
        '--------------------------------------------------------------------------------
End Function

'========================================================================================
'功能：将CSV行数组 转化为 存储在藏库单元内数串
'========================================================================================
Function UTL数据转换_组转串4CSV(aLINE As Variant) As String
        If UBound(aLINE) < 位列TS结收 Then Exit Function
        '--------------------------------------------------------------------------------
        ReDim ARRLINE(位列TS下限 To 位列TS上限单期) As Variant
        ARRLINE(位列TS结高) = aLINE(位列TS结高)
        ARRLINE(位列TS结低) = aLINE(位列TS结低)
        ARRLINE(位列TS结收) = aLINE(位列TS结收)
        UTL数据转换_组转串4CSV = Join(ARRLINE, ",")
        Erase ARRLINE
        '--------------------------------------------------------------------------------
End Function

'========================================================================================
'功能：将CSV行串 转化为 数组
'========================================================================================
Function UTL数据转换_串2组4CSV(aLINE As Variant, sLINE As String) As Integer
        aLINE = Split("," & sLINE, ",") '前面加一个都好可以使引用数组不需要减去1
        If UBound(aLINE) >= 位列TS结收 Then
            UTL数据转换_串2组4CSV = UBound(aLINE) - LBound(aLINE) + 1
        Else
            UTL数据转换_串2组4CSV = 0
        End If
        '--------------------------------------------------------------------------------
'        For Y = 位列TS结开  To 位列TS上限单期
'            If VBA.IsNumeric(aLINE(Y)) = False Then
'                If Len(aLINE(Y)) > 0 Then
'                    aLINE(Y) = CDbl(aLINE(Y))
'                Else
'                    aLINE(Y) = 0
'                End If
'            End If
'        Next
        '--------------------------------------------------------------------------------
End Function
'########################################################################################
'##################################    UTL数据转换      ##################################
'########################################################################################







'########################################################################################
'##################################    UTL  集转换      ##################################
'########################################################################################
'========================================================================================
'========================================================================================
'功能：将字典转变为数组
'========================================================================================
'========================================================================================
Function UTL数据转换_集典码2组码( _
          组码 As Variant _
        , 典码 As Dictionary _
        , Optional 组宽 As Integer = 花宽主道 _
        ) As Integer
    '------------------------------------------------------------------------------------
    If 典码 Is Nothing Then Exit Function
    If 典码.Count = 0 Then Exit Function
    '---------------------------------------
    ReDim 组码(1 To 典码.Count, 1 To 组宽) As Variant
    For X = 1 To 典码.Count
        组码(X, 1) = 典码.Keys(X - 1)
    Next
    '------------------------------------------------------------------------------------
    UTL数据转换_集典码2组码 = 典码.Count
End Function
'========================================================================================
'========================================================================================
'功能：将数组转变为字典
'========================================================================================
'========================================================================================
Function UTL数据转换_集组码2典码位( _
          典码位 As Dictionary _
        , 组码 As Variant _
        ) As Integer
    '------------------------------------------------------------------------------------
    If VBA.IsMissing(组码) = True Then Exit Function
    If VBA.IsEmpty(组码) = True Then Exit Function
    '------------------------------------------------------------------------------------
    Dim 典码位组码 As New Dictionary
    Dim CIDL As String
    Dim X As Integer
    For X = LBound(组码, 1) To UBound(组码, 1)
        CIDL = 组码(X, 1)
        If UBCID是代码(CIDL) = True And 典码位组码.Exists(CIDL) = False Then
            典码位组码.Add Item:=X, Key:=CIDL
        End If
    Next
    Set 典码位 = 典码位组码
    Set 典码位组码 = Nothing
    '------------------------------------------------------------------------------------
    UTL数据转换_集组码2典码位 = 典码位.Count
End Function
'========================================================================================
'========================================================================================
'功能：根据典码中的代码，链接到组码中位置，输出到典码位
'========================================================================================
'========================================================================================
Function UTL数据转换_集典码2典码位( _
          典码位 As Dictionary _
        , 组码 As Variant _
        , 典码 As Dictionary _
        ) As Integer
    '------------------------------------------------------------------------------------
    If VBA.IsMissing(组码) = True Then Exit Function
    If VBA.IsEmpty(组码) = True Then Exit Function
    '------------------------------------------------------------------------------------
    For X = LBound(组码, 1) To UBound(组码, 1)
        CIDL = 组码(X, 位qt代码)
        If UBCID是代码(CIDL) = True Then
        If 典码.Exists(CIDL) = True Then
            典码位.Add Key:=CIDL, Item:=X
        End If
        End If
    Next
    '------------------------------------------------------------------------------------
    UTL数据转换_集典码2典码位 = 典码位.Count
End Function
'========================================================================================
'========================================================================================
'功能：将WS所有首列CIDL转变为字典
'========================================================================================
'========================================================================================
Function UTL数据转换_集WS2典码( _
          典码 As Dictionary _
        , WS As Worksheet _
        , Optional 始行 As Integer = 2 _
        , Optional 始列 As Integer = 1 _
        , Optional 总行 As Integer = 0 _
        , Optional 总列 As Integer = 花宽全道 _
        ) As Integer
    '------------------------------------------------------------------------------------
    If 始行 <= 0 Then Exit Function
    If 总行 = 0 Then
        总行 = PBASE格程工具_表参末行指定(WS, 始列) - 始行 + 1
    End If
    If 总行 > 0 Then
        Dim ARR As Variant
        ARR = WS.Cells(始行, 始列).Resize(总行, 总列)
        Call UTL数据转换_集组码2典码位(典码, ARR)
        Erase ARR
    End If
    '------------------------------------------------------------------------------------
    UTL数据转换_集WS2典码 = 典码.Count
End Function
Function UTL数据转换_集WS名2典码( _
          典码 As Dictionary _
        , WS名 As String _
        , Optional WB As Workbook _
        , Optional 始行 As Integer = 2 _
        , Optional 始列 As Integer = 1 _
        , Optional 总行 As Integer = 0 _
        , Optional 总列 As Integer = 花宽全道 _
        ) As Integer
    '------------------------------------------------------------------------------------
    If WB Is Nothing Then Set WB = ThisWorkbook
    If UTL判断工表存在(WS名, WB) = True Then
        Call UTL数据转换_集WS2典码(典码, WB.Sheets(WS名))
    End If
    '------------------------------------------------------------------------------------
    UTL数据转换_集WS名2典码 = 典码.Count
End Function



'========================================================================================
'========================================================================================
'二维数组输出
'========================================================================================
'========================================================================================
Function UTL数据转换_集ARR2WS( _
          ByRef ARR As Variant _
        , ByRef WS As Worksheet _
        , Optional ByVal 始行 As Integer = 2 _
        , Optional ByVal 始列 As Integer = 1 _
        ) As Boolean
    '------------------------------------------------------------------------------------
    If VBA.IsEmpty(ARR) = True Then Exit Function
    'Debug.Print LBound(ARR, 1); UBound(ARR, 1); LBound(ARR, 2); UBound(ARR, 2)
    WS.Cells(始行, 始列).Resize(UBound(ARR, 1) - LBound(ARR, 1) + 1, UBound(ARR, 2) - LBound(ARR, 2) + 1) = ARR
    '------------------------------------------------------------------------------------
End Function
Function UTL数据转换_集WS2ARR( _
          ByRef ARR As Variant _
        , ByRef WS As Worksheet _
        , Optional ByVal 始行 As Integer = 2 _
        , Optional ByVal 始列 As Integer = 1 _
        , Optional ByVal 总行 As Integer = 0 _
        , Optional ByVal 总列 As Integer = 花宽全道 _
        ) As Integer
    '------------------------------------------------------------------------------------
    If 始行 <= 0 Then Exit Function
    If 总行 = 0 Then
        总行 = PBASE格程工具_表参末行指定(WS, 始列) - 始行 + 1
    End If
    If 总行 > 0 Then
        ARR = WS.Cells(始行, 始列).Resize(总行, 总列)
    End If
    '------------------------------------------------------------------------------------
    UTL数据转换_集WS2ARR = 总行
End Function
'########################################################################################
'##################################    UTL  集转换      ##################################
'########################################################################################







'########################################################################################
'##################################        读取文件     ##################################
'########################################################################################
'Private Function ReadFile(FileName As String) As String()
'    '读取文件
'    Dim M() As String
'    ReDim M(1)
'    Dim FileNum As Integer
'    FileNum = FreeFile
'    Open FileName For Input As #FileNum
'    Line Input #FileNum, M(UBound(M))
'    While Not EOF(FileNum)
'    ReDim Preserve M(UBound(M) + 1)
'    Line Input #FileNum, M(UBound(M))
'    Wend
'    Close #FileNum
'    ReadFile = M
'End Function

'Private Sub WriteFile(FileName As String, M() As String)
'    '写入文件
'    Dim I
'    Dim FileNum As Integer
'    FileNum = FreeFile
'    Open FileName For Output As #FileNum
'    For Each I In M
'    Print #FileNum, I
'    Next
'    Close #FileNum
'End Sub
'########################################################################################
'##################################        读取文件     ##################################
'########################################################################################


