Attribute VB_Name = "WMH_T历研统时_2均线位次"
'代码阶标矩阵：遍历所有代码，统计每个代码的所有阶标，纵向为代码，横向为阶标列举。
'阶标转化矩阵：横向为阶标，纵向为阶标。
Public Const 位阶码矩行标题 = 1
Public Const 位阶码矩行开始 = 2
'------------------------------
Public Const 位阶码矩列代码 = 1
Public Const 位阶码矩列代称 = 2
Public Const 位阶码矩列市板 = 3
Public Const 位阶码矩列期类 = 4
Public Const 位阶码矩列始日 = 5
Public Const 位阶码矩列终日 = 6
Public Const 位阶码矩列累龄 = 7
Public Const 位阶码矩列展始 = 8
'------------------------------
Public Const 位阶码矩偏道涨幅按次 = 0
Public Const 位阶码矩偏道次龄比率 = 1
Public Const 位阶码矩偏道胜次比率 = 2
Public Const 位阶码矩偏道涨幅按龄 = 3
Public Const 位阶码矩偏道总和次数 = 4
Public Const 位阶码矩偏道百和持数 = 5
Public Const 位阶码矩偏道总和涨幅 = 6
Public Const 位阶码矩偏道总数 = 7
'------------------------------
'阶标分布
'------------------------------
Public Const 位阶阶矩列开始 = 2
Public Const 位阶阶矩三维数和 = 1
Public Const 位阶阶矩三维涨和 = 2
Public Const 位阶阶矩三维涨数 = 3
Public Const 位阶涨矩三维数和 = 1
Public Const 位阶涨矩三维涨和 = 2
Public Const 位阶涨矩三维涨数 = 3
'========================================================================================






Sub XL历研阶析前调_批处理()
'========================================================================================
'获取代码列表
'========================================================================================
    Dim 典被研代码 As New Dictionary
    Dim 运行次数 As Integer
    运行次数 = UGSOP拣选引擎圈选(典被研代码)
    If 运行次数 = 0 Then
        MsgBox "NP"
        Exit Sub
    End If
'========================================================================================
'获取矩阵
'========================================================================================
    Dim WSJXX As Worksheet
    Dim WSSUM As Worksheet
    Call PBASE格程工具_表操工表新增(WSJXX, "JXX")
    Call PBASE格程工具_表操工表新增(WSSUM, "JSUM")
    '------------------------------------------------------------------------------------
    Call XLSOP统时全码_线重正程(常期类为月, 典被研代码, WSJXX, WSSUM)
    Call XLSOP统时全码_线重正程(常期类为周, 典被研代码, WSJXX, WSSUM)
    Call XLSOP统时全码_线重正程(常期类为日, 典被研代码, WSJXX, WSSUM)
'========================================================================================
End Sub







'########################################################################################
'########################################################################################
'#################################  统时全码  均线重要性  ################################
'########################################################################################
'########################################################################################
'========================================================================================
'========================================================================================
'功能：导入结算质程，导入单码结算
'适用：HX
'========================================================================================
'========================================================================================
Function XLSOP统时全码_线重正程( _
          被研期类 As String _
        , 典被研代码 As Dictionary _
        , WSJXX As Worksheet _
        , WSSUM As Worksheet _
        ) As Integer
'========================================================================================
'设置典集
'========================================================================================
    Dim 典均线 As New Dictionary
    Dim 典数均线 As Integer
    典数均线 = XLSOP统时全码基程_设置典均线(典均线, 被研期类)
'========================================================================================
'过程：输出
'========================================================================================
    Dim 基行 As Integer
    基行 = PBASE格程工具_表参末行指定(WSJXX, 1)
    Dim 总数导入 As Integer
    总数导入 = 10
    总数导入 = 典被研代码.Count
    '------------------------------------------------------------------------------------
    Dim 被研代码 As String
    Dim 被研代称 As String
    Dim 计数导入 As Integer
    For 计数导入 = 1 To 总数导入
        '--------------------------------------------------------------------------------
        被研代码 = 典被研代码.Keys(计数导入 - 1)
        被研代称 = 典被研代码.Items(计数导入 - 1)
        '--------------------------------------------------------------------------------
        '数据生成
        '--------------------------------------------------------------------------------
        ReDim ARRJC(1 To 位阶码矩列展始 - 1 + 典数均线 * 位阶码矩偏道总数) As Variant
        Call XLSOP统时全码_线重引擎(ARRJC, 典均线, 被研代码, 被研期类)
        '--------------------------------------------------------------------------------
        '数据输出
        '--------------------------------------------------------------------------------
        For I = LBound(ARRJC) To UBound(ARRJC)
            WSJXX.Cells(基行 + 计数导入, I) = ARRJC(I)
        Next
        Erase ARRJC
        'WSJXX.Cells(基行 + 计数导入, 位阶码矩列代码) = 被研代码
        WSJXX.Cells(基行 + 计数导入, 位阶码矩列代称) = 被研代称
        '-----------------------------------------------------------------------------
        DoEvents
        Debug.Print "线重分析>>" & 被研期类 & ">>" & 计数导入, 被研代码, 被研代称
        '--------------------------------------------------------------------------------
    Next
'========================================================================================
'过程：格式化
'========================================================================================
    Call XLSOP统时全码_线重格程(WSJXX, 典均线)
'========================================================================================
'过程：统计
'========================================================================================
    ReDim ARRSUM(1 To 1 + 典均线.Count, 1 To 5) As Variant
    '------------------------------------------------------------------------------------
    Dim 定行 As Integer
    Dim 定列 As Integer
    Dim 单值 As Double
    Dim X As Integer
    For X = 基行 + 1 To 基行 + 总数导入
        For Y = 1 To 典均线.Count
            '----------------------------------------------------------------------------
            定列 = 1
            ARRSUM(1, 定列) = "JX"
            ARRSUM(Y + 1, 定列) = 典均线.Items(Y - 1)
            '----------------------------------------------------------------------------
            '总数：涨幅按次
            '----------------------------------------------------------------------------
            定列 = 2
            单值 = WSJXX.Cells(X, 位阶码矩列展始).Offset(0, Y - 1 + 典数均线 * 位阶码矩偏道涨幅按次)
            ARRSUM(1, 定列) = "总和" & vbCrLf & "涨幅按次" & vbCrLf & 被研期类
            ARRSUM(Y + 1, 定列) = ARRSUM(Y + 1, 定列) + 单值
            '----------------------------------------------------------------------------
            '平均每股：次龄比率
            '----------------------------------------------------------------------------
            定列 = 3
            单值 = WSJXX.Cells(X, 位阶码矩列展始).Offset(0, Y - 1 + 典数均线 * 位阶码矩偏道次龄比率)
            ARRSUM(1, 定列) = "平均" & vbCrLf & "次龄比率" & vbCrLf & 被研期类
            ARRSUM(Y + 1, 定列) = ARRSUM(Y + 1, 定列) + 单值 / 总数导入
            '----------------------------------------------------------------------------
            '平均每股：胜次比率
            '----------------------------------------------------------------------------
            定列 = 4
            单值 = WSJXX.Cells(X, 位阶码矩列展始).Offset(0, Y - 1 + 典数均线 * 位阶码矩偏道胜次比率)
            ARRSUM(1, 定列) = "平均" & vbCrLf & "胜次比率" & vbCrLf & 被研期类
            ARRSUM(Y + 1, 定列) = ARRSUM(Y + 1, 定列) + 单值 / 总数导入
            '----------------------------------------------------------------------------
            '总数：涨幅按龄
            '----------------------------------------------------------------------------
            定列 = 5
            单值 = WSJXX.Cells(X, 位阶码矩列展始).Offset(0, Y - 1 + 典数均线 * 位阶码矩偏道涨幅按龄)
            ARRSUM(1, 定列) = "总和" & vbCrLf & "涨幅按龄" & vbCrLf & 被研期类
            ARRSUM(Y + 1, 定列) = ARRSUM(Y + 1, 定列) + 单值
            '----------------------------------------------------------------------------
        Next Y
        Debug.Print "汇总>>", X
    Next
    '------------------------------------------------------------------------------------
    '输出
    '------------------------------------------------------------------------------------
    Call UTL数据转换_集ARR2WS(ARRSUM, WSSUM)
    Erase ARRSUM
    WSSUM.Cells(1, 6) = 总数导入
    '------------------------------------------------------------------------------------
    '格式化
    '------------------------------------------------------------------------------------
    WSSUM.Cells.NumberFormatLocal = "0_);[蓝色](0)"
'========================================================================================
'返回
'========================================================================================
    Set 典均线 = Nothing
    '------------------------------------------------------------------------------------
    XLSOP统时全码_线重正程 = 计数导入
'========================================================================================
End Function







'========================================================================================
'========================================================================================
'功能：导入结算质程，导入单码结算
'适用：HX
'========================================================================================
'========================================================================================
Function XLSOP统时全码_线重引擎( _
          ARRJC As Variant _
        , 典均线 As Dictionary _
        , 指定代码 As String _
        , 指定期类 As String _
        , Optional 指定结算日 As Date = "2050/1/1" _
        ) As Integer
'========================================================================================
'设置基础信息
'========================================================================================
    Dim 典数均线 As Integer
    典数均线 = 典均线.Count
'========================================================================================
'获取行情数据
'========================================================================================
    Dim 指定结日 As Date
    指定结日 = Date
    Dim ARRCSVD As Variant
    Dim 计数行情 As Integer
    计数行情 = STBASE取据引擎_工具取据由外库(ARRCSVD, 指定代码, 指定结期上限:=指定结日)
    If 计数行情 < 1 Then Exit Function
    '------------------------------------------------------------------------------------
    Dim 遍历下限 As Integer
    Dim 遍历上限 As Integer
    遍历下限 = LBound(ARRCSVD, 1)
    遍历上限 = UBound(ARRCSVD, 1)
    '====================================================================================
    '设置数据：OS信息
    '====================================================================================
    ARRJC(位阶码矩列代码) = 指定代码
    ARRJC(位阶码矩列期类) = 指定期类
    '------------------------------------------------------------------------------------
    '累龄 记载 经过交易的期数
    ARRJC(位阶码矩列累龄) = 计数行情
    '市日 记载 行情开始日期
    ARRJC(位阶码矩列始日) = ARRCSVD(遍历下限, 位列TS结期)
    '今日 记载 行情结束日期
    ARRJC(位阶码矩列终日) = ARRCSVD(遍历上限, 位列TS结期)
    '====================================================================================
    '设置数据：均线相交信息
    '====================================================================================
    '矩阵：均线相交次数
    ReDim ARRXNT(1 To 典数均线) As Variant
    '矩阵：均线相交期间上涨的计数
    ReDim ARRXNP(1 To 典数均线) As Variant
    '矩阵：均线相交开始的位置
    ReDim ARRXYA(1 To 典数均线) As Variant
    '矩阵：均线相交结束的位置差
    ReDim ARRXYB(1 To 典数均线) As Variant
    '矩阵：均线相交开始的绝对价格
    ReDim ARRXZA(1 To 典数均线) As Variant
    '矩阵：均线相交结束的价格差
    ReDim ARRXZB(1 To 典数均线) As Variant
    '------------------------------------------------------------------------------------
    For I = LBound(ARRXZA) To UBound(ARRXZA)
        ARRXYA(I) = 0
        ARRXYB(I) = 0
        ARRXZA(I) = ARRCSVD(遍历下限, 位列TS结收)
        ARRXZB(I) = 0
        ARRXNT(I) = 0
        ARRXNP(I) = 0
    Next
'========================================================================================
'变量声明    -----------------------------------------------------------------------------
'========================================================================================
    Dim 前阶标 As String, 阶标 As String
    '------------------------------------------------------------------------------------
    Dim 今收#
    '----------------------
    Dim 今涨#
    Dim 前收#
    Dim 前JZ#, 前JA#, 前JB#, 前JC#, 前JD#, 前JE#, 前JF#
    '----------------------
    Dim 均基#
    Dim JZ#, JA#, JB#, JC#, JD#, JE#, JF#, JG#
    Dim BTZA%
    Dim BTZB%, BTAB%
    Dim BTZC%, BTAC%, BTBC%
    Dim BTAG%, BTAD%, BTCG%, BTCD%
    Dim BTEG%, BTAE%, BTFG%, BTCE%, BTDE%
    Dim BTAF%, BTCF%, BTDF%, BTEF%
'========================================================================================
'遍历文件    -----------------------------------------------------------------------------
'========================================================================================
    今收 = 0
    今仓 = 0
    今手 = 0
    
    Dim 遍历序号 As Integer
    For 遍历序号 = 遍历下限 To 遍历上限
        '================================================================================
        前收 = 今收
        今收 = ARRCSVD(遍历序号, 位列TS结收)
        '================================================================================
        
        
        
        
        '================================================================================
        '处理首行以后  -------------------------------------------------------------------
        '================================================================================
        If 遍历序号 > 遍历下限 Then
'########################################################################################
'########################################################################################
'##################################      OS核心      #####################################
'##################################   内容整体复制   #####################################
'########################################################################################
'########################################################################################
'========================================================================================
'计算：今涨
'========================================================================================
            If 前收 > 0 And 今收 > 0 Then 今涨 = (今收 / 前收 - 1) * 100
            今涨 = Round(今涨, 1)
'========================================================================================
'计算：基础信息
'========================================================================================
            前JZ = JZ
            前JA = JA
            前JB = JB
            前JC = JC
            前JD = JD
            前JE = JE
            前JF = JF
            '----------------------------------------------------------------------------
            JZ = (1 / 3) * JZ + (2 / 3) * 今收
            均基 = JZ
            JA = (4 / 6) * JA + (2 / 6) * 均基
            JB = (11 / 13) * JB + (2 / 13) * 均基
            JC = (25 / 27) * JC + (2 / 27) * 均基
            JD = (59 / 61) * JD + (2 / 61) * 均基
            JE = (119 / 121) * JE + (2 / 121) * 均基
            JF = (239 / 241) * JF + (2 / 241) * 均基
            '----------------------------------------------------------------------------
            BTZA = STBASE结算工具_衍生交叉天数(BTZA, JZ, JA)
            BTZB = STBASE结算工具_衍生交叉天数(BTZB, JZ, JB)
            BTAB = STBASE结算工具_衍生交叉天数(BTAB, JA, JB)
            BTZC = STBASE结算工具_衍生交叉天数(BTZC, JZ, JC)
            BTAC = STBASE结算工具_衍生交叉天数(BTAC, JA, JC)
            BTBC = STBASE结算工具_衍生交叉天数(BTBC, JB, JC)
            BTAG = STBASE结算工具_衍生交叉天数(BTAG, JZ, JD)
            BTAD = STBASE结算工具_衍生交叉天数(BTAD, JA, JD)
            BTCG = STBASE结算工具_衍生交叉天数(BTCG, JB, JD)
            BTCD = STBASE结算工具_衍生交叉天数(BTCD, JC, JD)
            BTEG = STBASE结算工具_衍生交叉天数(BTEG, JZ, JE)
            BTAE = STBASE结算工具_衍生交叉天数(BTAE, JA, JE)
            BTFG = STBASE结算工具_衍生交叉天数(BTFG, JB, JE)
            BTCE = STBASE结算工具_衍生交叉天数(BTCE, JC, JE)
            BTDE = STBASE结算工具_衍生交叉天数(BTDE, JD, JE)
            BTAF = STBASE结算工具_衍生交叉天数(BTAF, JA, JF)
            BTCF = STBASE结算工具_衍生交叉天数(BTCF, JC, JF)
            BTDF = STBASE结算工具_衍生交叉天数(BTDF, JD, JF)
            BTEF = STBASE结算工具_衍生交叉天数(BTEF, JE, JF)
'========================================================================================
'均线相交计数
'比较不同周期的什么均线相交能够获得最大收益
'========================================================================================
            Dim 均线名称 As String
            Dim 定交位 As Integer
            
            Dim X As Integer
            For X = 1 To 典均线.Count
                定交位 = 典均线.Keys(X - 1)
                均线名称 = 典均线.Items(X - 1)
                
                Select Case 均线名称
                Case "ZA"
                    BTXX = BTZA
                Case "ZB"
                    BTXX = BTZB
                Case "ZC"
                    BTXX = BTZC
                Case "AB"
                    BTXX = BTAB
                Case "AC"
                    BTXX = BTAC
                Case "AD"
                    BTXX = BTAD
                Case "AE"
                    BTXX = BTAE
                Case "AF"
                    BTXX = BTAF
                Case "BC"
                    BTXX = BTBC
                Case "BE"
                    BTXX = BTFG
                Case "CD"
                    BTXX = BTCD
                Case "CE"
                    BTXX = BTCE
                Case "CF"
                    BTXX = BTCF
                Case "DE"
                    BTXX = BTDE
                Case "DF"
                    BTXX = BTDF
                Case "EF"
                    BTXX = BTEF
                End Select
                
                If BTXX = 1 Then
                    ARRXNT(定交位) = ARRXNT(定交位) + 1
                    ARRXYA(定交位) = 遍历序号
                    ARRXZA(定交位) = 今收
                ElseIf BTXX = -1 Then
                    ARRXYB(定交位) = ARRXYB(定交位) + 遍历序号 - ARRXYA(定交位)
                    If ARRXZA(定交位) > 0 Then
                        波段涨幅 = 100 * (今收 / ARRXZA(定交位) - 1)
                        ARRXZB(定交位) = ARRXZB(定交位) + 波段涨幅
                        If 波段涨幅 > -0.1 Then ARRXNP(定交位) = ARRXNP(定交位) + 1
                    End If
                    ARRXZA(定交位) = 0
                End If
                
            Next
'========================================================================================
'########################################################################################
'########################################################################################
'##################################      OS核心      #####################################
'##################################   内容整体复制   #####################################
'########################################################################################
'########################################################################################




        '================================================================================
        '处理首行  -----------------------------------------------------------------------
        '================================================================================
        ElseIf 遍历序号 = 遍历下限 Then
            今涨 = 0
            
            JZ = 今收
            JA = 今收
            JB = 今收
            JC = 今收
            JD = 今收
            JE = 今收
            JF = 今收
        End If
        '================================================================================
    Next 遍历序号
'========================================================================================
'返回
'========================================================================================
    Dim 偏移计数 As Integer
    For I = LBound(ARRXNT) To UBound(ARRXNT)
        '================================================================================
        '--------------------------------------------------------------------------------
        '持仓区间涨幅：平均每次
        '--------------------------------------------------------------------------------
        偏移计数 = 位阶码矩偏道涨幅按次
        定阶码矩一维 = (位阶码矩列展始 - 1) + 典数均线 * 偏移计数 + I
        If ARRXNT(I) > 0 Then
            ARRJC(定阶码矩一维) = Round(ARRXZB(I) / ARRXNT(I), 1)
        End If
        '--------------------------------------------------------------------------------
        '概率：每次出现概率   总次数/龄数
        '--------------------------------------------------------------------------------
        偏移计数 = 位阶码矩偏道次龄比率
        定阶码矩一维 = (位阶码矩列展始 - 1) + 典数均线 * 偏移计数 + I
        ARRJC(定阶码矩一维) = Round(100 * ARRXNT(I) / 计数行情, 1)
        '--------------------------------------------------------------------------------
        '概率：上涨出现概率   上涨次数/总次数 - 20
        '--------------------------------------------------------------------------------
        偏移计数 = 位阶码矩偏道胜次比率
        定阶码矩一维 = (位阶码矩列展始 - 1) + 典数均线 * 偏移计数 + I
        If ARRXNT(I) > 0 Then
            ARRJC(定阶码矩一维) = Round(100 * ARRXNP(I) / ARRXNT(I), 1)
        End If
        ARRJC(定阶码矩一维) = ARRJC(定阶码矩一维)
        '================================================================================
        '--------------------------------------------------------------------------------
        '持仓区间涨幅：平均每龄
        '--------------------------------------------------------------------------------
        偏移计数 = 位阶码矩偏道涨幅按龄
        定阶码矩一维 = (位阶码矩列展始 - 1) + 典数均线 * 偏移计数 + I
        ARRJC(定阶码矩一维) = Round(100 * ARRXZB(I) / 计数行情, 1)
        '================================================================================
        '未标准化信息
        '================================================================================
        '--------------------------------------------------------------------------------
        '持仓区间次数：绝对值加和
        '--------------------------------------------------------------------------------
        偏移计数 = 位阶码矩偏道总和次数
        定阶码矩一维 = (位阶码矩列展始 - 1) + 典数均线 * 偏移计数 + I
        ARRJC(定阶码矩一维) = ARRXNT(I)
        '--------------------------------------------------------------------------------
        '持仓区间时间：绝对值加和
        '--------------------------------------------------------------------------------
        偏移计数 = 位阶码矩偏道百和持数
        定阶码矩一维 = (位阶码矩列展始 - 1) + 典数均线 * 偏移计数 + I
'        ARRJC(定阶码矩一维) = Round(100 * ARRXYB(I) / 计数行情, 1) - 20
        ARRJC(定阶码矩一维) = Round(100 * ARRXYB(I) / 计数行情, 1) - 50
        '--------------------------------------------------------------------------------
        '持仓区间涨幅：绝对值加和
        '--------------------------------------------------------------------------------
        偏移计数 = 位阶码矩偏道总和涨幅
        定阶码矩一维 = (位阶码矩列展始 - 1) + 典数均线 * 偏移计数 + I
        ARRJC(定阶码矩一维) = Round(ARRXZB(I), 1)
        '--------------------------------------------------------------------------------
        '================================================================================
    Next
    Erase ARRXZA
    Erase ARRXZB
    Erase ARRXNT
    Erase ARRXNP
'    Stop
'========================================================================================
'返回
'========================================================================================
    Erase ARRCSVD
    '------------------------------------------------------------------------------------
    XLSOP统时全码_线重引擎 = 计数行情
'========================================================================================
End Function



Function XLSOP统时全码_线重格程( _
          WSJC As Worksheet _
        , 典均线 As Dictionary _
        ) As Integer
'========================================================================================
'格式化：基本
'========================================================================================
    '------------------------------------------------------------------------------------
    '格式化：初始
    '------------------------------------------------------------------------------------
    WSJC.Cells.Interior.ColorIndex = 0
    WSJC.Cells.Font.Size = 10
    WSJC.Columns(位阶码矩列代码).Font.ColorIndex = 15
    WSJC.Columns(位阶码矩列代称).Font.ColorIndex = 1
    WSJC.Columns(位阶码矩列期类).Font.ColorIndex = 15
    WSJC.Columns(位阶码矩列累龄).Font.ColorIndex = 1
    WSJC.Columns(位阶码矩列代码).ColumnWidth = 8
    WSJC.Columns(位阶码矩列代称).ColumnWidth = 8
    WSJC.Columns(位阶码矩列市板).ColumnWidth = 3
    WSJC.Columns(位阶码矩列期类).ColumnWidth = 2
    WSJC.Columns(位阶码矩列累龄).ColumnWidth = 5
    WSJC.Columns(位阶码矩列始日).Hidden = True
    WSJC.Columns(位阶码矩列终日).Hidden = True
    '------------------------------------------------------------------------------------
    '格式化：标题
    '------------------------------------------------------------------------------------
    WSJC.Cells(位阶码矩行标题, 位阶码矩行开始) = "代码"
    WSJC.Cells(位阶码矩行标题, 位阶码矩列代码) = "代称"
    WSJC.Cells(位阶码矩行标题, 位阶码矩列市板) = "市板"
    WSJC.Cells(位阶码矩行标题, 位阶码矩列期类) = "期类"
    WSJC.Cells(位阶码矩行标题, 位阶码矩列累龄) = "累龄"
    WSJC.Cells(位阶码矩行标题, 位阶码矩列始日) = "始日"
    WSJC.Cells(位阶码矩行标题, 位阶码矩列终日) = "终日"
    WSJC.Rows(1).Font.ColorIndex = 1
'========================================================================================
'格式化：与均线相关
'========================================================================================
    Dim 典数均线 As Integer
    典数均线 = 典均线.Count
    '------------------------------------------------------------------------------------
    Dim 均线名称 As String
    Dim I As Integer
    For I = 0 To 典数均线 - 1
        均线名称 = 典均线.Items(I)
        WSJC.Cells(位阶码矩行标题, 位阶码矩列展始).Offset(0, 典数均线 * 位阶码矩偏道涨幅按次 + I) = 均线名称 & vbCrLf & "涨幅按次"
        WSJC.Cells(位阶码矩行标题, 位阶码矩列展始).Offset(0, 典数均线 * 位阶码矩偏道次龄比率 + I) = 均线名称 & vbCrLf & "次龄比率"
        WSJC.Cells(位阶码矩行标题, 位阶码矩列展始).Offset(0, 典数均线 * 位阶码矩偏道胜次比率 + I) = 均线名称 & vbCrLf & "胜次比率"
        WSJC.Cells(位阶码矩行标题, 位阶码矩列展始).Offset(0, 典数均线 * 位阶码矩偏道涨幅按龄 + I) = 均线名称 & vbCrLf & "涨幅按龄"
        WSJC.Cells(位阶码矩行标题, 位阶码矩列展始).Offset(0, 典数均线 * 位阶码矩偏道总和次数 + I) = 均线名称 & vbCrLf & "总和次数"
        WSJC.Cells(位阶码矩行标题, 位阶码矩列展始).Offset(0, 典数均线 * 位阶码矩偏道百和持数 + I) = 均线名称 & vbCrLf & "百和持数"
        WSJC.Cells(位阶码矩行标题, 位阶码矩列展始).Offset(0, 典数均线 * 位阶码矩偏道总和涨幅 + I) = 均线名称 & vbCrLf & "总和涨幅"
    Next
'========================================================================================
'格式化：分隔边框
'========================================================================================
    Dim 偏移计数 As Integer
    偏移计数 = 位阶码矩偏道涨幅按次
    With WSJC.Cells(1, 位阶码矩列展始).Offset(0, 典数均线 * 偏移计数).Resize(1, 典数均线).EntireColumn
        .HorizontalAlignment = xlRight
        .ColumnWidth = 4
        .Font.ColorIndex = 1
        .NumberFormatLocal = "0_);[蓝色](0)"
        With .Borders(xlEdgeLeft)
           .LineStyle = xlContinuous
           .Color = 常色十靛
           .Weight = xlMedium
        End With
        With .Borders(xlEdgeRight)
           .LineStyle = xlContinuous
           .Color = 常色十靛
           .Weight = xlMedium
        End With
    End With
    '--------------------------------------------------
    偏移计数 = 位阶码矩偏道次龄比率
    With WSJC.Cells(1, 位阶码矩列展始).Offset(0, 典数均线 * 偏移计数).Resize(1, 典数均线).EntireColumn
        .HorizontalAlignment = xlRight
        .ColumnWidth = 3
        .Font.ColorIndex = 1
        .NumberFormatLocal = "0_);[蓝色](0)"
        With .Borders(xlEdgeLeft)
           .LineStyle = xlContinuous
           .Color = 常色十靛
           .Weight = xlMedium
        End With
        With .Borders(xlEdgeRight)
           .LineStyle = xlContinuous
           .Color = 常色十靛
           .Weight = xlMedium
        End With
    End With
    '--------------------------------------------------
    偏移计数 = 位阶码矩偏道胜次比率
    With WSJC.Cells(1, 位阶码矩列展始).Offset(0, 典数均线 * 偏移计数).Resize(1, 典数均线).EntireColumn
        .HorizontalAlignment = xlRight
        .ColumnWidth = 3
        .Font.ColorIndex = 1
        .NumberFormatLocal = "0_);[蓝色](0)"
        With .Borders(xlEdgeLeft)
           .LineStyle = xlContinuous
           .Color = 常色十靛
           .Weight = xlMedium
        End With
        With .Borders(xlEdgeRight)
           .LineStyle = xlContinuous
           .Color = 常色十靛
           .Weight = xlMedium
        End With
    End With
    '--------------------------------------------------
    偏移计数 = 位阶码矩偏道涨幅按龄
    With WSJC.Cells(1, 位阶码矩列展始).Offset(0, 典数均线 * 偏移计数).Resize(1, 典数均线).EntireColumn
        .HorizontalAlignment = xlRight
        .ColumnWidth = 4
        .Font.ColorIndex = 1
        .NumberFormatLocal = "0_);[蓝色](0)"
        With .Borders(xlEdgeLeft)
           .LineStyle = xlContinuous
           .Color = 常色主黑
           .Weight = xlMedium
        End With
        With .Borders(xlEdgeRight)
           .LineStyle = xlContinuous
           .Color = 常色主黑
           .Weight = xlMedium
        End With
    End With
    '--------------------------------------------------
    偏移计数 = 位阶码矩偏道总和次数
    With WSJC.Cells(1, 位阶码矩列展始).Offset(0, 典数均线 * 偏移计数).Resize(1, 典数均线).EntireColumn
        .HorizontalAlignment = xlRight
        .ColumnWidth = 4
        .Font.ColorIndex = 1
        .NumberFormatLocal = "0_);[蓝色](0)"
        With .Borders(xlEdgeLeft)
           .LineStyle = xlContinuous
           .Color = 常色四紫
           .Weight = xlMedium
        End With
        With .Borders(xlEdgeRight)
           .LineStyle = xlContinuous
           .Color = 常色四紫
           .Weight = xlMedium
        End With
    End With
    '--------------------------------------------------
    偏移计数 = 位阶码矩偏道百和持数
    With WSJC.Cells(1, 位阶码矩列展始).Offset(0, 典数均线 * 偏移计数).Resize(1, 典数均线).EntireColumn
        .HorizontalAlignment = xlRight
        .ColumnWidth = 4
        .Font.ColorIndex = 1
        .NumberFormatLocal = "0_);[蓝色](0)"
        With .Borders(xlEdgeLeft)
           .LineStyle = xlContinuous
           .Color = 常色四紫
           .Weight = xlMedium
        End With
        With .Borders(xlEdgeRight)
           .LineStyle = xlContinuous
           .Color = 常色四紫
           .Weight = xlMedium
        End With
    End With
    '--------------------------------------------------
    偏移计数 = 位阶码矩偏道总和涨幅
    With WSJC.Cells(1, 位阶码矩列展始).Offset(0, 典数均线 * 偏移计数).Resize(1, 典数均线).EntireColumn
        .HorizontalAlignment = xlRight
        .ColumnWidth = 4
        .Font.ColorIndex = 1
        .NumberFormatLocal = "0_);[蓝色](0)"
        With .Borders(xlEdgeLeft)
           .LineStyle = xlContinuous
           .Color = 常色四紫
           .Weight = xlMedium
        End With
        With .Borders(xlEdgeRight)
           .LineStyle = xlContinuous
           .Color = 常色四紫
           .Weight = xlMedium
        End With
    End With
'========================================================================================
'输出矩阵：阶码矩阵
'========================================================================================
'    Dim 累龄 As Integer
'    Dim 色度 As Double
'
'    Dim X As Integer
'    Dim Y As Integer
'    '------------------------------------------------------------------------------------
'    X = 1
'    For Y = 1 To 典数均线
'        With WSJC.Cells(X, 位阶码矩列展始).Offset(0, 典数均线).Cells(1, Y)
'            .Value = .Offset(0, -1 * 典数均线)
'        End With
'    Next
'    For X = PBASE格程工具_表参末行指定(WSJC, 1) To 位阶码矩行开始 Step -1
'        累龄 = WSJC.Cells(X, 位阶码矩列累龄)
'
'        If 累龄 = 0 Then
'            WSJC.Rows(X).Delete
'        Else
'            For Y = 1 To 典数均线
'                With WSJC.Cells(X, 位阶码矩列展始).Cells(1, Y).Offset(0, 典数均线)
'                    .Value = Round(100 * .Offset(0, -1 * 典数均线) / 累龄, 1)
'                    If .Value > 3 Then
'                        .Interior.ColorIndex = 43
'                        色度 = .Value / 100
'     '                   .Interior.TintAndShade = 色度
'                    ElseIf .Value > 1 Then
'                        .Interior.ColorIndex = 50
'                        色度 = .Value / 100
'     '                   .Interior.TintAndShade = 色度
'                    ElseIf .Value > 0 Then
'                        .Interior.ColorIndex = 51
'                        色度 = .Value / 100
'     '                   .Interior.TintAndShade = 色度
'                    Else
'                        .Interior.ColorIndex = 1
'                    End If
'                    .Font.Color = .Interior.Color
'                End With
'            Next
'        End If
'    Next
'    WSJC.Cells(1, 位阶码矩列展始).Resize(1, 典数均线).Columns.ColumnWidth = 6
'    WSJC.Cells(1, 位阶码矩列展始).Resize(1, 典数均线).Columns.Hidden = True
'    WSJC.Cells(1, 位阶码矩列展始).Offset(0, 典数均线).Resize(1, 典数均线).Columns.ColumnWidth = 2
'========================================================================================
'格式化：排序
'========================================================================================
    With WSJC
        .Sort.SortFields.Clear
        .Sort.SortFields.Add Key:=.Columns(位阶码矩列代码) _
            , SortOn:=xlSortOnValues, Order:=xlAscending _
            , DataOption:=xlSortNormal
        .Sort.SortFields.Add Key:=.Columns(位阶码矩列期类) _
            , SortOn:=xlSortOnValues, Order:=xlAscending, CustomOrder:="M,W,D" _
            , DataOption:=xlSortNormal
    End With
    With WSJC.Sort
        .SetRange WSJC.UsedRange
        .Header = xlYes
        .MatchCase = False
        .Orientation = xlTopToBottom
        .SortMethod = xlPinYin
        .Apply
    End With
'========================================================================================
'格式化：整体
'========================================================================================
    Call PBASE格程工具_表冻结锁定(WSJC)
    '------------------------------------------------------------------------------------
    WSJC.Activate
    ActiveWindow.Zoom = 80
'========================================================================================
End Function
'########################################################################################
'########################################################################################
'#################################  统时全码  均线重要性  ###############################
'########################################################################################
'########################################################################################




'########################################################################################
'########################################################################################
'####################################   统时全码基程   ##################################
'########################################################################################
'########################################################################################
'========================================================================================
'========================================================================================
'设置数组：典均线
'========================================================================================
'========================================================================================
Function XLSOP统时全码基程_设置典均线(典均线 As Dictionary, 期类 As String) As Integer
    Dim 组均线 As Variant
    组均线 = Array( _
          "ZA", "ZB", "ZC", "ZD", "ZE", "ZF" _
        , "AB", "AC", "AD", "AE", "AF" _
        , "BC", "BD", "BE", "BF" _
        , "CD", "CE", "CF" _
        , "DE", "DF" _
        , "EF" _
    )
    '组均线 = Array( _
          "ZA" _
        , "ZB", "AB" _
        , "ZC", "AC", "BC" _
        , "ZD", "AD", "BD", "CD" _
        , "ZE", "AE", "BE", "CE", "DE" _
        , "ZF", "AF", "BF", "CF", "DF", "EF" _
        )
    '------------------------------------------------------------------------------------
    序数典集 = 0
    Dim X As Integer
    For X = LBound(组均线) To UBound(组均线)
        序数典集 = 序数典集 + 1
        元素典集 = 组均线(X)
        典均线.Add Item:=元素典集, Key:=序数典集
    Next
    '------------------------------------------------------------------------------------
    Erase 组均线
'========================================================================================
'返回：个数
'========================================================================================
    XLSOP统时全码基程_设置典均线 = 典均线.Count
End Function
'########################################################################################
'########################################################################################
'####################################   统时全码基程   ##################################
'########################################################################################
'########################################################################################


