Attribute VB_Name = "WMR现市_B4异常"
'========================================================================================
Public Const 全设阈值of大涨 = 3
Public Const 全设阈值of大跌 = -3
Public Const 全设阈值of振幅 = 9
Public Const 全设阈值of量比 = 2
Public Const 全设阈值of换手高 = 5
Public Const 全设阈值of换手低 = 0.5
Public Const 全设阈值of价高 = 80
Public Const 全设阈值of价低 = 5
Public Const 全设阈值of额高 = 8
Public Const 全设阈值of额低 = 0.1
Public Const 全设阈值of净高 = 100
Public Const 全设阈值of净低 = 1
Public Const 全设阈值of盈高 = 100
Public Const 全设阈值of盈低 = 10
'========================================================================================
Public Const 位列天组代码 = 1
Public Const 位列天组代称 = 2
Public Const 位列天组今涨 = 3
Public Const 位列天组振幅 = 5
Public Const 位列天组今收 = 7
Public Const 位列天组前收 = 8
Public Const 位列天组今开 = 9
Public Const 位列天组今高 = 10
Public Const 位列天组今低 = 11
Public Const 位列天组今额 = 12
Public Const 位列天组今量 = 13
Public Const 位列天组量比 = 14
Public Const 位列天组换手 = 15
Public Const 位列天组时间 = 16
Public Const 位列天组外盘 = 17
Public Const 位列天组内盘 = 18
Public Const 位列天组涨停 = 19
Public Const 位列天组跌停 = 20
Public Const 位列天组流市 = 21
Public Const 位列天组总市 = 22
Public Const 位列天组市盈 = 23
Public Const 位列天组市净 = 24
Public Const 位列天组停牌 = 25
'-----------------------------
Public Const 位列天组维度 = 26
'========================================================================================







'========================================================================================
'========================================================================================
'========================================================================================
'调用：中股异常
'========================================================================================
'========================================================================================
'========================================================================================
Function 现市基程_中股异常( _
          MS As Worksheet _
        , Optional 始行 As Integer = 1 _
        , Optional 天组 As Variant _
        , Optional 天典 As Dictionary _
        ) As Boolean
'========================================================================================
'前置检查
'========================================================================================
    If 天典 Is Nothing Or 天典.Count = 0 Then
        现市基程_中股异常 = False
        Exit Function
    End If
'========================================================================================
'页面格式设置
'========================================================================================
    MS.Cells.Font.Size = 10
    MS.Columns.ColumnWidth = 2
'========================================================================================
'变量声明
'========================================================================================
    Dim 集典停牌 As New Dictionary
    Dim 集典涨停无量 As New Dictionary
    Dim 集典涨停封板 As New Dictionary
    Dim 集典涨停开板 As New Dictionary
    Dim 集典跌停封板 As New Dictionary
    Dim 集典跌停开板 As New Dictionary
    Dim 集典异常大涨 As New Dictionary
    Dim 集典异常大跌 As New Dictionary
    Dim 集典异常振幅涨 As New Dictionary
    Dim 集典异常振幅跌 As New Dictionary
    Dim 集典异常量比涨 As New Dictionary
    Dim 集典异常量比跌 As New Dictionary
    Dim 集典异常换高涨 As New Dictionary
    Dim 集典异常换高跌 As New Dictionary
    Dim 集典异常换低 As New Dictionary
    Dim 集典异常价高 As New Dictionary
    Dim 集典异常价低 As New Dictionary
    Dim 集典异常额高 As New Dictionary
    Dim 集典异常额低 As New Dictionary
    Dim 集典异常净高 As New Dictionary
    Dim 集典异常净低 As New Dictionary
    Dim 集典异常盈高 As New Dictionary
    Dim 集典异常盈低 As New Dictionary
    Dim 集典正常交易 As New Dictionary
    '------------------------------------------------------------------------------------
    Dim CIDL As String
    Dim 值名称 As String
    Dim 值涨幅 As Double
    Dim 值今收 As Double, 值前收 As Double, 值今开 As Double
    Dim 值振幅 As Double
    Dim 值今高 As Double, 值今低 As Double
    Dim 值涨停 As Double, 值跌停 As Double
    Dim 计码票 As Integer
    '------------------------------------------------------------------------------------
    Dim 典统异常 As New Dictionary
    Dim 典索异常 As String
'========================================================================================
'遍历统计
'========================================================================================
    Dim X As Integer
    For X = LBound(天组, 1) To UBound(天组, 1)
        '--------------------------------------------------------------------------------
        '取值
        '--------------------------------------------------------------------------------
        CIDL = 天组(X, 位列天组代码)
        值名称 = 天组(X, 位列天组代称)
        值涨幅 = 天组(X, 位列天组今涨)
        值今收 = 天组(X, 位列天组今收)
        值前收 = 天组(X, 位列天组前收)
        值今开 = 天组(X, 位列天组今开)
        值振幅 = 天组(X, 位列天组振幅)
        值今高 = 天组(X, 位列天组今高)
        值今低 = 天组(X, 位列天组今低)
        值涨停 = 天组(X, 位列天组涨停)
        值跌停 = 天组(X, 位列天组跌停)
        值量比 = 天组(X, 位列天组量比)
        值换手 = 天组(X, 位列天组换手)
        值交量 = 天组(X, 位列天组今量)
        值外盘 = 天组(X, 位列天组外盘)
        值内盘 = 天组(X, 位列天组内盘)
        值交额 = 天组(X, 位列天组今额)
        值流市 = 天组(X, 位列天组流市)
        值总市 = 天组(X, 位列天组总市)
        值市盈 = 天组(X, 位列天组市盈)
        值市净 = 天组(X, 位列天组市净)
        值时间 = 天组(X, 位列天组时间)
        值停牌 = 天组(X, 位列天组停牌)
        If CIDL = "sh000001" Then
            值上证交额 = CInt(值交额)
        ElseIf CIDL = "sz399001" Then
            值深证交额 = CInt(值交额)
        End If
        '--------------------------------------------------------------------------------
        '按照代码类别分类
        '--------------------------------------------------------------------------------
        If UBCID是中股票(CIDL) = True Then
'        If UBCID是中股基(CIDL) = True Then
'        If UBCID是中股指(CIDL) = True Then
                '------------------------------------------------------------------------
                '按照异常分类
                '------------------------------------------------------------------------
                计码票 = 计码票 + 1
                If Len(值停牌) > 0 Or 值今开 = 0 Then
                            集典停牌.Add Item:=X, Key:=CIDL
                '------------------------------------------------------------------------
                ElseIf 值今收 > 0 Then
                    '---------------------------------------------------------------------
                    If 值今高 = 值涨停 Then
                        If 值外盘 = 0 Then
                            集典涨停无量.Add Item:=X, Key:=CIDL
                        ElseIf 值今收 = 值涨停 Then
                            集典涨停封板.Add Item:=X, Key:=CIDL
                        Else
                            集典涨停开板.Add Item:=X, Key:=CIDL
                        End If
                    ElseIf 值今低 = 值跌停 Then
                        If 值今收 = 值跌停 Then
                            集典跌停封板.Add Item:=X, Key:=CIDL
                        Else
                            集典跌停开板.Add Item:=X, Key:=CIDL
                        End If
                    Else
                        If 值涨幅 >= 全设阈值of大涨 Then
                            集典异常大涨.Add Item:=X, Key:=CIDL
                        ElseIf 值涨幅 <= 全设阈值of大跌 Then
                            集典异常大跌.Add Item:=X, Key:=CIDL
                        Else
                            集典正常交易.Add Item:=X, Key:=CIDL
                        End If
                    End If
                    '---------------------------------------------------------------------
                    
                    
                    
                    '---------------------------------------------------------------------
                    If 值振幅 > 全设阈值of振幅 Then
                        If 值涨幅 >= 0 Then
                            集典异常振幅涨.Add Item:=X, Key:=CIDL
                        Else
                            集典异常振幅跌.Add Item:=X, Key:=CIDL
                        End If
                    End If
                    '---------------------------------------------------------------------
                    If 值量比 > 全设阈值of量比 Then
                        If 值涨幅 >= 0 Then
                            集典异常量比涨.Add Item:=X, Key:=CIDL
                        Else
                            集典异常量比跌.Add Item:=X, Key:=CIDL
                        End If
                    ElseIf 值换手 > 全设阈值of换手高 Then
                        If 值涨幅 >= 0 Then
                            集典异常换高涨.Add Item:=X, Key:=CIDL
                        Else
                            集典异常换高跌.Add Item:=X, Key:=CIDL
                        End If
                    ElseIf 值换手 < 全设阈值of换手低 Then
                            集典异常换低.Add Item:=X, Key:=CIDL
                    End If
                    '---------------------------------------------------------------------
                    If 值今收 > 全设阈值of价高 Then
                        集典异常价高.Add Item:=X, Key:=CIDL
                    ElseIf 值今收 < 全设阈值of价低 Then
                        集典异常价低.Add Item:=X, Key:=CIDL
                    End If
                    '---------------------------------------------------------------------
                    If 值市净 > 全设阈值of净高 Then
                        集典异常净高.Add Item:=X, Key:=CIDL
                    ElseIf 值市净 < 全设阈值of净低 And 值市净 > 0 Then
                        集典异常净低.Add Item:=X, Key:=CIDL
                    End If
                    '---------------------------------------------------------------------
                    If 值市盈 > 全设阈值of盈高 Then
                        集典异常盈高.Add Item:=X, Key:=CIDL
                    ElseIf 值市盈 < 全设阈值of盈低 And 值市盈 > 0 Then
                        集典异常盈低.Add Item:=X, Key:=CIDL
                    End If
                    '---------------------------------------------------------------------
                    If 值交额 > 全设阈值of额高 Then
                        集典异常额高.Add Item:=X, Key:=CIDL
                    ElseIf 值交额 < 全设阈值of额低 Then
                        集典异常额低.Add Item:=X, Key:=CIDL
                    End If
                    '---------------------------------------------------------------------
                    
                
                
                    '---------------------------------------------------------------------
                    '按照涨跌方向分类
                    '---------------------------------------------------------------------
                    If 值涨幅 >= 0 Then
                        典索异常 = "上涨"
                        典统异常.Item(典索异常) = 典统异常.Item(典索异常) + 1
                    Else
                        典索异常 = "下跌"
                        典统异常.Item(典索异常) = 典统异常.Item(典索异常) + 1
                    End If
                    '---------------------------------------------------------------------
                    '平均涨幅
                    '---------------------------------------------------------------------
                    典索异常 = "平均涨幅"
                    典统异常.Item(典索异常) = 典统异常.Item(典索异常) + 值涨幅
                    值高幅 = Round((值今高 / 值前收 - 1) * 100, 2)
                    典索异常 = "平均高幅"
                    典统异常.Item(典索异常) = 典统异常.Item(典索异常) + 值高幅
                    值低幅 = Round((值今低 / 值前收 - 1) * 100, 2)
                    典索异常 = "平均低幅"
                    典统异常.Item(典索异常) = 典统异常.Item(典索异常) + 值低幅
                    '---------------------------------------------------------------------
                    '按照涨幅分类
                    '---------------------------------------------------------------------
                    Select Case 值涨幅
                        '----------------------------------------------------
                        Case Is >= 20
                        典索异常 = "涨档20"
                        典统异常.Item(典索异常) = 典统异常.Item(典索异常) + 1
                        Case Is >= 11
                        典索异常 = "涨档11"
                        典统异常.Item(典索异常) = 典统异常.Item(典索异常) + 1
                        Case Is >= 10
                        典索异常 = "涨档10"
                        典统异常.Item(典索异常) = 典统异常.Item(典索异常) + 1
                        Case Is >= 9
                        典索异常 = "涨档9"
                        典统异常.Item(典索异常) = 典统异常.Item(典索异常) + 1
                        Case Is >= 8
                        典索异常 = "涨档8"
                        典统异常.Item(典索异常) = 典统异常.Item(典索异常) + 1
                        Case Is >= 7
                        典索异常 = "涨档7"
                        典统异常.Item(典索异常) = 典统异常.Item(典索异常) + 1
                        Case Is >= 6
                        典索异常 = "涨档6"
                        典统异常.Item(典索异常) = 典统异常.Item(典索异常) + 1
                        Case Is >= 5
                        典索异常 = "涨档5"
                        典统异常.Item(典索异常) = 典统异常.Item(典索异常) + 1
                        Case Is >= 4
                        典索异常 = "涨档4"
                        典统异常.Item(典索异常) = 典统异常.Item(典索异常) + 1
                        Case Is >= 3
                        典索异常 = "涨档3"
                        典统异常.Item(典索异常) = 典统异常.Item(典索异常) + 1
                        Case Is >= 2
                        典索异常 = "涨档2"
                        典统异常.Item(典索异常) = 典统异常.Item(典索异常) + 1
                        Case Is >= 1
                        典索异常 = "涨档1"
                        典统异常.Item(典索异常) = 典统异常.Item(典索异常) + 1
                        Case Is >= 0
                        典索异常 = "涨档0"
                        典统异常.Item(典索异常) = 典统异常.Item(典索异常) + 1
                        '----------------------------------------------------
                        Case Is >= -1
                        典索异常 = "跌档1"
                        典统异常.Item(典索异常) = 典统异常.Item(典索异常) + 1
                        Case Is >= -2
                        典索异常 = "跌档2"
                        典统异常.Item(典索异常) = 典统异常.Item(典索异常) + 1
                        Case Is >= -3
                        典索异常 = "跌档3"
                        典统异常.Item(典索异常) = 典统异常.Item(典索异常) + 1
                        Case Is >= -4
                        典索异常 = "跌档4"
                        典统异常.Item(典索异常) = 典统异常.Item(典索异常) + 1
                        Case Is >= -5
                        典索异常 = "跌档5"
                        典统异常.Item(典索异常) = 典统异常.Item(典索异常) + 1
                        Case Is >= -6
                        典索异常 = "跌档6"
                        典统异常.Item(典索异常) = 典统异常.Item(典索异常) + 1
                        Case Is >= -7
                        典索异常 = "跌档7"
                        典统异常.Item(典索异常) = 典统异常.Item(典索异常) + 1
                        Case Is >= -8
                        典索异常 = "跌档8"
                        典统异常.Item(典索异常) = 典统异常.Item(典索异常) + 1
                        Case Is >= -9
                        典索异常 = "跌档9"
                        典统异常.Item(典索异常) = 典统异常.Item(典索异常) + 1
                        Case Is >= -10
                        典索异常 = "跌档10"
                        典统异常.Item(典索异常) = 典统异常.Item(典索异常) + 1
                        Case Is >= -20
                        典索异常 = "跌档20"
                        典统异常.Item(典索异常) = 典统异常.Item(典索异常) + 1
                        Case Else
                        典索异常 = "跌档30"
                        典统异常.Item(典索异常) = 典统异常.Item(典索异常) + 1
                        '----------------------------------------------------
                    End Select
                '------------------------------------------------------------------------
                End If
        '--------------------------------------------------------------------------------
        End If
    Next X
'========================================================================================
'格式化：左部总览
'========================================================================================
    Dim 数非停牌 As Integer
    数非停牌 = 计码票 - 集典停牌.Count
    Dim 行号 As Integer
    Dim 列号 As Integer
    With MS
        '--------------------------------------------------------------------------------
        行号 = 1
        With .Cells(行号, 1).Resize(1, 2)
            .Merge
            .Value = Format(Now, "yyyy/mm/dd hh:mm")
        End With
        '--------------------------------------------------------------------------------
        '系列：成交额
        '--------------------------------------------------------------------------------
        行号 = 行号 + 1
        .Cells(行号, 1) = "全市成交额"
        .Cells(行号, 2) = 值上证交额 + 值深证交额
        行号 = 行号 + 1
        .Cells(行号, 1) = "上证成交额"
        .Cells(行号, 2) = 值上证交额
        行号 = 行号 + 1
        .Cells(行号, 1) = "深证成交额"
        .Cells(行号, 2) = 值深证交额
        '--------------------------------------------------------------------------------
        '系列：平均涨幅
        '--------------------------------------------------------------------------------
        行号 = 行号 + 1
        行号 = 行号 + 1
        .Cells(行号, 1) = "平均高幅"
        .Cells(行号, 2) = Round(典统异常("平均高幅") / (数非停牌), 2)
        行号 = 行号 + 1
        .Cells(行号, 1) = "平均涨幅"
        .Cells(行号, 2) = Round(典统异常("平均涨幅") / (数非停牌), 2)
        行号 = 行号 + 1
        .Cells(行号, 1) = "平均低幅"
        .Cells(行号, 2) = Round(典统异常("平均低幅") / (数非停牌), 2)
        '--------------------------------------------------------------------------------
        '系列：板块
        '--------------------------------------------------------------------------------
        行号 = 行号 + 1
        行号 = 行号 + 1
        .Cells(行号, 1) = "交易数"
        .Cells(行号, 2) = 数非停牌
'         行号 = 行号 + 1
'        .Cells(行号, 1) = "停牌"
'        .Cells(行号, 2) = 集典停牌.Count
        行号 = 行号 + 1
        .Cells(行号, 1) = "上涨数"
        .Cells(行号, 2) = 典统异常("上涨")
        行号 = 行号 + 1
        .Cells(行号, 1) = "下跌数"
        .Cells(行号, 2) = 典统异常("下跌")
        '--------------------------------------------------------------------------------
        '间隔
        '--------------------------------------------------------------------------------
        行号 = 行号 + 1
        .Cells(行号, 1).Resize(1, 2).Borders(xlEdgeBottom).Weight = xlThin
        行号 = 行号 + 1
        '--------------------------------------------------------------------------------
        '系列：异常波动
        '--------------------------------------------------------------------------------
        行号 = 行号 + 1
        .Cells(行号, 1) = "涨停无量"
        .Cells(行号, 2) = 集典涨停无量.Count
        行号 = 行号 + 1
        .Cells(行号, 1) = "涨停封板"
        .Cells(行号, 2) = 集典涨停封板.Count
        行号 = 行号 + 1
        .Cells(行号, 1) = "涨停开板"
        .Cells(行号, 2) = 集典涨停开板.Count
        '------------------------------------
        行号 = 行号 + 1
        .Cells(行号, 1) = "异常大涨(" & 全设阈值of大涨 & ")"
        .Cells(行号, 2) = 集典异常大涨.Count
        行号 = 行号 + 1
        .Cells(行号, 1) = "异常大跌(" & 全设阈值of大跌 & ")"
        .Cells(行号, 2) = 集典异常大跌.Count
        '------------------------------------
        行号 = 行号 + 1
        .Cells(行号, 1) = "跌停开板"
        .Cells(行号, 2) = 集典跌停开板.Count
        行号 = 行号 + 1
        .Cells(行号, 1) = "跌停封板"
        .Cells(行号, 2) = 集典跌停封板.Count
        '--------------------------------------------------------------------------------
        '间隔
        '--------------------------------------------------------------------------------
        行号 = 行号 + 1
        .Cells(行号, 1).Resize(1, 2).Borders(xlEdgeBottom).Weight = xlThin
        行号 = 行号 + 1
        '--------------------------------------------------------------------------------
        '系列：异常 量
        '--------------------------------------------------------------------------------
        行号 = 行号 + 1
        .Cells(行号, 1) = "异常量比涨(≥" & 全设阈值of量比 & ")"
        .Cells(行号, 2) = 集典异常量比涨.Count
        行号 = 行号 + 1
        .Cells(行号, 1) = "异常量比跌(≥" & 全设阈值of量比 & ")"
        .Cells(行号, 2) = 集典异常量比跌.Count
        行号 = 行号 + 1
        .Cells(行号, 1) = "异常换手高涨(≥" & 全设阈值of换手高 & ")"
        .Cells(行号, 2) = 集典异常换高涨.Count
        行号 = 行号 + 1
        .Cells(行号, 1) = "异常换手高跌(≥" & 全设阈值of换手高 & ")"
        .Cells(行号, 2) = 集典异常换高跌.Count
        行号 = 行号 + 1
        .Cells(行号, 1) = "异常换手低(＜" & 全设阈值of换手低 & ")"
        .Cells(行号, 2) = 集典异常换低.Count
        '--------------------------------------------------------------------------------
        '系列：异常
        '--------------------------------------------------------------------------------
        行号 = 行号 + 1
        .Cells(行号, 1) = "异常振幅涨(≥" & 全设阈值of振幅 & ")"
        .Cells(行号, 2) = 集典异常振幅涨.Count
        行号 = 行号 + 1
        .Cells(行号, 1) = "异常振幅跌(≥" & 全设阈值of振幅 & ")"
        .Cells(行号, 2) = 集典异常振幅跌.Count
        '--------------------------------------------------------------------------------
        行号 = 行号 + 1
        .Cells(行号, 1) = "异常价格(≥" & 全设阈值of价高 & ")"
        .Cells(行号, 2) = 集典异常价高.Count
        行号 = 行号 + 1
        .Cells(行号, 1) = "异常价格(＜" & 全设阈值of价低 & ")"
        .Cells(行号, 2) = 集典异常价低.Count
        '--------------------------------------------------------------------------------
        行号 = 行号 + 1
        .Cells(行号, 1) = "异常市净(≥" & 全设阈值of净高 & ")"
        .Cells(行号, 2) = 集典异常净高.Count
        行号 = 行号 + 1
        .Cells(行号, 1) = "异常市净(＜" & 全设阈值of净低 & ")"
        .Cells(行号, 2) = 集典异常净低.Count
        '--------------------------------------------------------------------------------
        行号 = 行号 + 1
        .Cells(行号, 1) = "异常市盈(≥" & 全设阈值of盈高 & ")"
        .Cells(行号, 2) = 集典异常盈高.Count
        行号 = 行号 + 1
        .Cells(行号, 1) = "异常市盈(＜" & 全设阈值of盈低 & ")"
        .Cells(行号, 2) = 集典异常盈低.Count
        '--------------------------------------------------------------------------------
        行号 = 行号 + 1
        .Cells(行号, 1) = "异常成交额(≥" & 全设阈值of额高 & ")"
        .Cells(行号, 2) = 集典异常额高.Count
        行号 = 行号 + 1
        .Cells(行号, 1) = "异常成交额(＜" & 全设阈值of额低 & ")"
        .Cells(行号, 2) = 集典异常额低.Count
        '--------------------------------------------------------------------------------
        '间隔
        '--------------------------------------------------------------------------------
        行号 = 行号 + 1
        .Cells(行号, 1).Resize(1, 2).Borders(xlEdgeBottom).Weight = xlThin
        行号 = 行号 + 1
        '--------------------------------------------------------------------------------
        '系列：分涨幅
        '--------------------------------------------------------------------------------
        行号 = 行号 + 1
        .Cells(行号, 1) = "涨档[≥20]"
        .Cells(行号, 2) = 典统异常("涨档20")
        行号 = 行号 + 1
        .Cells(行号, 1) = "涨档[≥11]"
        .Cells(行号, 2) = 典统异常("涨档11")
        行号 = 行号 + 1
        .Cells(行号, 1) = "涨档[≥10]"
        .Cells(行号, 2) = 典统异常("涨档10")
        行号 = 行号 + 1
        .Cells(行号, 1) = "涨档[≥9]"
        .Cells(行号, 2) = 典统异常("涨档9")
        行号 = 行号 + 1
        .Cells(行号, 1) = "涨档[≥8]"
        .Cells(行号, 2) = 典统异常("涨档8")
        行号 = 行号 + 1
        .Cells(行号, 1) = "涨档[≥7]"
        .Cells(行号, 2) = 典统异常("涨档7")
        行号 = 行号 + 1
        .Cells(行号, 1) = "涨档[≥6]"
        .Cells(行号, 2) = 典统异常("涨档6")
        行号 = 行号 + 1
        .Cells(行号, 1) = "涨档[≥5]"
        .Cells(行号, 2) = 典统异常("涨档5")
        行号 = 行号 + 1
        .Cells(行号, 1) = "涨档[≥4]"
        .Cells(行号, 2) = 典统异常("涨档4")
        行号 = 行号 + 1
        .Cells(行号, 1) = "涨档[≥3]"
        .Cells(行号, 2) = 典统异常("涨档3")
        行号 = 行号 + 1
        .Cells(行号, 1) = "涨档[≥2]"
        .Cells(行号, 2) = 典统异常("涨档2")
        行号 = 行号 + 1
        .Cells(行号, 1) = "涨档[≥1]"
        .Cells(行号, 2) = 典统异常("涨档1")
        行号 = 行号 + 1
        .Cells(行号, 1) = "涨档[≥0]"
        .Cells(行号, 2) = 典统异常("涨档0")
        '----------------------------------
        行号 = 行号 + 1
        .Cells(行号, 1) = "跌档[≥-1]"
        .Cells(行号, 2) = 典统异常("跌档1")
        行号 = 行号 + 1
        .Cells(行号, 1) = "跌档[≥-2]"
        .Cells(行号, 2) = 典统异常("跌档2")
        行号 = 行号 + 1
        .Cells(行号, 1) = "跌档[≥-3]"
        .Cells(行号, 2) = 典统异常("跌档3")
        行号 = 行号 + 1
        .Cells(行号, 1) = "跌档[≥-4]"
        .Cells(行号, 2) = 典统异常("跌档4")
        行号 = 行号 + 1
        .Cells(行号, 1) = "跌档[≥-5]"
        .Cells(行号, 2) = 典统异常("跌档5")
        行号 = 行号 + 1
        .Cells(行号, 1) = "跌档[≥-6]"
        .Cells(行号, 2) = 典统异常("跌档6")
        行号 = 行号 + 1
        .Cells(行号, 1) = "跌档[≥-7]"
        .Cells(行号, 2) = 典统异常("跌档7")
        行号 = 行号 + 1
        .Cells(行号, 1) = "跌档[≥-8]"
        .Cells(行号, 2) = 典统异常("跌档8")
        行号 = 行号 + 1
        .Cells(行号, 1) = "跌档[≥-9]"
        .Cells(行号, 2) = 典统异常("跌档9")
        行号 = 行号 + 1
        .Cells(行号, 1) = "跌档[≥-10]"
        .Cells(行号, 2) = 典统异常("跌档10")
        行号 = 行号 + 1
        .Cells(行号, 1) = "跌档[≥-20]"
        .Cells(行号, 2) = 典统异常("跌档20")
        行号 = 行号 + 1
        .Cells(行号, 1) = "跌档[≥-30]"
        .Cells(行号, 2) = 典统异常("跌档30")
        '--------------------------------------------------------------------------------
    End With
    '------------------------------------------------------------------------------------
    '格式化
    '------------------------------------------------------------------------------------
    With MS.Columns("A:B")
        .Interior.Color = 常色主靛
        .Font.Bold = True
    End With
    MS.Columns("A").ColumnWidth = 19
    MS.Columns("B").ColumnWidth = 7
    MS.Columns("A").HorizontalAlignment = xlLeft
    MS.Columns("B").HorizontalAlignment = xlRight
    MS.Columns("C:Z").Hidden = True
'========================================================================================
'输出信息
'========================================================================================
    列号 = 27
    '====================================================================================
    行号 = 始行 + 1
    Call 区域UNQT格程(MS, 首列:=列号, 标行:=1, 基色底:=常色主靛)
    行号 = 查程异常(MS, 行号, 列号, 天组, "涨停无量", 集典涨停无量, 位列天组今涨)
    行号 = 查程异常(MS, 行号, 列号, 天组, "涨停封板", 集典涨停封板, 位列天组今涨)
    行号 = 查程异常(MS, 行号, 列号, 天组, "涨停开板", 集典涨停开板, 位列天组今涨)
    '====================================================================================
    列号 = 列号 + 26
    行号 = 始行 + 1
    Call 区域UNQT格程(MS, 首列:=列号, 标行:=1, 基色底:=常色主靛)
    行号 = 查程异常(MS, 行号, 列号, 天组, "异常大涨", 集典异常大涨, 位列天组今涨)
    '====================================================================================
    列号 = 列号 + 26
    行号 = 始行 + 1
    Call 区域UNQT格程(MS, 首列:=列号, 标行:=1, 基色底:=常色主靛)
    行号 = 查程异常(MS, 行号, 列号, 天组, "跌停封板", 集典跌停封板, 位列天组今涨, xlAscending)
    行号 = 查程异常(MS, 行号, 列号, 天组, "跌停开板", 集典跌停开板, 位列天组今涨, xlAscending)
    '====================================================================================
    列号 = 列号 + 26
    行号 = 始行 + 1
    Call 区域UNQT格程(MS, 首列:=列号, 标行:=1, 基色底:=常色主靛)
    行号 = 查程异常(MS, 行号, 列号, 天组, "异常大跌", 集典异常大跌, 位列天组今涨, xlAscending)
    '====================================================================================
    列号 = 列号 + 26
    行号 = 始行 + 1
    Call 区域UNQT格程(MS, 首列:=列号, 标行:=1, 基色底:=常色主靛)
    行号 = 查程异常(MS, 行号, 列号, 天组, "异常振幅涨", 集典异常振幅涨, 位列天组振幅)
    行号 = 查程异常(MS, 行号, 列号, 天组, "异常振幅跌", 集典异常振幅跌, 位列天组振幅)
    '====================================================================================
    列号 = 列号 + 26
    行号 = 始行 + 1
    Call 区域UNQT格程(MS, 首列:=列号, 标行:=1, 基色底:=常色主靛)
    行号 = 查程异常(MS, 行号, 列号, 天组, "异常量比涨", 集典异常量比涨, 位列天组量比)
    行号 = 查程异常(MS, 行号, 列号, 天组, "异常量比跌", 集典异常量比跌, 位列天组量比)
    '====================================================================================
    列号 = 列号 + 26
    行号 = 始行 + 1
    Call 区域UNQT格程(MS, 首列:=列号, 标行:=1, 基色底:=常色主靛)
    行号 = 查程异常(MS, 行号, 列号, 天组, "异常换手高涨", 集典异常换高涨, 位列天组换手)
    行号 = 查程异常(MS, 行号, 列号, 天组, "异常换手高跌", 集典异常换高跌, 位列天组换手)
    '====================================================================================
'    列号 = 列号 + 26
'    行号 = 始行 + 1
'    Call 区域UNQT格程(MS, 首列:=列号, 标行:=1, 基色底:=常色主靛)
'    行号 = 查程异常(MS, 行号, 列号, 天组, "异常换手低", 集典异常换低, 位列天组换手, xlAscending)
    '====================================================================================
'    列号 = 列号 + 26
'    行号 = 始行 + 1
'    Call 区域UNQT格程(MS, 首列:=列号, 标行:=1, 基色底:=常色主靛)
'    行号 = 查程异常(MS, 行号, 列号, 天组, "异常价低", 集典异常价低, 位列天组今收, xlAscending)
    '====================================================================================
    列号 = 列号 + 26
    行号 = 始行 + 1
    Call 区域UNQT格程(MS, 首列:=列号, 标行:=1, 基色底:=常色主靛)
    行号 = 查程异常(MS, 行号, 列号, 天组, "异常价高", 集典异常价高, 位列天组今收)
    '====================================================================================
    列号 = 列号 + 26
    行号 = 始行 + 1
    Call 区域UNQT格程(MS, 首列:=列号, 标行:=1, 基色底:=常色主靛)
    行号 = 查程异常(MS, 行号, 列号, 天组, "异常额高", 集典异常额高, 位列天组今额)
'    列号 = 列号 + 26
'    行号 = 始行 + 1
'    Call 区域UNQT格程(MS, 首列:=列号, 标行:=1, 基色底:=常色主靛)
'    行号 = 查程异常(MS, 行号, 列号, 天组, "异常额低", 集典异常额低, 位列天组今额, xlAscending)
    '====================================================================================
'    列号 = 列号 + 26
'    行号 = 始行 + 1
'    Call 区域UNQT格程(MS, 首列:=列号, 标行:=1, 基色底:=常色主靛)
'    行号 = 查程异常(MS, 行号, 列号, 天组, "异常净低", 集典异常净低, 位列天组市净, xlAscending)
    '行号 = 查程异常(MS, 行号, 列号, 天组, "异常盈低", 集典异常盈低, 位列天组市盈, xlAscending)
    '行号 = 查程异常(MS, 行号, 列号, 天组, "异常盈高", 集典异常盈高,位列天组市盈)
    '行号 = 查程异常(MS, 行号, 列号, 天组, "异常净低", 集典异常净低, 位列天组市净, xlAscending)
    '行号 = 查程异常(MS, 行号, 列号, 天组, "异常净高", 集典异常净高, 位列天组市净)
    '行号 = 行号 + 10
    '行号 = 查程异常(MS, 行号, 列号, 天组, "正常交易", 集典正常交易, 位列天组今涨)
    '====================================================================================
'    列号 = 列号 + 26
'    行号 = 始行 + 1
'    Call 区域UNQT格程(MS, 首列:=列号, 标行:=1, 基色底:=常色主靛)
'========================================================================================
'输出：研究工表
'========================================================================================
    Dim WSRS As Worksheet
    Call PBASE格程工具_表操工表新增(WSRS, "." & MS.Name, MS.Parent, 基色底:=常色主黄)
    Call 区域UNQT格程(WSRS, 首列:=1, 标行:=1, 基色底:=常色主靛)
    '====================================================================================
    列号 = 1
    行号 = 2
    行号 = 查程异常(WSRS, 行号, 列号, 天组, "涨停无量", 集典涨停无量, 位列天组今涨)
    行号 = 查程异常(WSRS, 行号, 列号, 天组, "涨停封板", 集典涨停封板, 位列天组今涨)
    行号 = 查程异常(WSRS, 行号, 列号, 天组, "涨停开板", 集典涨停开板, 位列天组今涨)
    行号 = 查程异常(WSRS, 行号, 列号, 天组, "异常大涨", 集典异常大涨, 位列天组今涨)
    '====================================================================================
    行号 = 查程异常(WSRS, 行号, 列号, 天组, "跌停封板", 集典跌停封板, 位列天组今涨, xlAscending)
    行号 = 查程异常(WSRS, 行号, 列号, 天组, "跌停开板", 集典跌停开板, 位列天组今涨, xlAscending)
    行号 = 查程异常(WSRS, 行号, 列号, 天组, "异常大跌", 集典异常大跌, 位列天组今涨, xlAscending)
    '====================================================================================
'    行号 = 查程异常(WSRS, 行号, 列号, 天组, "异常振幅涨", 集典异常振幅涨, 位列天组振幅)
'    行号 = 查程异常(WSRS, 行号, 列号, 天组, "异常振幅跌", 集典异常振幅跌, 位列天组振幅)
'    '====================================================================================
'    行号 = 查程异常(WSRS, 行号, 列号, 天组, "异常量比涨", 集典异常量比涨, 位列天组量比)
'    行号 = 查程异常(WSRS, 行号, 列号, 天组, "异常量比跌", 集典异常量比跌, 位列天组量比)
'    行号 = 查程异常(WSRS, 行号, 列号, 天组, "异常换手涨", 集典异常换高涨, 位列天组换手)
'    行号 = 查程异常(WSRS, 行号, 列号, 天组, "异常换手跌", 集典异常换高跌, 位列天组换手)
'    '====================================================================================
    Call IQQQ展擎瓜页引擎基程(WSRS, "更新排否", "SSC", 基色底:=常色主靛)
    Set WSRS = Nothing
'========================================================================================
'清理变量
'========================================================================================
    Set 集典停牌 = Nothing
    Set 集典涨停封板 = Nothing
    Set 集典涨停无量 = Nothing
    Set 集典涨停开板 = Nothing
    Set 集典跌停封板 = Nothing
    Set 集典跌停开板 = Nothing
    Set 集典异常大涨 = Nothing
    Set 集典异常大跌 = Nothing
    Set 集典异常振幅涨 = Nothing
    Set 集典异常振幅跌 = Nothing
    Set 集典异常量比涨 = Nothing
    Set 集典异常量比跌 = Nothing
    Set 集典异常换高涨 = Nothing
    Set 集典异常换高跌 = Nothing
    Set 集典异常价高 = Nothing
    Set 集典异常价低 = Nothing
    Set 集典正常交易 = Nothing
    Set 集典异常额高 = Nothing
    Set 集典异常额低 = Nothing
    Set 集典异常净高 = Nothing
    Set 集典异常净低 = Nothing
    Set 集典异常盈高 = Nothing
    Set 集典异常盈低 = Nothing
    '------------------------------------------------------------------------------------
    典统异常.RemoveAll
    Set 典统异常 = Nothing
'========================================================================================
End Function






'========================================================================================
'========================================================================================
'格式化：行情部分
'========================================================================================
'========================================================================================
Private Function 区域UNQT格程( _
      WS As Worksheet _
    , Optional 首列 As Integer = 1 _
    , Optional 基色底 As Long = 常色主绿 _
    , Optional 基色调 As Double = 0.8 _
    , Optional 标行 As Integer = 1 _
    ) As Integer
'========================================================================================
'列格式
'========================================================================================
    WS.Columns(首列).Columns(位列天组代码).NumberFormatLocal = 全设格式of代码
    WS.Columns(首列).Columns(位列天组今涨).NumberFormatLocal = 全设格式of一位
    WS.Columns(首列).Columns(位列天组振幅).NumberFormatLocal = 全设格式of零位
    WS.Columns(首列).Columns(位列天组量比).NumberFormatLocal = 全设格式of零位
    WS.Columns(首列).Columns(位列天组换手).NumberFormatLocal = 全设格式of零位
    WS.Columns(首列).Columns(位列天组今收).NumberFormatLocal = 全设格式of零位
    WS.Columns(首列).Columns(位列天组前收).NumberFormatLocal = 全设格式of零位
    WS.Columns(首列).Columns(位列天组今开).NumberFormatLocal = 全设格式of零位
    WS.Columns(首列).Columns(位列天组流市).NumberFormatLocal = 全设格式of零位
    WS.Columns(首列).Columns(位列天组总市).NumberFormatLocal = 全设格式of零位
    WS.Columns(首列).Columns(位列天组今额).NumberFormatLocal = 全设格式of零位
    WS.Columns(首列).Columns(位列天组市净).NumberFormatLocal = 全设格式of零位
    WS.Columns(首列).Columns(位列天组市盈).NumberFormatLocal = 全设格式of零位
    WS.Columns(首列).Columns(位列天组时间).NumberFormatLocal = 全设格式of零位
    '------------------------------------------------------------------------------------
    WS.Cells(标行, 首列).Resize(1, 位列天组维度).EntireColumn.ColumnWidth = 4
    
    WS.Columns(首列).Columns(位列天组代码).ColumnWidth = 9
    WS.Columns(首列).Columns(位列天组代称).ColumnWidth = 10
    WS.Columns(首列).Columns(位列天组代称).HorizontalAlignment = xlRight
    WS.Columns(首列).Columns(位列天组今涨).ColumnWidth = 6
    WS.Columns(首列).Columns(位列天组今收).ColumnWidth = 4
    WS.Columns(首列).Columns(位列天组振幅).ColumnWidth = 3.5
    WS.Columns(首列).Columns(位列天组量比).ColumnWidth = 3.5
    WS.Columns(首列).Columns(位列天组换手).ColumnWidth = 3.5
    WS.Columns(首列).Columns(位列天组今额).ColumnWidth = 4
    WS.Columns(首列).Columns(位列天组市盈).ColumnWidth = 4
    WS.Columns(首列).Columns(位列天组市净).ColumnWidth = 4
    '------------------------------------------------------------------------------------
    WS.Cells(标行, 首列).Resize(1, 位列天组维度).EntireColumn.Hidden = True
    
    WS.Columns(首列).Columns(位列天组代称).Hidden = False
    WS.Columns(首列).Columns(位列天组今涨).Hidden = False
    WS.Columns(首列).Columns(位列天组振幅).Hidden = False
    WS.Columns(首列).Columns(位列天组量比).Hidden = False
    WS.Columns(首列).Columns(位列天组换手).Hidden = False
    
    
'    WS.Columns(首列).Columns(位列天组代码).Hidden = True
'    WS.Columns(首列).Columns(位列天组前收).Hidden = True
'    WS.Columns(首列).Columns(位列天组今收).Hidden = True
'    WS.Columns(首列).Columns(位列天组今开).Hidden = True
'    WS.Columns(首列).Columns(位列天组今高).Hidden = True
'    WS.Columns(首列).Columns(位列天组今低).Hidden = True
'    WS.Columns(首列).Columns(位列天组涨停).Hidden = True
'    WS.Columns(首列).Columns(位列天组跌停).Hidden = True
'    WS.Columns(首列).Columns(位列天组今量).Hidden = True
'    WS.Columns(首列).Columns(位列天组外盘).Hidden = True
'    WS.Columns(首列).Columns(位列天组内盘).Hidden = True
'    WS.Columns(首列).Columns(位列天组今额).Hidden = True
'    WS.Columns(首列).Columns(位列天组流市).Hidden = True
'    WS.Columns(首列).Columns(位列天组总市).Hidden = True
'    WS.Columns(首列).Columns(位列天组市盈).Hidden = True
'    WS.Columns(首列).Columns(位列天组市净).Hidden = True
'    WS.Columns(首列).Columns(位列天组时间).Hidden = True
'    WS.Columns(首列).Columns(位列天组停牌).Hidden = True
'
'    WS.Columns(首列).Columns(位列天组维度 + 1).Hidden = True
'    WS.Columns(首列).Columns(位列天组维度 + 2).Hidden = True
    '------------------------------------------------------------------------------------
    Call PBASE格程工具_表冻结锁定(WS, 标行)
'========================================================================================
'标题行
'========================================================================================
    With WS.Cells(标行, 首列).Resize(1, 位列天组维度)
        .Interior.Color = 基色底
        .Font.Color = 常色主黑
        .Font.Bold = True
        .HorizontalAlignment = xlRight
    End With
    '------------------------------------------------------------------------------------
    Dim ARRTITLE(1 To 位列天组维度) As String
    
    ARRTITLE(位列天组代码) = "代码"
    ARRTITLE(位列天组代称) = "代称"
    ARRTITLE(位列天组今涨) = "涨幅"
    ARRTITLE(位列天组今收) = "今收"
    ARRTITLE(位列天组前收) = "前收"
    ARRTITLE(位列天组今开) = "今开"
    ARRTITLE(位列天组振幅) = "振幅"
    ARRTITLE(位列天组今高) = "最高"
    ARRTITLE(位列天组今低) = "最低"
    ARRTITLE(位列天组涨停) = "涨停"
    ARRTITLE(位列天组跌停) = "跌停"
    ARRTITLE(位列天组量比) = "量比"
    ARRTITLE(位列天组换手) = "换手"
    ARRTITLE(位列天组今量) = "交量"
    ARRTITLE(位列天组外盘) = "外盘"
    ARRTITLE(位列天组内盘) = "内盘"
    ARRTITLE(位列天组今额) = "交额"
    ARRTITLE(位列天组流市) = "流通市值"
    ARRTITLE(位列天组总市) = "总市值"
    ARRTITLE(位列天组市盈) = "市盈"
    ARRTITLE(位列天组市净) = "市净"
    ARRTITLE(位列天组时间) = "时间"
    ARRTITLE(位列天组停牌) = "停牌"
    '------------------------------------------------------------------------------------
    WS.Cells(标行, 首列).Resize(1, UBound(ARRTITLE) - LBound(ARRTITLE) + 1) = ARRTITLE
    Erase ARRTITLE
'========================================================================================
End Function





Function 查程异常( _
          去表 As Worksheet _
        , 去行 As Integer _
        , 去列 As Integer _
        , 天组 As Variant _
        , 异常类型 As String _
        , 去典 As Dictionary _
        , 异常位列 As Integer _
        , Optional 异常排序 As XlSortOrder = xlDescending _
        ) As Integer
'========================================================================================
'判断是否存在异常
'========================================================================================
    '------------------------------------------------------------------------------------
    '陈列计数
    '------------------------------------------------------------------------------------
    Dim 去数 As Integer
    去数 = 去典.Count
    
    If 去数 = 0 Then
        查程异常 = 去行
        Exit Function
    End If
'========================================================================================
'输出：标题
'========================================================================================
    With 去表.Cells(去行, 去列)
        .Cells(1, 位qt代称).Value = 异常类型
        .Cells(1, 位qt代称).Font.ColorIndex = 6
        .Cells(1, 位qt代称).Font.Bold = True
        .Cells(1, 位qt今涨幅).NumberFormatLocal = 全设格式of零位
        If 去列 = 1 Then
            .Cells(1, 位qt行益).Value = 去数
        Else
            .Cells(1, 位qt今涨幅).Value = 去数
            .Cells(1, 位qt今涨幅).Font.ColorIndex = 6
        End If
    End With
    去表.Columns(去列 - 1 + 异常位列).Hidden = False
'========================================================================================
'输出：具体数据
'========================================================================================
    Dim 天组定位 As Integer
    Dim X As Integer
    Dim Y As Integer
    With 去表.Cells(去行, 去列).Offset(1, 0)
            '============================================================================
            '遍历
            '============================================================================
            For X = 1 To 去数
                '------------------------------------------------------------------------
                '数值输出
                '------------------------------------------------------------------------
                天组定位 = 去典.Items(X - 1)
                For Y = LBound(天组, 2) To UBound(天组, 2)
                    .Cells(X, Y) = 天组(天组定位, Y)
                Next Y
                '------------------------------------------------------------------------
                '格式化
                '------------------------------------------------------------------------
                .Cells(X, 1).Resize(1, 位列天组维度).Interior.ColorIndex = 15
        
                .Cells(X, 位列天组代码).Font.Color = 常色主绿
                .Cells(X, 位列天组代码).Interior.Color = 常色主绿
                .Cells(X, 位列天组代称).Interior.Color = 常色主绿
                .Cells(X, 异常位列).Interior.Color = 常色十青
                .Cells(X, 异常位列).Interior.ColorIndex = 33
                '------------------------------------------------------------------------
            Next X
            '============================================================================
            '排序
            '============================================================================
            .Resize(去数, 位列天组维度).Sort key1:=.Cells(1, 异常位列), order1:=异常排序, Header:=xlNo
            '============================================================================
    End With
'========================================================================================
'返回值
'========================================================================================
    查程异常 = 去行 + 去数 + 1
'========================================================================================
End Function



