Attribute VB_Name = "WMR现市_B3指基"




'========================================================================================
'========================================================================================
'调用：沪深指数与基金
'========================================================================================
'========================================================================================
Function 现市基程_中股指基( _
          MS As Worksheet _
        , Optional 是否排序 As XlSortOrder = xlDescending _
        , Optional 始行 As Integer = 3 _
        , Optional 始列 As Integer = 3 _
        , Optional 天组 As Variant _
        , Optional 天典 As Dictionary _
        ) As Boolean
'========================================================================================
'页面格式设置
'========================================================================================
    MS.Cells.Font.Size = 10
    MS.Columns.ColumnWidth = 2
'========================================================================================
'展示：沪深盘面
'========================================================================================
    始列 = 现市特程_CN_沪深盘面大盘(MS, 始行, 始列, 是否标题:=True)
'========================================================================================
'展示：沪深指数系列
'========================================================================================
    始列 = 始列 + 1
    '------------------------------------------------------------------------------------
    始列 = 现市分程_指数体系_系列上证(MS, 始行, 始列)
    '------------------------------------------------------------------------------------
    始列 = 现市分程_指数体系_系列深证(MS, 始行, 始列)
    '------------------------------------------------------------------------------------
    始列 = 现市分程_指数体系_系列国证(MS, 始行, 始列)
    '------------------------------------------------------------------------------------
    始列 = 现市分程_指数体系_系列中证(MS, 始行, 始列)
'========================================================================================
'页面格式设置
'========================================================================================
    With MS.Rows(始行)
        .Font.Bold = True
        .HorizontalAlignment = xlLeft
        .Borders(xlEdgeBottom).Weight = xlThin
    End With
    MS.Activate
    ActiveWindow.Zoom = 80
'----------------------------------------------------------------------------------------
End Function








'========================================================================================
'========================================================================================
'沪深股指
'========================================================================================
'========================================================================================
Function 现市特程_CN_沪深盘面大盘( _
          MS As Worksheet _
        , 始行 As Integer _
        , 始列 As Integer _
        , Optional 是否标题 As Boolean = False _
        , Optional 是否返列 As Boolean = True _
        ) As Integer
'========================================================================================
'设置
'========================================================================================
    Dim 目行 As Integer
    Dim 目列 As Integer
    目行 = 始行
    目列 = 始列
    '------------------------------------------------------------------------------------
    If 是否标题 = True Then
        With MS.Cells(目行, 目列).Cells(1, 位简式名称)
            .Value = "沪深大盘"
            .Font.Bold = True
        End With
        目行 = 目行 + 1
    End If
'========================================================================================
'列表：沪深大盘
'========================================================================================
Dim 码典沪深指数 As New Dictionary
With 码典沪深指数
    '---------------------------------------
    .Add Item:="sh000001", Key:="上证指数"
    .Add Item:="sz399673", Key:="创业板50"
    .Add Item:="sh000688", Key:="科创50"
'    .Add Item:="sz399006", Key:="创业板指"
'    .Add Item:="sz399001", Key:="深证成指"
    .Add Item:="sz399678", Key:="深次新股"
'    .Add Item:="sh000159", Key:="沪股通"
    .Add Item:="sh000003", Key:="B股指数"
    '---------------------------------------
'    .Add Item:="", Key:="市场指数"
'    .Add Item:="sh000002", Key:="A股指数"
'    .Add Item:="sh000003", Key:="B股指数"
'    .Add Item:="hkHSI", Key:="恒生指数"
    '---------------------------------------
    .Add Item:="", Key:="宽基指数"
    .Add Item:="sh000016", Key:="上证50"
    .Add Item:="sh000300", Key:="沪深300"
    .Add Item:="sh000905", Key:="中证500"
    .Add Item:="sh000852", Key:="中证1000"
    .Add Item:="sz159531", Key:="中证2000"
    '---------------------------------------
End With
'========================================================================================
'输出
'========================================================================================
    现市特程_CN_沪深盘面大盘 = 查程混市码典(码典沪深指数, MS, 目行, 目列, 是否扩展:=True, 是否返列:=是否返列)
    Set 码典沪深指数 = Nothing
'========================================================================================
End Function


'========================================================================================
'========================================================================================
'沪深股指
'========================================================================================
'========================================================================================
Function 现市特程_CN_沪深盘面行业( _
          MS As Worksheet _
        , 始行 As Integer _
        , 始列 As Integer _
        , Optional 是否标题 As Boolean = False _
        , Optional 是否返列 As Boolean = True _
        ) As Integer
'========================================================================================
'设置
'========================================================================================
    Dim 目行 As Integer
    Dim 目列 As Integer
    目行 = 始行
    目列 = 始列
    '------------------------------------------------------------------------------------
    If 是否标题 = True Then
        With MS.Cells(目行, 目列).Cells(1, 位简式名称)
            .Value = "沪深行业"
            .Font.Bold = True
        End With
        目行 = 目行 + 1
    End If
'========================================================================================
'列表：沪深 行业金融类
'========================================================================================
Dim 码典沪深行业金融类 As New Dictionary
With 码典沪深行业金融类
    '---------------------------------------
    '.Add Item:="", Key:="金融"
    .Add Item:="sz399437", Key:="国证证券"
    .Add Item:="sz399809", Key:="保险主题"
    .Add Item:="sz399986", Key:="中证银行"
    .Add Item:="sz399393", Key:="国证地产"
'    .Add Item:="sz399983", Key:="地产等权"
    '---------------------------------------
End With
'========================================================================================
'列表：沪深行业 周期类
'========================================================================================
Dim 码典沪深行业周期类 As New Dictionary
With 码典沪深行业周期类
    '---------------------------------------
    .Add Item:="sz399395", Key:="国证有色"
    .Add Item:="sz399440", Key:="国证钢铁"
    .Add Item:="sz399436", Key:="国证煤炭"
    .Add Item:="sz399990", Key:="煤炭等权"
    .Add Item:="sz399438", Key:="国证电力"
    .Add Item:="sz399439", Key:="国证油气"
    '---------------------------------------
End With
'========================================================================================
'列表：沪深行业 制造类
'========================================================================================
Dim 码典沪深行业制造类 As New Dictionary
With 码典沪深行业制造类
    '---------------------------------------
'    .Add Item:="", Key:="主题汽车"
    .Add Item:="sz399432", Key:="国证汽车"
    .Add Item:="sz399976", Key:="CS新能车"
    .Add Item:="sz399412", Key:="国证新能"
'    .Add Item:="sz399808", Key:="中证新能"
    '---------------------------------------
    '.Add Item:="", Key:="高端制造"
    .Add Item:="sh000097", Key:="高端装备"
    .Add Item:="sz399803", Key:="工业4.0"
'    .Add Item:="", Key:="主题高铁"
'    .Add Item:="sz399419", Key:="国证高铁"
    .Add Item:="sz399807", Key:="高铁产业"
    '---------------------------------------
'    .Add Item:="", Key:="主题军工"
    .Add Item:="sz399973", Key:="中证国防"
    .Add Item:="sz399967", Key:="中证军工"
'    .Add Item:="sz399368", Key:="国证军工"
    .Add Item:="sz399813", Key:="中证国安"
    '.Add Item:="sz399418", Key:="国证国安"
    '---------------------------------------
End With
'========================================================================================
'列表：沪深行业 消费类
'========================================================================================
Dim 码典沪深行业消费类 As New Dictionary
With 码典沪深行业消费类
    '---------------------------------------
    '.Add Item:="", Key:="主题医药"
    .Add Item:="sh000933", Key:="中证医药"
    .Add Item:="sz399989", Key:="中证医疗"
    .Add Item:="sz399441", Key:="生物医药"
    '---------------------------------------
    .Add Item:="", Key:="主题食品"
    .Add Item:="sz399997", Key:="中证白酒"
    .Add Item:="sz399396", Key:="国证食品"
    '---------------------------------------
    '.Add Item:="", Key:="主题农业"
    '.Add Item:="sz399814", Key:="大农业"
    '.Add Item:="sz399435", Key:="国证农牧"
    '---------------------------------------
    '.Add Item:="", Key:="主题商业"
    '.Add Item:="sz399361", Key:="国证商业"
    '.Add Item:="sz399320", Key:="国证服务"
    ''---------------------------------------
    '.Add Item:="", Key:="主题物流"
    .Add Item:="sz399433", Key:="国证交运"
    .Add Item:="sz399353", Key:="国证物流"
    '---------------------------------------
End With
'========================================================================================
'列表：沪深行业 科技类
'========================================================================================
Dim 码典沪深行业科技类 As New Dictionary
With 码典沪深行业科技类
    '---------------------------------------
'    .Add Item:="", Key:="主题通信"
'    .Add Item:="sh000936", Key:="中证电信"
    .Add Item:="sz399389", Key:="国证通信"
    '---------------------------------------
    '.Add Item:="", Key:="主题科技指数"
    .Add Item:="sz399652", Key:="中创高新"
    .Add Item:="sh000998", Key:="中证TMT"
    '---------------------------------------
    .Add Item:="", Key:="主题传媒"
    .Add Item:="sh000935", Key:="中证信息"
    .Add Item:="sz399971", Key:="中证传媒"
    .Add Item:="sz399804", Key:="中证体育"
    '---------------------------------------
    .Add Item:="", Key:="主题硬件"
    .Add Item:="sz399363", Key:="计算机"
    .Add Item:="sz399360", Key:="新硬件"
    '---------------------------------------
    .Add Item:="", Key:="主题互联网"
    .Add Item:="sz399970", Key:="移动互联"
    .Add Item:="sz399994", Key:="信息安全"
    '.Add Item:="sz399805", Key:="互联金融"
    '---------------------------------------
End With
'========================================================================================
'列表：指数基金
'========================================================================================
Dim 码典国内股指ETF As New Dictionary
With 码典国内股指ETF
    '---------------------------------------
    .Add Item:="sh510050", Key:="上证50"
    .Add Item:="sh510300", Key:="沪深300"
    .Add Item:="sz159901", Key:="深100"
    .Add Item:="sz159915", Key:="创业板"
    .Add Item:="sz159922", Key:="中证500"
    '---------------------------------------
    '.Add Item:="", Key:="深证主题"
    '.Add Item:="sz399670", Key:="深周期50"
    '.Add Item:="sz399671", Key:="深防御50"
    '.Add Item:="sz399646", Key:="深消费50"
    '.Add Item:="sz399647", Key:="深医药50"
    '.Add Item:="sz399608", Key:="科技100"
    '.Add Item:="sz399610", Key:="TMT50"
    '---------------------------------------
    .Add Item:="", Key:="主题国外基金"
    .Add Item:="sh513100", Key:="纳斯达克100"
    .Add Item:="sz159920", Key:="恒生ETF"
    .Add Item:="sh510900", Key:="恒H股ETF"
    .Add Item:="sh513900", Key:="港股通100"
    .Add Item:="sh513060", Key:="恒生医疗"
    .Add Item:="sh513330", Key:="恒生互联"
    '---------------------------------------
End With
'========================================================================================
'输出
'========================================================================================
目行 = 查程混市码典(码典沪深行业金融类, MS, 目行, 目列, 是否扩展:=True, 是否返列:=False)
Set 码典沪深行业金融类 = Nothing
'----------------------------------------------------------------------------------------
目行 = 目行 + 1
目行 = 查程混市码典(码典沪深行业周期类, MS, 目行, 目列, 是否扩展:=True, 是否返列:=False)
Set 码典沪深行业周期类 = Nothing
'----------------------------------------------------------------------------------------
目行 = 目行 + 1
目行 = 查程混市码典(码典沪深行业制造类, MS, 目行, 目列, 是否扩展:=True, 是否返列:=False)
Set 码典沪深行业制造类 = Nothing
'----------------------------------------------------------------------------------------
目行 = 目行 + 1
目行 = 查程混市码典(码典沪深行业消费类, MS, 目行, 目列, 是否扩展:=True, 是否返列:=False)
Set 码典沪深行业周期类 = Nothing
'----------------------------------------------------------------------------------------
目行 = 目行 + 1
目行 = 查程混市码典(码典沪深行业科技类, MS, 目行, 目列, 是否扩展:=True, 是否返列:=False)
Set 码典沪深行业科技类 = Nothing
'========================================================================================
'返回
'========================================================================================
目行 = 目行 + 1
现市特程_CN_沪深盘面行业 = 查程混市码典(码典国内股指ETF, MS, 目行, 目列, 是否扩展:=True, 是否返列:=是否返列)
Set 码典国内股指ETF = Nothing
'========================================================================================
End Function




Function 现市分程_指数体系_系列国证(MS As Worksheet, 始行 As Integer, 始列 As Integer) As Integer
'========================================================================================
'设置
'========================================================================================
    MS.Cells(始行, 始列).Cells(1, 位简式名称) = "国证指数体系"
    '-------------------------------------------------------------------------
    Dim 目行 As Integer
    Dim 目列 As Integer
    目行 = 始行 + 1
    目列 = 始列
'========================================================================================
'列表：系列国证
'========================================================================================
Dim 码典系列国证 As New Dictionary
With 码典系列国证
'---------------------------------------
'.Add Item:="", Key:="系列国证综合指数"
.Add Item:="sz399317", Key:="国证Ａ指"
.Add Item:="sz399318", Key:="国证Ｂ指"
'---------------------------------------
.Add Item:="", Key:="系列国证规模指数"
.Add Item:="sz399310", Key:="国证50"
.Add Item:="sz399312", Key:="国证300"
.Add Item:="sz399311", Key:="国证1000"
.Add Item:="sz399303", Key:="国证2000"
'---------------------------------------
.Add Item:="", Key:="系列国证风格指数"
.Add Item:="sz399371", Key:="国证价值"
.Add Item:="sz399370", Key:="国证成长"
.Add Item:="sz399373", Key:="大盘价值"
.Add Item:="sz399372", Key:="大盘成长"
.Add Item:="sz399375", Key:="中盘价值"
.Add Item:="sz399374", Key:="中盘成长"
.Add Item:="sz399377", Key:="小盘价值"
.Add Item:="sz399376", Key:="小盘成长"
'---------------------------------------
.Add Item:="", Key:="系列国证行业指数"
.Add Item:="sz399431", Key:="国证银行"
.Add Item:="sz399437", Key:="国证证券"
.Add Item:="sz399420", Key:="国证保证"
.Add Item:="sz399395", Key:="国证有色"
.Add Item:="sz399436", Key:="国证煤炭"
.Add Item:="sz399440", Key:="国证钢铁"
.Add Item:="sz399366", Key:="国证大宗"
.Add Item:="sz399439", Key:="国证油气"
.Add Item:="sz399438", Key:="国证电力"

'.Add Item:="sz399433", Key:="国证交运"
'.Add Item:="sz399353", Key:="国证物流"

.Add Item:="sz399393", Key:="国证地产"
.Add Item:="sz399359", Key:="国证基建"

.Add Item:="sz399418", Key:="国证国安"
.Add Item:="sz399368", Key:="国证军工"
.Add Item:="sz399419", Key:="国证高铁"
.Add Item:="sz399432", Key:="国证汽车"
.Add Item:="sz399412", Key:="国证新能"

.Add Item:="sz399394", Key:="国证医药"
.Add Item:="sz399396", Key:="国证食品"
.Add Item:="sz399361", Key:="国证商业"
.Add Item:="sz399320", Key:="国证服务"
.Add Item:="sz399389", Key:="国证通信"
.Add Item:="sz399434", Key:="国证传媒"
.Add Item:="sz399435", Key:="国证农牧"
.Add Item:="sz399365", Key:="国证农业"
'---------------------------------------
.Add Item:="", Key:="系列国证1000指数"
.Add Item:="sz399381", Key:="1000能源"
.Add Item:="sz399382", Key:="1000材料"
.Add Item:="sz399383", Key:="1000工业"
.Add Item:="sz399384", Key:="1000可选"
.Add Item:="sz399385", Key:="1000消费"
.Add Item:="sz399386", Key:="1000医药"
.Add Item:="sz399387", Key:="1000金融"
.Add Item:="sz399388", Key:="1000信息"
.Add Item:="sz399390", Key:="1000公用"
'---------------------------------------
.Add Item:="", Key:="系列国证主题指数"
.Add Item:="sz399319", Key:="资源优势"
.Add Item:="sz399360", Key:="新硬件"
.Add Item:="sz399363", Key:="计算机指"
.Add Item:="sz399417", Key:="新能源车"
.Add Item:="sz399441", Key:="生物医药"

.Add Item:="sz399402", Key:="周期100"
.Add Item:="sz399403", Key:="防御100"
.Add Item:="sz399411", Key:="红利100"
.Add Item:="sz399321", Key:="国证红利"
.Add Item:="sz399322", Key:="国证治理"
.Add Item:="sz399362", Key:="国证民营"
.Add Item:="sz399392", Key:="国证新兴"
.Add Item:="sz399428", Key:="国证定增"
'---------------------------------------
.Add Item:="", Key:="系列国证策略指数"
.Add Item:="sz399354", Key:="分析师指数"
.Add Item:="sz399398", Key:="绩效指数"
.Add Item:="sz399427", Key:="专利领先"
.Add Item:="sz399405", Key:="大盘高贝"
.Add Item:="sz399404", Key:="大盘低波"
.Add Item:="sz399407", Key:="中盘高贝"
.Add Item:="sz399406", Key:="中盘低波"
.Add Item:="sz399409", Key:="小盘高贝"
.Add Item:="sz399408", Key:="小盘低波"
'---------------------------------------
.Add Item:="", Key:="系列国证区域指数"
.Add Item:="sz399355", Key:="长三角"
.Add Item:="sz399357", Key:="环渤海"
.Add Item:="sz399356", Key:="珠三角"
'---------------------------------------
.Add Item:="", Key:="系列国证定制指数"
.Add Item:="sz399358", Key:="泰达指数"
.Add Item:="sz399364", Key:="中金消费"
.Add Item:="sz399378", Key:="南方低碳"
.Add Item:="sz399391", Key:="投资时钟"
.Add Item:="sz399369", Key:="CBN-兴全"
.Add Item:="sz399397", Key:="OCT文化"
.Add Item:="sz399399", Key:="中经GDP"
.Add Item:="sz399350", Key:="皖江30"
.Add Item:="sz399410", Key:="苏州率先"
.Add Item:="sz399415", Key:="I100"
.Add Item:="sz399416", Key:="I300"
.Add Item:="sz399429", Key:="新丝路"
.Add Item:="sz399423", Key:="中关村50"
.Add Item:="sz399697", Key:="中关村60"
.Add Item:="sz399422", Key:="中关村A"
'---------------------------------------
.Add Item:="", Key:="系列国证基金指数"
.Add Item:="sz399379", Key:="国证基金"
.Add Item:="sz399380", Key:="国证ETF"
'---------------------------------------
.Add Item:="", Key:="系列国证债券指数"
.Add Item:="sz399481", Key:="企债指数"
.Add Item:="sz399413", Key:="国证转债"
'---------------------------------------
End With
'========================================================================================
'输出
'========================================================================================
目列 = 查程混市码典(码典系列国证, MS, 目行, 目列, True)

MS.Cells(目行, 目列).Offset(0, -3).Resize(1, 3).EntireColumn.Hidden = True
Set 码典系列国证 = Nothing
'========================================================================================
    现市分程_指数体系_系列国证 = 目列
End Function





Function 现市分程_指数体系_系列深证(MS As Worksheet, 始行 As Integer, 始列 As Integer) As Integer
'========================================================================================
'设置
'========================================================================================
    MS.Cells(始行, 始列).Cells(1, 位简式名称) = "深证指数体系"
    '-------------------------------------------------------------------------
    Dim 目行 As Integer
    Dim 目列 As Integer
    目行 = 始行 + 1
    目列 = 始列
'========================================================================================
'列表：深证系列
'========================================================================================
    Dim 码典深证系列 As New Dictionary
    With 码典深证系列
'---------------------------------------
'.Add Item:="", Key:="深证系列规模指数"
.Add Item:="sz399001", Key:="深证成指"
.Add Item:="sz399002", Key:="深成指R"
.Add Item:="sz399005", Key:="中小板指"
.Add Item:="sz399333", Key:="中小板R"
.Add Item:="sz399006", Key:="创业板指"
.Add Item:="sz399606", Key:="创业板R"
.Add Item:="sz399612", Key:="中创100"
.Add Item:="sz399611", Key:="中创100R"
.Add Item:="sz399330", Key:="深证100"
.Add Item:="sz399004", Key:="深证100R"
.Add Item:="sz399009", Key:="深证200"
.Add Item:="sz399679", Key:="深证200R"
.Add Item:="sz399007", Key:="深证300"
.Add Item:="sz399344", Key:="深证300R"
.Add Item:="sz399010", Key:="深证700"
.Add Item:="sz399011", Key:="深证1000"
.Add Item:="sz399008", Key:="中小300"
.Add Item:="sz399012", Key:="创业300"
.Add Item:="sz399624", Key:="中创400"
.Add Item:="sz399625", Key:="中创500"
'---------------------------------------
.Add Item:="", Key:="深证系列行业指数"
.Add Item:="sz399613", Key:="深证能源"
.Add Item:="sz399614", Key:="深证材料"
.Add Item:="sz399615", Key:="深证工业"
.Add Item:="sz399616", Key:="深证可选"
.Add Item:="sz399617", Key:="深证消费"
.Add Item:="sz399618", Key:="深证医药"
.Add Item:="sz399619", Key:="深证金融"
.Add Item:="sz399620", Key:="深证信息"
.Add Item:="sz399621", Key:="深证电信"
.Add Item:="sz399622", Key:="深证公用"
.Add Item:="sz399674", Key:="深A医药"
.Add Item:="sz399675", Key:="深互联网"
.Add Item:="sz399680", Key:="深成能源"
.Add Item:="sz399681", Key:="深成材料"
.Add Item:="sz399682", Key:="深成工业"
.Add Item:="sz399683", Key:="深成可选"
.Add Item:="sz399684", Key:="深成消费"
.Add Item:="sz399685", Key:="深成医药"
.Add Item:="sz399686", Key:="深成金融"
.Add Item:="sz399687", Key:="深成信息"
.Add Item:="sz399688", Key:="深成电信"
.Add Item:="sz399689", Key:="深成公用"
'---------------------------------------
.Add Item:="", Key:="深证系列风格指数"
.Add Item:="sz399346", Key:="深证成长"
.Add Item:="sz399348", Key:="深证价值"
.Add Item:="sz399602", Key:="中小成长"
.Add Item:="sz399604", Key:="中小价值"
.Add Item:="sz399667", Key:="创业板G"
.Add Item:="sz399668", Key:="创业板V"
.Add Item:="sz399626", Key:="中创成长"
.Add Item:="sz399627", Key:="中创价值"
'---------------------------------------
.Add Item:="", Key:="深证系列主题指数"
.Add Item:="sz399335", Key:="深证央企"
.Add Item:="sz399337", Key:="深证民营"
.Add Item:="sz399324", Key:="深证红利"
.Add Item:="sz399328", Key:="深证治理"
.Add Item:="sz399341", Key:="深证责任"
.Add Item:="sz399649", Key:="中小红利"
.Add Item:="sz399650", Key:="中小治理"
.Add Item:="sz399651", Key:="中小责任"

.Add Item:="sz399641", Key:="深证新兴"
.Add Item:="sz399642", Key:="中小新兴"
.Add Item:="sz399643", Key:="创业新兴"

.Add Item:="sz399016", Key:="深证创新"
.Add Item:="sz399015", Key:="中小创新"
.Add Item:="sz399018", Key:="创业创新"

.Add Item:="sz399653", Key:="深证龙头"
.Add Item:="sz399013", Key:="深市精选"
.Add Item:="sz399678", Key:="深次新股"
.Add Item:="sz399652", Key:="中创高新"

.Add Item:="sz399608", Key:="科技100"
.Add Item:="sz399610", Key:="TMT50"
.Add Item:="sz399670", Key:="深周期50"
.Add Item:="sz399671", Key:="深防御50"
.Add Item:="sz399646", Key:="深消费50"
.Add Item:="sz399647", Key:="深医药50"

.Add Item:="sz399339", Key:="深证科技"
.Add Item:="sz399636", Key:="深证装备"
.Add Item:="sz399637", Key:="深证地产"
.Add Item:="sz399638", Key:="深证环保"
.Add Item:="sz399639", Key:="深证大宗"
.Add Item:="sz399654", Key:="深证文化"
.Add Item:="sz399669", Key:="深证农业"
.Add Item:="sz399693", Key:="安防产业"
.Add Item:="sz399696", Key:="深证创投"
.Add Item:="sz399699", Key:="金融科技"
'---------------------------------------
.Add Item:="", Key:="深证系列策略指数"
.Add Item:="sz399659", Key:="深成指EW"
.Add Item:="sz399634", Key:="中小板EW"
.Add Item:="sz399635", Key:="创业板EW"
.Add Item:="sz399660", Key:="中创EW"
.Add Item:="sz399632", Key:="深100EW"
.Add Item:="sz399633", Key:="深300EW"
.Add Item:="sz399676", Key:="深医药EW"
.Add Item:="sz399677", Key:="深互联EW"

.Add Item:="sz399655", Key:="深证绩效"
.Add Item:="sz399658", Key:="中小绩效"
.Add Item:="sz399656", Key:="100绩效"
.Add Item:="sz399657", Key:="300绩效"

.Add Item:="sz399672", Key:="深红利50"
.Add Item:="sz399925", Key:="基本面50"
.Add Item:="sz399673", Key:="创业板50"

.Add Item:="sz399704", Key:="深证上游"
.Add Item:="sz399706", Key:="深证下游"
.Add Item:="sz399705", Key:="深证中游"

.Add Item:="sz399661", Key:="深证低波"
.Add Item:="sz399662", Key:="深证高贝"
.Add Item:="sz399663", Key:="中小低波"
.Add Item:="sz399664", Key:="中小高贝"
.Add Item:="sz399692", Key:="创业低波"
.Add Item:="sz399694", Key:="创业高贝"
.Add Item:="sz399665", Key:="中创低波"
.Add Item:="sz399666", Key:="中创高贝"
.Add Item:="sz399690", Key:="中小专利"
.Add Item:="sz399691", Key:="创业专利"
'---------------------------------------
.Add Item:="", Key:="深证系列定制指数"
.Add Item:="sz399701", Key:="深证F60"
.Add Item:="sz399702", Key:="深证F120"
.Add Item:="sz399703", Key:="深证F200"
.Add Item:="sz399326", Key:="成长40"
.Add Item:="sz399644", Key:="深证时钟"
.Add Item:="sz399648", Key:="深证GDP"
.Add Item:="sz399695", Key:="深证节能"
.Add Item:="sz399698", Key:="优势成长"
'---------------------------------------
.Add Item:="", Key:="深证系列综合指数"
.Add Item:="sz399106", Key:="深证综指"
.Add Item:="sz399107", Key:="深证Ａ指"
.Add Item:="sz399108", Key:="深证Ｂ指"
.Add Item:="sz399101", Key:="中小板综"
.Add Item:="sz399102", Key:="创业板综"
.Add Item:="sz399100", Key:="新 指 数"
.Add Item:="sz399231", Key:="农林指数"
.Add Item:="sz399232", Key:="采矿指数"
.Add Item:="sz399233", Key:="制造指数"
.Add Item:="sz399234", Key:="水电指数"
.Add Item:="sz399235", Key:="建筑指数"
.Add Item:="sz399236", Key:="批零指数"
.Add Item:="sz399237", Key:="运输指数"
.Add Item:="sz399238", Key:="餐饮指数"
.Add Item:="sz399239", Key:="IT指数"
.Add Item:="sz399240", Key:="金融指数"
.Add Item:="sz399241", Key:="地产指数"
.Add Item:="sz399242", Key:="商务指数"
.Add Item:="sz399243", Key:="科研指数"
.Add Item:="sz399244", Key:="公共指数"
.Add Item:="sz399248", Key:="文化指数"
.Add Item:="sz399249", Key:="综企指数"
.Add Item:="sz399959", Key:="军工指数"
'---------------------------------------
.Add Item:="", Key:="深证系列基金指数"
.Add Item:="sz399305", Key:="基金指数"
.Add Item:="sz399306", Key:="深证ETF"
.Add Item:="sz399103", Key:="乐富指数"
'---------------------------------------
.Add Item:="", Key:="深证系列债券指数"
.Add Item:="sz399302", Key:="深公司债"
.Add Item:="sz399301", Key:="深信用债"
.Add Item:="sz399298", Key:="深信中高"
.Add Item:="sz399299", Key:="深信中低"
.Add Item:="sz399307", Key:="深证转债"
'---------------------------------------
End With

'========================================================================================
'输出
'========================================================================================
目列 = 查程混市码典(码典深证系列, MS, 目行, 目列, True)
MS.Cells(目行, 目列).Offset(0, -3).Resize(1, 3).EntireColumn.Hidden = True
Set 码典深证系列 = Nothing
'========================================================================================
    现市分程_指数体系_系列深证 = 目列
End Function





Function 现市分程_指数体系_系列中证(MS As Worksheet, 始行 As Integer, 始列 As Integer) As Integer
'========================================================================================
'设置
'========================================================================================
    MS.Cells(始行, 始列).Cells(1, 位简式名称) = "中证指数体系"
    '-------------------------------------------------------------------------
    Dim 目行 As Integer
    Dim 目列 As Integer
    目行 = 始行 + 1
    目列 = 始列
'========================================================================================
'列表：系列中证
'========================================================================================
Dim 码典系列中证 As New Dictionary
With 码典系列中证
'---------------------------------------
.Add Item:="sz399903", Key:="中证100"
.Add Item:="sz399904", Key:="中证 200"
.Add Item:="sz399905", Key:="中证 500"
.Add Item:="sz399907", Key:="中证 700"
'---------------------------------------
.Add Item:="", Key:="系列中证行业指数"
.Add Item:="sz399928", Key:="中证能源"
.Add Item:="sz399929", Key:="中证材料"
.Add Item:="sz399930", Key:="中证工业"
.Add Item:="sz399931", Key:="中证可选"
.Add Item:="sz399932", Key:="中证消费"
.Add Item:="sz399933", Key:="中证医药"
.Add Item:="sz399934", Key:="中证金融"
.Add Item:="sz399935", Key:="中证信息"
.Add Item:="sz399936", Key:="中证电信"
.Add Item:="sz399937", Key:="中证公用"
.Add Item:="sz399998", Key:="中证煤炭"
.Add Item:="sz399995", Key:="基建工程"
'---------------------------------------
.Add Item:="sz399908", Key:="300 能源"
.Add Item:="sz399909", Key:="300 材料"
.Add Item:="sz399910", Key:="300 工业"
.Add Item:="sz399911", Key:="300 可选"
.Add Item:="sz399912", Key:="300 消费"
.Add Item:="sz399913", Key:="300 医药"
.Add Item:="sz399914", Key:="300 金融"
.Add Item:="sz399917", Key:="300 公用"
.Add Item:="sz399915", Key:="300 信息"
.Add Item:="sz399916", Key:="300 电信"
.Add Item:="sz399957", Key:="300运输"
.Add Item:="sz399950", Key:="300基建"
.Add Item:="sz399951", Key:="300银行"
.Add Item:="sz399952", Key:="300地产"

.Add Item:="sz399965", Key:="800地产"
.Add Item:="sz399966", Key:="800非银"
'---------------------------------------
.Add Item:="", Key:="系列中证主题指数"
.Add Item:="sz399803", Key:="工业4.0"
.Add Item:="sz399807", Key:="高铁产业"
.Add Item:="sz399809", Key:="保险主题"
.Add Item:="sz399975", Key:="证券公司"
.Add Item:="sz399805", Key:="互联金融"
.Add Item:="sz399970", Key:="移动互联"
.Add Item:="sz399994", Key:="信息安全"
.Add Item:="sz399996", Key:="智能家居"
.Add Item:="sz399812", Key:="养老产业"
.Add Item:="sz399814", Key:="大农业"
.Add Item:="sz399941", Key:="新能源"
.Add Item:="sz399976", Key:="CS新能车"
.Add Item:="sz399979", Key:="大宗商品"
.Add Item:="sz399991", Key:="一带一路"
.Add Item:="sz399806", Key:="环境治理"
.Add Item:="sz399986", Key:="中证银行"
.Add Item:="sz399813", Key:="中证国安"
.Add Item:="sz399967", Key:="中证军工"
.Add Item:="sz399973", Key:="中证国防"
.Add Item:="sz399808", Key:="中证新能"
.Add Item:="sz399987", Key:="中证酒"
.Add Item:="sz399997", Key:="中证白酒"
.Add Item:="sz399989", Key:="中证医疗"
.Add Item:="sz399804", Key:="中证体育"
.Add Item:="sz399971", Key:="中证传媒"
'---------------------------------------
.Add Item:="", Key:="系列中证定制指数"
.Add Item:="sz399817", Key:="生态100"
.Add Item:="sz399978", Key:="医药100"
.Add Item:="sz399992", Key:="CSWD并购"
.Add Item:="sz399993", Key:="CSWD生科"
.Add Item:="sz399810", Key:="CSSW传媒"
.Add Item:="sz399811", Key:="CSSW电子"
.Add Item:="sz399707", Key:="CSSW证券"
'---------------------------------------
.Add Item:="sh000159", Key:="沪股通"
.Add Item:="sh000170", Key:="50AH优选"
.Add Item:="sh000869", Key:="HK银行"
.Add Item:="sh000867", Key:="港中小企"
.Add Item:="sh000846", Key:="ESG 100"
.Add Item:="sh000851", Key:="百发100"
.Add Item:="sh000999", Key:="两岸三地"
'---------------------------------------
End With
'========================================================================================
'输出
'========================================================================================
目列 = 查程混市码典(码典系列中证, MS, 目行, 目列, True)
MS.Cells(目行, 目列).Offset(0, -3).Resize(1, 3).EntireColumn.Hidden = True
Set 码典系列中证 = Nothing
'========================================================================================
    现市分程_指数体系_系列中证 = 目列
End Function













Function 现市分程_指数体系_系列上证(MS As Worksheet, 始行 As Integer, 始列 As Integer) As Integer
'========================================================================================
'设置
'========================================================================================
    MS.Cells(始行, 始列).Cells(1, 位简式名称) = "上证指数体系"
    '-------------------------------------------------------------------------
    Dim 目行 As Integer
    Dim 目列 As Integer
    目行 = 始行 + 1
    目列 = 始列
'========================================================================================
'列表：上证系列
'========================================================================================
Dim 码典上证系列 As New Dictionary
With 码典上证系列
'---------------------------------------
.Add Item:="sh000001", Key:="上证指数"
.Add Item:="sh000002", Key:="Ａ股指数"
.Add Item:="sh000003", Key:="Ｂ股指数"
.Add Item:="sh000300", Key:="沪深300"
'---------------------------------------
.Add Item:="", Key:="上证系列规模指数"
.Add Item:="sh000016", Key:="上证50"
.Add Item:="sh000132", Key:="上证100"
.Add Item:="sh000133", Key:="上证150"
.Add Item:="sh000010", Key:="上证180"
.Add Item:="sh000009", Key:="上证380"
.Add Item:="sh000098", Key:="上证F200"
.Add Item:="sh000099", Key:="上证F300"
.Add Item:="sh000100", Key:="上证F500"
.Add Item:="sh000043", Key:="超大盘"
.Add Item:="sh000044", Key:="上证中盘"
.Add Item:="sh000045", Key:="上证小盘"
.Add Item:="sh000046", Key:="上证中小"
.Add Item:="sh000047", Key:="上证全指"
.Add Item:="sh000090", Key:="上证流通"
'---------------------------------------
.Add Item:="sh000004", Key:="工业指数"
.Add Item:="sh000005", Key:="商业指数"
.Add Item:="sh000006", Key:="地产指数"
.Add Item:="sh000007", Key:="公用指数"
.Add Item:="sh000012", Key:="国债指数"
.Add Item:="sh000013", Key:="企债指数"
.Add Item:="sh000015", Key:="红利指数"
.Add Item:="sh000022", Key:="沪公司债"
'---------------------------------------
.Add Item:="", Key:="上证系列策略指数"
.Add Item:="sh000070", Key:="能源等权"
.Add Item:="sh000071", Key:="材料等权"
.Add Item:="sh000072", Key:="工业等权"
.Add Item:="sh000073", Key:="可选等权"
.Add Item:="sh000076", Key:="金融等权"
.Add Item:="sh000078", Key:="电信等权"
.Add Item:="sh000079", Key:="公用等权"
'---------------------------------------
.Add Item:="", Key:="上证系列行业指数"
.Add Item:="sh000134", Key:="上证银行"
.Add Item:="sh000158", Key:="上证环保"
.Add Item:="sh000032", Key:="上证能源"
.Add Item:="sh000033", Key:="上证材料"
.Add Item:="sh000034", Key:="上证工业"
.Add Item:="sh000035", Key:="上证可选"
.Add Item:="sh000036", Key:="上证消费"
.Add Item:="sh000037", Key:="上证医药"
.Add Item:="sh000038", Key:="上证金融"
.Add Item:="sh000039", Key:="上证信息"
.Add Item:="sh000040", Key:="上证电信"
.Add Item:="sh000041", Key:="上证公用"
'---------------------------------------
.Add Item:="", Key:="上证系列主题指数"
.Add Item:="sh000042", Key:="上证央企"
.Add Item:="sh000056", Key:="上证国企"
.Add Item:="sh000055", Key:="上证地企"
.Add Item:="sh000049", Key:="上证民企"
.Add Item:="sh000062", Key:="上证沪企"
.Add Item:="sh000054", Key:="上证海外"
.Add Item:="sh000065", Key:="上证龙头"
.Add Item:="sh000094", Key:="上证上游"
.Add Item:="sh000095", Key:="上证中游"
.Add Item:="sh000096", Key:="上证下游"

.Add Item:="sh000063", Key:="上证周期"
.Add Item:="sh000066", Key:="上证商品"
.Add Item:="sh000067", Key:="上证新兴"
.Add Item:="sh000068", Key:="上证资源"
.Add Item:="sh000131", Key:="上证高新"
.Add Item:="sh000139", Key:="上证转债"

.Add Item:="sh000102", Key:="沪投资品"
.Add Item:="sh000103", Key:="沪消费品"
.Add Item:="sh000160", Key:="沪新丝路"
.Add Item:="sh000161", Key:="沪中国造"
.Add Item:="sh000162", Key:="沪互联+"
.Add Item:="sh000097", Key:="高端装备"
.Add Item:="sh000114", Key:="持续产业"
.Add Item:="sh000122", Key:="农业主题"
.Add Item:="sh000996", Key:="领先行业"
.Add Item:="sh000979", Key:="大宗商品"
.Add Item:="sh000997", Key:="大消费"
.Add Item:="sh000805", Key:="A股资源"
.Add Item:="sh000064", Key:="非周期"
.Add Item:="sh000853", Key:="CSSW丝路"
.Add Item:="sh000863", Key:="CS精准医"
'---------------------------------------
End With
'========================================================================================
'输出
'========================================================================================
目列 = 查程混市码典(码典上证系列, MS, 目行, 目列, True)
MS.Cells(目行, 目列).Offset(0, -3).Resize(1, 3).EntireColumn.Hidden = True
Set 码典上证系列 = Nothing
'========================================================================================
    现市分程_指数体系_系列上证 = 目列
End Function











