Attribute VB_Name = "WMR现市_B2专W"


'========================================================================================
'========================================================================================
'========================================================================================
'=====================================  手动编辑  ========================================
'========================================================================================
'========================================================================================
'========================================================================================
Function 现市特程_CN_手动关注概念(MS As Worksheet, 始行 As Integer, 始列 As Integer, Optional 是否排序 As XlSortOrder = xlDescending) As Integer
'========================================================================================
    MS.Cells(始行, 始列).Cells(1, 位简式名称) = "手动热点"
    '------------------------------------------------------------------------------------
    Dim 目行 As Integer
    Dim 目列 As Integer
    目行 = 始行 + 1
    目列 = 始列
    '------------------------------------------------------------------------------------
    Dim 码市 As String
    码市 = "SS"
    Dim 码类 As String
    Dim 码指 As String
    Dim 码组 As Variant
'========================================================================================
'区块链
'========================================================================================
    码指 = "新质生产力"
    码组 = Array( _
          "sh600355", "sh600446", "sh600560", "sh600579", "sh601138", "sh601882", "sh603019", "sh603032", "sh603100", "sh603113" _
        , "sh603135", "sh603283", "sh603767", "sh603901", "sh603933", "sh603958", "sh603960", "sh688631", "sh688788", "sz000409" _
        , "sz000678", "sz001225", "sz001306", "sz002008", "sz002017", "sz002031", "sz002184", "sz002361", "sz002689", "sz002747" _
        , "sz002838", "sz002896", "sz002931", "sz002972", "sz003028", "sz300226", "sz300345", "sz300379", "sz300416", "sz300466" _
        , "sz300603", "sz300777", "sz300780", "sz300785", "sz300864", "sz300872", "sz300883", "sz300894", "sz301001", "sz301040" _
        , "sz301163", "sz301200", "sz301273", "sz301510")
    目列 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序)
    Erase 码组
    '----------------------------------------------------------------------------------------
    码指 = "银行"
    码组 = Array( _
          "sh601398", "sh601939", "sh601288", "sh601988", "sh601328", "sh601166", "sh600036" _
        , "sh600000", "sh600016", "sh601998", "sh601818", "sz000001", "sh600015", "sh601169" _
        , "sh601229", "sh600919", "sh601009", "sz002142", "sh600926", "sh601997", "sh601128" _
        , "sh600908", "sz002807", "sz002839", "sh603323", "sh601838")
    目列 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序)
    Erase 码组
    '----------------------------------------------------------------------------------------
    码指 = "证券"
    码组 = Array( _
          "sh600030", "sh600837", "sh601211", "sh601688", "sz000776", "sz000166", "sh600999" _
        , "sh601881", "sh600958", "sh601788", "sz002736", "sh601901", "sh601377", "sh600061" _
        , "sz000783", "sh601555", "sz000728", "sh601198", "sz000750", "sz000686", "sh600369" _
        , "sz002673", "sz002500", "sh601878", "sh601108", "sh601099", "sh600109", "sh600155" _
        , "sh600909", "sh601375", "sz000712", "sz002797", "sz002670", "sh600621")
    目列 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序)
    Erase 码组
    '------------------------------------------------------------------------------------
    码指 = "5G"
    码组 = Array( _
          "sz300602", "sz002913", "sz002313", "sz300684", "sz002316", "sz300560", "sz002897", "sz300319", "sz002902", "sz002052" _
        , "sh600804", "sz002417", "sz300265", "sz000988", "sz002837", "sz300322", "sz002115", "sz002231", "sz300395", "sz300496" _
        , "sh603803", "sz002017", "sz002261", "sz300615", "sz002089", "sz002298", "sh601137", "sz300563", "sz002579", "sz300002" _
        , "sh603083", "sz002544", "sz000100", "sz300310", "sz002309", "sz002384", "sz002475", "sz002547", "sz300038", "sz300134" _
        , "sz300312", "sz300578", "sz300593", "sh600485", "sh600666", "sz300025", "sz300353", "sz300608", "sh603042", "sh600776" _
        )
    目列 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序)
    Erase 码组
'========================================================================================
   
    现市特程_CN_手动关注概念 = 目列
End Function






'========================================================================================
'========================================================================================
'调用：全盘关注
'========================================================================================
'========================================================================================
Function 现市基程_全局监视( _
        MS As Worksheet _
        , Optional 是否排序 As XlSortOrder = xlDescending _
        , Optional 始行 As Integer = 3 _
        , Optional 始列 As Integer = 3 _
        ) As Boolean
'========================================================================================
'页面格式设置
'========================================================================================
    MS.Cells.Font.Size = 10
    MS.Columns.ColumnWidth = 2
    '------------------------------------------------------------------------------------
    '汇总概览
    '------------------------------------------------------------------------------------
    MS.Cells(始行, 始行 + 1) = "芥蓝"
    MS.Columns(始行 + 1).ColumnWidth = 10
    MS.Columns(始行 + 2).ColumnWidth = 6
    MS.Columns(始行 + 3).ColumnWidth = 0
    始列 = 始行 + 5
'========================================================================================
'全盘关注概念
'========================================================================================
    始列 = 始列 + 1
    始列 = 现市特程_CN_手动关注概念(MS, 始行, 始列)
    
'========================================================================================
'沪深热门股票
'========================================================================================
    始列 = 始列 + 1
    始列 = 现市特程_CN_热门股票(MS, 始行, 始列, 是否标题:=True)
'========================================================================================
'中国互联网
'========================================================================================
    始列 = 始列 + 1
    始列 = 现市特程_GB_中国互联网(MS, 始行, 始列)
'========================================================================================
'页面格式设置
'========================================================================================
    With MS.Rows(始行)
        .Font.Bold = True
        .HorizontalAlignment = xlLeft
        .Borders(xlEdgeBottom).Weight = xlThin
    End With
    MS.Activate
    ActiveWindow.Zoom = 80
'----------------------------------------------------------------------------------------
End Function







'========================================================================================
'========================================================================================
'美国中国概念系列
'========================================================================================
'========================================================================================
Function 现市特程_GB_中国互联网(MS As Worksheet, 始行 As Integer, 始列 As Integer, Optional 是否排序 As XlSortOrder = xlDescending) As Integer
'========================================================================================
    MS.Cells(始行, 始列).Cells(1, 位简式名称) = "中国互联网50"
    '------------------------------------------------------------------------------------
    Dim 目行 As Integer
    Dim 目列 As Integer
    目行 = 始行 + 1
    目列 = 始列
    '------------------------------------------------------------------------------------
    Dim 码市 As String
    码市 = "WW"
    Dim 码指 As String
    Dim 码组
'========================================================================================
    '------------------------------------------------------------------------------------
    'FXI
    '------------------------------------------------------------------------------------
    '------------------------------------------------------------------------------------
    '中国互联网50 H30503
    '------------------------------------------------------------------------------------
    码组 = Array("中国互联网50", _
         "hk00700", "hk03888", "hk01060", "hk01980", "hk02280", "hk00400", "hk00434", "hk00777" _
        , "" _
        , "gb_BABA", "gb_JD", "gb_BIDU", "gb_NTES", "gb_SINA", "gb_WB", "gb_SOHU" _
        , "gb_TOUR", "gb_YY", "gb_CYOU", "gb_MOMO", "gb_CTRP", "gb_JOBS" _
        , "gb_VNET", "gb_TAL", "gb_YRD", "gb_ATHM", "gb_BITA", "gb_CMCM" _
        , "gb_LEJU", "gb_SFUN", "gb_JMEI", "gb_VIPS", "gb_BZUN", "gb_WBAI", "gb_WUBA")
    目列 = 查程混市码组(码组, MS, 目行, 目列)
    Erase 码组
'========================================================================================
    现市特程_GB_中国互联网 = 目列
End Function







'           Excel公式：
'           =".Add Key:=""" & A3 & """, Item:=" & INT(5000/100/E3) & "    '" &B3
'========================================================================================
'========================================================================================
'设置持仓限额
'分为两档：钻石档为按照股数设置上限；其余档为按照金额设置上限4000
'注意：对于上限之内的持仓，免于操作，避免仓位过低
'其余未入选的池池金银股票，上限按照系统统一设置
'注意：为了避免设置为金额会受股价波动影响，统一设置为1仓对应的手数（需要根据设置当时股价进行折算）
'========================================================================================
'========================================================================================
Function STBASE池管理_设置必选股票(典集钻石股票 As Dictionary)
    典集钻石股票.RemoveAll
    '------------------------------------------------------------------------------------
    With 典集钻石股票
        '---------------------------------------
        '@20230201
        .Add Key:="sz000040", Item:=8      '东旭蓝天
        .Add Key:="sz000779", Item:=3      '甘咨询
        .Add Key:="sz000892", Item:=10      '欢瑞世纪
        .Add Key:="sh600149", Item:=5      '廊坊发展
        .Add Key:="sz001965", Item:=8      '招商公路
        '---------------------------------------
        '@20230101
        .Add Key:="sz000548", Item:=5      '湖南投资
        .Add Key:="sz000554", Item:=5      '泰山石油
        .Add Key:="sz000017", Item:=10      '深中华A
        .Add Key:="sz002172", Item:=10      '澳洋健康
        .Add Key:="sz002659", Item:=10      '凯文教育
        .Add Key:="sz002188", Item:=10      '中天服务
        .Add Key:="sh600977", Item:=3      '中国电影
        '---------------------------------------
        '@20221218
        .Add Key:="sh600272", Item:=4      '开开实业  中药
        .Add Key:="sz000068", Item:=11     '华控赛格  环境保护
        .Add Key:="sz000705", Item:=5      '浙江震元  医药流通
        .Add Key:="sz000978", Item:=5      '桂林旅游  景点
        .Add Key:="sh600156", Item:=9      '华升股份  纺织
        .Add Key:="sz000428", Item:=8      '华天酒店  酒店餐饮
        .Add Key:="sz002566", Item:=5      '益盛药业  中药
        .Add Key:="sz002696", Item:=7      '百洋股份  饲料加工
        .Add Key:="sz002633", Item:=5      '申科股份  通用设备
        .Add Key:="sz002790", Item:=5      '瑞尔特  建材
        .Add Key:="sz002380", Item:=3      '科远智慧  电气智能化设备
        .Add Key:="sz002175", Item:=13     '东方智造  仪器仪表
        .Add Key:="sh601008", Item:=11     '连云港  港口
        .Add Key:="sz002209", Item:=5      '达 意 隆  轻工机械
        .Add Key:="sz002629", Item:=12     '仁智股份  采掘服务业
        .Add Key:="sh600962", Item:=3      '国投中鲁  饮料制造
        .Add Key:="sz002314", Item:=11     '南山控股  房地产
        .Add Key:="sh600302", Item:=8      '标准股份  轻工机械
        .Add Key:="sz000524", Item:=3      '岭南控股  旅游综合
        .Add Key:="sh600791", Item:=9      '京能置业  房地产
        .Add Key:="sh600561", Item:=8      '江西长运  公共交通
        .Add Key:="sh603199", Item:=1      '九华旅游  景点
        .Add Key:="sh600749", Item:=3      '西藏旅游  景点
        .Add Key:="sz000430", Item:=6      '张家界  景点
        .Add Key:="sh600713", Item:=8      '南京医药  医药流通
        .Add Key:="sh601007", Item:=4      '金陵饭店  酒店餐饮
        .Add Key:="sz000417", Item:=9      '合肥百货  零售业
        .Add Key:="sh600750", Item:=3      '江中药业  中药
        .Add Key:="sh600029", Item:=6      '南方航空  航空运输
        .Add Key:="sh601111", Item:=4      '中国国航  航空运输
        .Add Key:="sh600971", Item:=6      '恒源煤电  煤炭开采
        .Add Key:="sh600582", Item:=9      '天地科技  专用设备
        .Add Key:="sh600775", Item:=4      '南京熊猫  通信设备
        .Add Key:="sh601958", Item:=4      '金钼股份  有色金属
        .Add Key:="sh601811", Item:=5      '新华文轩  文化传媒
        .Add Key:="sz002155", Item:=3      '湖南黄金  黄金
        .Add Key:="sz002519", Item:=10     '银河电子  家电
        .Add Key:="sz300025", Item:=10     '华星创业  通信服务
        .Add Key:="sh600560", Item:=4      '金自天正  仪器仪表
        .Add Key:="sh603766", Item:=9      '隆鑫通用  其他交运设备
        .Add Key:="sz002363", Item:=7      '隆基机械  汽车零部件

        .Add Key:="sh601808", Item:=4       '中海油服
        .Add Key:="sh600028", Item:=10       '中国石化
        '---------------------------------------
'        .Add Key:="sh601088", Item:=2       '中国神华
'        .Add Key:="sh601226", Item:=10      '华电重工
'        .Add Key:="sh601008", Item:=10      '连云港
'        .Add Key:="sz000767", Item:=15      '晋控电力
'        .Add Key:="sh600017", Item:=15      '日照港
'        .Add Key:="sh600202", Item:=9       '哈空调
'        .Add Key:="sh600128", Item:=5       '弘业股份
'        .Add Key:="sz002059", Item:=5       '云南旅游
'        .Add Key:="sz002839", Item:=8       '张家港行
'        .Add Key:="sz000919", Item:=8       '金陵药业
'        .Add Key:="sz000565", Item:=5       '渝三峡
'        .Add Key:="sz000559", Item:=7       '万向钱潮
'        .Add Key:="sz300275", Item:=3       '梅安森
        '---------------------------------------
'        '@20221111
'        .Add Key:="sz002550", Item:=10      '千红制药
'        .Add Key:="sz000766", Item:=10      '通化金马
'        .Add Key:="sh600713", Item:=8       '南京医药
'        .Add Key:="sh600479", Item:=4       '千金药业
'        .Add Key:="sz002393", Item:=2       '力生制药
'        .Add Key:="sz002629", Item:=12      '仁智股份
'        .Add Key:="sz002175", Item:=12      '东方智造
'        .Add Key:="sz002707", Item:=6       '众信旅游
'        .Add Key:="sz002347", Item:=8       '泰尔股份
'        .Add Key:="sz002630", Item:=10      '华西能源
'        .Add Key:="sh601958", Item:=5       '金钼股份
'        .Add Key:="sh600192", Item:=7       '长城电工
'        .Add Key:="sz001965", Item:=6       '招商公路
'        .Add Key:="sz002535", Item:=20      'ST林重
'        .Add Key:="sz002155", Item:=3       '湖南黄金
'        .Add Key:="sz000609", Item:=7       '中迪投资
'        .Add Key:="sz002209", Item:=5       '达意隆
'        .Add Key:="sh603766", Item:=8       '隆鑫通用
'        .Add Key:="sh600582", Item:=8       '天地科技
        '---------------------------------------
'        .Add Key:="sh600397", Item:=20      '安源煤业
'        .Add Key:="sh600971", Item:=6       '恒源煤电
'        .Add Key:="sz000552", Item:=20      '靖远煤电
'        .Add Key:="sh600961", Item:=5      '株冶集团
'        .Add Key:="sz002067", Item:=20     '景兴纸业
'        .Add Key:="sh601518", Item:=10     '吉林高速
'        .Add Key:="sh600035", Item:=10     '楚天高速
'        .Add Key:="sh600717", Item:=10     '天津港
        '---------------------------------------
'        .Add Key:="sz002588", Item:=10      '史丹利
'        .Add Key:="sh600558", Item:=15      '大西洋
'        .Add Key:="sh600423", Item:=10      '柳化股份
'        .Add Key:="sz002441", Item:=5      '众业达
'        .Add Key:="sz002066", Item:=4      '瑞泰科技
'        .Add Key:="sz002337", Item:=10     '赛象科技
'        .Add Key:="sz000925", Item:=5      '众合科技
'        .Add Key:="sh603227", Item:=12     '雪峰科技
'        .Add Key:="sh600008", Item:=12     '首创环保
'        .Add Key:="sh603968", Item:=3      '醋化股份
'        .Add Key:="sz000404", Item:=8      '长虹华意
'        .Add Key:="sz300154", Item:=5      '瑞凌股份
'        '---------------------------------------
'        .Add Key:="sh601211", Item:=3      '国泰君安
'        .Add Key:="sh603365", Item:=3      '水星家纺
        '---------------------------------------
    End With
End Function






