Attribute VB_Name = "WMR现市_CN中股Z精分证册"
Public Const 位列证册成分代码 = 1
Public Const 位列证册成分名称 = 2
Public Const 位列证册指数名称 = 3
Public Const 位列证册指数代码 = 4
Public Const 位列证册成分总数 = 5
Public Const 位列证册成分序号 = 6
Public Const 位列证册指数更时 = 7






'========================================================================================
'========================================================================================
'通用调用程序：导入指数系列
'========================================================================================
'========================================================================================
Sub 后台证册管理子程_PA_系列中证()
    UTL宏工具_BEGIN
'----------------------------------------------------------------------------------------
    Dim 指定文夹 As String
    Dim 指定工簿名 As String
    指定文夹 = ThisWorkbook.Path & "\@里程碑\系列中证\"
    指定工簿名 = "花册系列中证"
    
    Call 后台证册管理基程_导入文件夹(指定文夹, 指定工簿名)
'----------------------------------------------------------------------------------------
    ThisWorkbook.Save
    UTL宏工具_END
End Sub
Sub 后台证册管理子程_PB_系列国证()
    UTL宏工具_BEGIN
'----------------------------------------------------------------------------------------
    Dim 指定文夹 As String
    Dim 指定工簿名 As String
    指定文夹 = ThisWorkbook.Path & "\@里程碑\系列国证\"
    指定工簿名 = "花册系列国证"
    
    Call 后台证册管理基程_导入文件夹(指定文夹, 指定工簿名)
'----------------------------------------------------------------------------------------
    ThisWorkbook.Save
    UTL宏工具_END
End Sub





'========================================================================================
'========================================================================================
'按照类系列中证进行分类
'========================================================================================
'========================================================================================
Private Sub 后台证册精分调程_PA_族系列中证()
'----------------------------------------------------------------------------------------
'设置
'----------------------------------------------------------------------------------------
    Dim 去簿名 As String
    去簿名 = "族系列中证"
    Dim 来簿名 As String
    来簿名 = "花册系列中证"
    Dim 来列群名 As Integer
    来列群名 = 位列证册指数名称
    '------------------------------------------------------------------------------------
    Dim 组族群系列中证 As Variant
    组族群系列中证 = Array( _
          Array("中证金融类族", "中证金融", "中证银行", "中证保险", "保险主题", "证券公司", "中证信托", "互联金融", "资本市场") _
        , Array("中证周期类族", "中证有色", "中证煤炭", "中证钢铁", "中证材料", "稀土产业", "中证材料", "大宗商品", "金属采矿") _
        , Array("中证基建类族", "建筑工程", "建筑产品", "基建工程", "中证水泥", "海绵城市") _
        , Array("中证制造类族", "高端装备", "中证工业", "工业4.0", "航天国防", "中证高装", "高铁产业", "中证新能", "智能制造", "中证国安", "中证汽车", "CS新能车", "CS新能源", "中证军工", "军工指数", "中证国防", "中证核电", "中证安防") _
        , Array("中证能源类族", "中证能源") _
        , Array("中证信息类族", "中证信息", "中证软件", "网络软件", "软件指数", "信息服务", "电脑设备") _
        , Array("中证科技类族", "中证TMT", "中证VR", "云计算", "移动互联", "信息安全") _
        , Array("中证电信类族", "中证电信", "量子通信") _
        , Array("中证医药类族", "中证医药", "中证医疗", "中证中药", "中证生科", "CSWD生科") _
        , Array("中证商业类族", "中证电商") _
        , Array("中证消费类族", "中国主要消费", "中国可选消费", "中证消费", "中证可选", "中证影视", "中证传媒", "中证体育", "中证旅游") _
        , Array("中证食品类族", "中证酒", "中证白酒", "饮料指数") _
        , Array("中证农业类族", "大农业", "生态100", "中证畜牧", "纸类林业") _
        , Array("中证公用类族", "中证公用", "中证环保", "环境治理", "交通设施", "空天一体", "水环境", "环保专利", "水务指数") _
        , Array("中证主题类族", "红利回报", "CS院校企", "CS供给侧", "CS土改农", "国企改革", "一带一路", "养老产业", "上证健康") _
        , Array("中证定制类族", "港股通高股息") _
        , Array("中证区域类族", "长三角", "CS珠三角", "环渤海") _
        , Array("省略类族", "香港证券", "银商领先", "CS高端制", "艾瑞中国互联网") _
        )
'----------------------------------------------------------------------------------------
'输出设置
'----------------------------------------------------------------------------------------
    Dim 输出族群号始 As Integer
    Dim 输出族群号终 As Integer
    输出族群号始 = -1
    输出族群号终 = 1000
'----------------------------------------------------------------------------------------
    Call 后台族群精分引擎正程( _
          组族群系列中证 _
        , 去簿名 _
        , 来簿名 _
        , 来列群名 _
        , 来列群指:=位列证册指数代码 _
        )
'----------------------------------------------------------------------------------------
End Sub



'========================================================================================
'========================================================================================
'按照类系列国证进行分类
'========================================================================================
'========================================================================================
Private Sub 后台证册精分调程_PB_族系列国证()
'----------------------------------------------------------------------------------------
'设置
'----------------------------------------------------------------------------------------
    Dim 去簿名 As String
    去簿名 = "族系列国证"
    Dim 来簿名 As String
    来簿名 = "花册系列国证"
    Dim 来列群名 As Integer
    来列群名 = 位列证册指数名称
    '------------------------------------------------------------------------------------
    Dim 组族群系列国证 As Variant
    组族群系列国证 = Array( _
          Array("国证金融类族", "国证银行", "国证证券", "国证保证", "国证非银") _
        , Array("国证周期类族", "国证有色", "国证煤炭", "国证钢铁", "国证材料", "资源优势", "国证大宗") _
        , Array("国证基建类族", "建筑工程", "国证地产", "巨潮地产", "国证基建", "国证建材") _
        , Array("国证制造类族", "国证高铁", "新能源车", "国证新能", "国证军工", "国证新兴", "国证国安", "国证汽车", "国证航天", "工业服务", "工业用品", "国证化工", "国证机械") _
        , Array("国证能源类族", "国证能源", "国证油气", "国证电力") _
        , Array("国证信息类族", "国证软件", "网络软件", "国证半导", "电信服务", "电脑硬件") _
        , Array("国证科技类族", "新硬件", "计算机指") _
        , Array("国证电信类族", "通信服务", "国证通信") _
        , Array("国证医药类族", "国证医药", "生物医药", "国证生科", "国证中药", "国证医疗", "国证制药") _
        , Array("国证商业类族", "国证商业", "国证零售", "国证百货") _
        , Array("国证消费类族", "国证服务", "国证传媒", "服装纺织", "国证电影", "国证家电", "国证家用", "消费服务", "耐用消费", "白色家电") _
        , Array("国证食品类族", "国证食品", "国证白酒", "食品零售", "酒店餐饮") _
        , Array("国证农业类族", "国证农牧", "国证农业") _
        , Array("国证公用类族", "国证公用", "国证物流", "国证交运", "国证空运", "路桥港口", "国证水务") _
        , Array("国证主题类族", "分析师指", "绩效指数", "国证红利", "国证治理", "国证定增", "周期100", "防御100") _
        , Array("国证定制类族", "泰达指数", "中金消费", "南方低碳", "投资时钟", "CBN-兴全", "央视50", "央视生态", "央视文化", "OCT文化", "苏州率先", "I100", "中关村50", "新丝路", "皖江30") _
        , Array("国证区域类族", "长三角", "珠三角", "环渤海") _
        , Array("国证1000类族", "1000金融", "1000材料", "1000能源", "1000工业", "1000信息", "1000电信", "1000可选", "1000消费", "1000医药", "1000公用") _
        , Array("省略类族", "深港通100", "中经GDP", "国证民营") _
        )
'----------------------------------------------------------------------------------------
'输出设置
'----------------------------------------------------------------------------------------
    Dim 输出族群号始 As Integer
    Dim 输出族群号终 As Integer
    输出族群号始 = -1
    输出族群号终 = 1000
'----------------------------------------------------------------------------------------
    Call 后台族群精分引擎正程( _
          组族群系列国证 _
        , 去簿名 _
        , 来簿名 _
        , 来列群名 _
        , 来列群指:=位列证册指数代码 _
        )
'----------------------------------------------------------------------------------------
End Sub





'========================================================================================
'========================================================================================
'通用调用程序：导入文件夹
'========================================================================================
'========================================================================================
Sub 后台证册管理基程_导入文件夹(指定文夹 As String, 指定工簿名 As String)
'========================================================================================
'验证原始文件所在的文件夹
'========================================================================================
    If UTL判断路径存在(指定文夹) = False Then
        MsgBox 指定文夹 & "不存在"
        Exit Sub
    End If
    '------------------------------------------------------------------------------------
    '建立工作簿
    '------------------------------------------------------------------------------------
    Dim 工表证册 As Worksheet
    Call PBASE格程工具_表操工表新增(工表证册, 指定工簿名)
'========================================================================================
'结点导入
'========================================================================================
    Dim FSO As New FileSystemObject
    Dim gfile As file
    Dim 原件路径 As String
    Dim 原件名称 As String
    
    Dim 导入计数 As Integer
    导入计数 = 0
    '------------------------------------------------------------------------------------
    For Each gfile In FSO.GetFolder(指定文夹).Files
        '--------------------------------------------------------------------------------
        原件路径 = gfile.Path
        原件名称 = FSO.GetBaseName(原件路径)
        If 导入计数 < 300 Then
            Call 后台证册管理基程_导入单文件(工表证册, 原件路径, 原件名称)
        End If
        导入计数 = 导入计数 + 1
        '--------------------------------------------------------------------------------
        Debug.Print "成源导入>>" & 导入计数 & ">>" & 原件名称
        '--------------------------------------------------------------------------------
    Next
    Set FSO = Nothing
'========================================================================================
'格式化
'========================================================================================
    工表证册.Rows(1).Font.Bold = True
    工表证册.Cells(1, 位列证册成分代码) = "成分代码"
    工表证册.Cells(1, 位列证册成分名称) = "成分名称"
    工表证册.Cells(1, 位列证册指数名称) = "指数名称"
    工表证册.Cells(1, 位列证册指数代码) = "指数代码"
    工表证册.Cells(1, 位列证册成分总数) = "指数维度"
    工表证册.Cells(1, 位列证册成分序号) = "成分序号"
    工表证册.Cells(1, 位列证册指数更时) = "指数更时"
    
    工表证册.Columns(位列花天市日).NumberFormatLocal = 全设格式of日期
    工表证册.Columns.AutoFit
    '------------------------------------------------------------------------------------
    工表证册.Activate
    ActiveWindow.Zoom = 80
'========================================================================================
    Set 工表证册 = Nothing
End Sub






'========================================================================================
'========================================================================================
'通用调用程序：导入文件
'========================================================================================
'========================================================================================
Private Sub 后台证册管理基程_导入单文件(工表证册 As Worksheet, 原件路径 As String, 原件名称 As String)
'========================================================================================
'导入原始文件
'========================================================================================
'    Dim 原件路径
'    原件路径 = Application.GetOpenFilename("国证文件,*.xls", , "请选择国证指数文件", , False)
'    If 原件路径 = False Then
'        Exit Sub
'    End If
'    Debug.Print 原件路径
    '------------------------------------------------------------------------------------
    '导入数组
    '------------------------------------------------------------------------------------
    If UTL判断工簿打开(原件名称) Then Workbooks(原件名称).Close True
    Dim WB As Workbook
    Set WB = GetObject(原件路径)
    Dim ARR
    ARR = WB.ActiveSheet.Range("A1").CurrentRegion
    '------------------------------------------------------------------------------------
    Dim 国证更时 As Date
    With WB.ActiveSheet.Cells(1, "H")
        If Left(.Value, 4) = "更新时间" Then 国证更时 = CDate(Mid(.Value, 6))
    End With
    '------------------------------------------------------------------------------------
    WB.Close False
    Set WB = Nothing
'========================================================================================
'来源分类
'========================================================================================
    Dim 指数类型 As String
    Dim 指数名称 As String
    Dim 指数代码 As String
    Dim 指成代码 As Integer
    Dim 指成名称 As Integer
    Dim 指数更时 As Date
    
    If ARR(1, 2) = "指数简称" Then
        指数类型 = "国证指数"
        指数名称 = ARR(2, 2)
        指数代码 = UBCID规制指码(ARR(2, 1))
        指成代码 = 3
        指成名称 = 4
        指数更时 = 国证更时
    ElseIf ARR(1, 2) = "指数代码Index Code" Then
        指数类型 = "中证指数"
        指数名称 = ARR(2, 3)
        指数代码 = UBCID规制指码(ARR(2, 2))
        指成代码 = 5
        指成名称 = 6
        指数更时 = ARR(2, 1)
    End If
'========================================================================================
'输出：单独工作簿
'========================================================================================
'    Dim WS As Worksheet
'    Call PBASE格程工具_表操工表新增(WS, 指数名称, WB:=ThisWorkbook, 基色底:=常色十红)
'    '------------------------------------------------------------------------------------
'    ' 输出数组
'    '------------------------------------------------------------------------------------
'    WS.Range("A1").Resize(UBound(ARR), UBound(ARR, 2)) = ARR
'    '------------------------------------------------------------------------------------
'    ' 格式化
'    '------------------------------------------------------------------------------------
'    WS.Rows(1).Font.Bold = True
'    WS.Columns(指成代码).NumberFormatLocal = 全设格式of代码
'    WS.Columns.AutoFit
'    WS.Activate
'    ActiveWindow.Zoom = 80
'    Set WS = Nothing
'========================================================================================
'输出：统一工作簿
'========================================================================================
    Dim 末行 As Integer
    '------------------------------------------------------------------------------------
    '清理工作簿
    '------------------------------------------------------------------------------------
    末行 = 工表证册.Cells(65536, 1).End(xlUp).Row
    
    Dim 行号遍历 As Integer
    For 行号遍历 = 末行 To 2 Step -1
        If 工表证册.Cells(行号遍历, 1) = 指数代码 Then
            工表证册.Rows(行号遍历).Delete
        End If
    Next 行号遍历
    '------------------------------------------------------------------------------------
    '输出数组
    '------------------------------------------------------------------------------------
    末行 = 工表证册.Cells(65536, 1).End(xlUp).Row
    
    Dim 导入行号 As Integer
    Dim 遍历序号 As Integer
    For 遍历序号 = 2 To UBound(ARR, 1)
        导入行号 = 末行 + 遍历序号 - 1
        工表证册.Cells(导入行号, 位列证册指数代码) = 指数代码
        工表证册.Cells(导入行号, 位列证册指数名称) = 指数名称
        工表证册.Cells(导入行号, 位列证册成分代码) = UBCID规制代码(ARR(遍历序号, 指成代码))
        工表证册.Cells(导入行号, 位列证册成分名称) = ARR(遍历序号, 指成名称)
        工表证册.Cells(导入行号, 位列证册成分总数) = UBound(ARR, 1) - 1
        工表证册.Cells(导入行号, 位列证册成分序号) = 遍历序号 - 1
        工表证册.Cells(导入行号, 位列证册指数更时) = 指数更时
    Next 遍历序号
    '------------------------------------------------------------------------------------
    Erase ARR
'========================================================================================
End Sub







