Attribute VB_Name = "WMR现市_A主控"
Public Const 常序升序 = xlAscending
Public Const 常序降序 = xlDescending
Public Const 常序无序 = False





'########################################################################################
'########################################################################################
'#####################################   调用总程   ######################################
'########################################################################################
'########################################################################################
'========================================================================================
'外簿：只有全部
'========================================================================================
Sub 现市总程外簿无序_全部()
    Call 现市总程汇总正程(是否排序:=常序无序, 是否全局:=True, 是否中股:=True, 是否海外:=True, 是否外簿:=True)
End Sub
Sub 现市总程外簿降序_全部()
    Call 现市总程汇总正程(是否排序:=常序降序, 是否全局:=True, 是否中股:=True, 是否海外:=True, 是否外簿:=True)
End Sub
Sub 现市总程外簿升序_全部()
    Call 现市总程汇总正程(是否排序:=常序升序, 是否全局:=True, 是否中股:=True, 是否海外:=True, 是否外簿:=True)
End Sub
'========================================================================================
'本簿：全部
'========================================================================================
Sub 现市总程本簿无序_全部()
    Call 现市总程汇总正程(是否排序:=常序无序, 是否全局:=True, 是否中股:=True, 是否海外:=True)
End Sub
Sub 现市总程本簿降序_全部()
    Call 现市总程汇总正程(是否排序:=常序降序, 是否全局:=True, 是否中股:=True, 是否海外:=True)
End Sub
Sub 现市总程本簿升序_全部()
    Call 现市总程汇总正程(是否排序:=常序升序, 是否全局:=True, 是否中股:=True, 是否海外:=True)
End Sub
'========================================================================================
'本簿：选部
'========================================================================================
Sub 现市总程本簿无序_选部中股()
    Call 现市总程汇总正程(是否排序:=常序无序, 是否中股:=True)
End Sub
Sub 现市总程本簿降序_选部中股()
    Call 现市总程汇总正程(是否排序:=常序降序, 是否中股:=True)
End Sub
Sub 现市总程本簿升序_选部中股()
    Call 现市总程汇总正程(是否排序:=常序升序, 是否中股:=True)
End Sub
'----------------------------------------------------------------------------------------
Sub 现市总程本簿无序_选部全局()
    Call 现市总程汇总正程(是否排序:=常序无序, 是否全局:=True)
End Sub
Sub 现市总程本簿降序_选部全局()
    Call 现市总程汇总正程(是否排序:=常序降序, 是否全局:=True)
End Sub
Sub 现市总程本簿升序_选部全局()
    Call 现市总程汇总正程(是否排序:=常序升序, 是否全局:=True)
End Sub
'----------------------------------------------------------------------------------------
Sub 现市总程本簿无序_选部海外()
    Call 现市总程汇总正程(是否排序:=常序无序, 是否海外:=True)
End Sub
Sub 现市总程本簿降序_选部海外()
    Call 现市总程汇总正程(是否排序:=常序降序, 是否海外:=True)
End Sub
Sub 现市总程本簿升序_选部海外()
    Call 现市总程汇总正程(是否排序:=常序升序, 是否海外:=True)
End Sub
'========================================================================================
'########################################################################################
'########################################################################################
'#####################################   调用总程   ######################################
'########################################################################################
'########################################################################################





'########################################################################################
'########################################################################################
'#####################################   汇总总程   ######################################
'########################################################################################
'########################################################################################
'========================================================================================
'========================================================================================
'市场概览:本工作簿汇总
'========================================================================================
'========================================================================================
Function 现市总程汇总子程( _
          MB As Workbook _
        , Optional 是否排序 As XlSortOrder = xlDescending _
        , Optional 是否全局 As Boolean = False _
        , Optional 是否中股 As Boolean = False _
        , Optional 是否海外 As Boolean = False _
        ) As String
'----------------------------------------------------------------------------------------
    TT = Timer
    Dim MSG As String
'----------------------------------------------------------------------------------------
'外部市场
'----------------------------------------------------------------------------------------
    If 是否海外 Then
        MSG = MSG & 现市子程_市场美股(MB, 是否排序)
        MSG = MSG & 现市子程_市场港股(MB, 是否排序)
    End If
'----------------------------------------------------------------------------------------
'中股概览
'----------------------------------------------------------------------------------------
    If 是否中股 Then
        Dim 天组 As Variant
        Dim 天典 As New Dictionary
        MSG = MSG & 市调预程引擎初始(天组, 天典)
        If 天典.Count <= 0 Then
            'MSG = MSG & 现市子程_中股指基(MB)   '不依赖于【天组】
            'MSG = MSG & 现市子程_中股精分行业益盟(MB, 是否排序:=是否排序, 天组:=天组, 天典:=天典)
            'MSG = MSG & 现市子程_中股精分概念益盟(MB, 是否排序:=是否排序, 天组:=天组, 天典:=天典)
            
            MSG = MSG & 现市子程_中股异常(MB, 天组:=天组, 天典:=天典)
            Call 市调预程引擎销毁(天组, 天典)
        End If
    End If
'----------------------------------------------------------------------------------------
'全局
'----------------------------------------------------------------------------------------
    If 是否全局 Then
        MSG = MSG & 现市子程_全局监视(MB, 是否排序)
        MSG = MSG & 现市子程_全局全球(MB)
    End If
'----------------------------------------------------------------------------------------
    现市总程汇总子程 = MSG & ">>市场概览耗时：" & CInt(Timer - TT)
End Function






'20260612改：外簿分支 历码核 改用 历研统码基程_展日码总；添加 TT 全部耗时
Function 现市总程汇总正程( _
          Optional 是否外簿 As Boolean = False _
        , Optional 是否排序 As XlSortOrder = xlDescending _
        , Optional 是否全局 As Boolean = False _
        , Optional 是否中股 As Boolean = False _
        , Optional 是否海外 As Boolean = False _
        ) As String
'----------------------------------------------------------------------------------------
    UTL宏工具_BEGIN
    Dim TT As Single: TT = Timer
'========================================================================================
'准备
'========================================================================================
    Dim MB As Workbook
    If 是否外簿 = True Then
        Set MB = Workbooks.Add
    Else
        Set MB = ThisWorkbook
    End If
'========================================================================================
'输出：现市
'========================================================================================
    Dim MSG As String
    MSG = 现市总程汇总子程(MB:=MB, 是否排序:=是否排序, 是否全局:=是否全局, 是否中股:=是否中股, 是否海外:=是否海外)
    MSG = MSG & vbCrLf
    '------------------------------------------------------------------------------------
    If UTL判断工表存在("G", MB) Then MB.Sheets("G").Move Before:=MB.Sheets(1)
    If UTL判断工表存在("W", MB) Then MB.Sheets("W").Move after:=MB.Sheets(1)
    If UTL判断工表存在("G", MB) Then MB.Sheets("G").Activate
'========================================================================================
'输出：照明决策
'========================================================================================
If 是否外簿 = True Then
    '====================================================================================
    '输出：昭明决策
    '====================================================================================
    MSG = MSG & vbCrLf
    MSG = MSG & IQQQ展擎主前调正程(实结类型:="sSCC", 是否外簿:=True, 是否剔黑:=False, 是否筛决策:=True, 参of筛决策剔池:=False, 参of筛决策详表:=True, 是否筛市类:=True, 是否筛频谱:=True, 出章模式:="月护", 出节模式:="周层", WB:=MB)
    '====================================================================================
End If
'========================================================================================
'输出：历码核
'========================================================================================
If 是否外簿 = True Then
    '====================================================================================
    '输出：历码核
    '====================================================================================
    Dim 表名统码 As String
    表名统码 = "轮"
    MSG = MSG & vbCrLf
    MSG = MSG & 历研统码基程_展日码总(常期类为日, 表名统码, WB:=MB)
    MB.Sheets(表名统码).Activate
    '====================================================================================
End If
'========================================================================================
'保存：外部存档
'========================================================================================
    '------------------------------------------------------------------------------------
    '获取腾讯实时行情的最后日期
    '------------------------------------------------------------------------------------
    Dim sdate As Date
    Dim qdate As Date
    Dim qtime As Date
    sdate = STBASE取据引擎查时戳由腾实("sh000001")
    qdate = DateValue(sdate)
    qtime = TimeValue(sdate)
    '------------------------------------------------------------------------------------
    '文件名称
    '------------------------------------------------------------------------------------
    Dim 工簿简称 As String
    Dim 工簿路径 As String
    工簿简称 = "MMMM" & Format$(qdate, "YYYYMMDD")
    工簿路径 = ThisWorkbook.Path & "\" & 工簿简称 & ".xlsx"
    '------------------------------------------------------------------------------------
    '进行保存
    '------------------------------------------------------------------------------------
    If MB.Name <> ThisWorkbook.Name Then
        MSG = MSG & vbCrLf & PBASE格程工具_表操保存外簿(MB, 工簿简称) & vbCrLf
        'MB.Close
        MB.Activate
    End If
'========================================================================================
'结束
'========================================================================================
    Set MB = Nothing
    'ThisWorkbook.Save
    '------------------------------------------------------------------------------------
    UTL宏工具_END
    '------------------------------------------------------------------------------------
    MSG = MSG & ">>全部耗时：" & CInt(Timer - TT) & vbCrLf
    MSG = "市场概览：" & vbCrLf & MSG
    Debug.Print MSG
    MsgBox MSG, vbOKOnly, "市场概览"
    '------------------------------------------------------------------------------------
    现市总程汇总正程 = MSG
End Function
'========================================================================================
'########################################################################################
'########################################################################################
'#####################################   汇总总程   ######################################
'########################################################################################
'########################################################################################












'########################################################################################
'########################################################################################
'#####################################   现市单程无序   ##################################
'########################################################################################
'########################################################################################
'========================================================================================
'市场概览：全局
'========================================================================================
Sub 现市单程_全局全球()
    MSG = MSG & 现市子程_全局全球(ThisWorkbook)
    ThisWorkbook.Sheets("G").Move Before:=ThisWorkbook.Sheets(1)
    Debug.Print MSG
'    MsgBox MSG, vbOKOnly, "市场概览"
End Sub
Sub 现市单程_全局监视()
    MSG = MSG & 现市子程_全局监视(ThisWorkbook)
    ThisWorkbook.Sheets("W").Move after:=ThisWorkbook.Sheets(常仓名宝福)
    Debug.Print MSG
    MsgBox MSG, vbOKOnly, "市场概览"
End Sub
Sub 现市单程_中股指基()
    MSG = MSG & 现市子程_中股指基(ThisWorkbook)
    Debug.Print MSG
    MsgBox MSG, vbOKOnly, "市场概览"
End Sub
Sub 现市单程_中股异常()
    Dim 天组 As Variant
    Dim 天典 As New Dictionary
    MSG = MSG & 市调预程引擎初始(天组, 天典)
    MSG = MSG & 现市子程_中股异常(ThisWorkbook, 天组:=天组, 天典:=天典)
    Call 市调预程引擎销毁(天组, 天典)
    Debug.Print MSG
    MsgBox MSG, vbOKOnly, "市场概览"
End Sub
'========================================================================================
'########################################################################################
'########################################################################################
'#####################################   现市单程无序   ##################################
'########################################################################################
'########################################################################################


'########################################################################################
'########################################################################################
'#####################################   现市单程降序   ##################################
'########################################################################################
'########################################################################################
'========================================================================================
Sub 现市单程降序_中股精分汇总()
    Dim 天组 As Variant
    Dim 天典 As New Dictionary
    MSG = MSG & 现市子程_中股指基(ThisWorkbook)
    MSG = MSG & 市调预程引擎初始(天组, 天典)
'    MSG = MSG & 现市子程_中股异常(ThisWorkbook, 天组:=天组, 天典:=天典)
    MSG = MSG & 现市子程_中股精分行业益盟(ThisWorkbook, 是否排序:=常序降序, 天组:=天组, 天典:=天典)
    MSG = MSG & 现市子程_中股精分概念益盟(ThisWorkbook, 是否排序:=常序降序, 天组:=天组, 天典:=天典)
    Call 市调预程引擎销毁(天组, 天典)
    Debug.Print MSG
    MsgBox MSG, vbOKOnly, "市场概览"
End Sub
'========================================================================================
Sub 现市单程降序_中股精分概念益盟()
    Dim 天组 As Variant
    Dim 天典 As New Dictionary
    MSG = MSG & 市调预程引擎初始(天组, 天典)
    MSG = MSG & 现市子程_中股精分概念益盟(ThisWorkbook, 是否排序:=常序降序, 天组:=天组, 天典:=天典)
    Call 市调预程引擎销毁(天组, 天典)
    Debug.Print MSG
    MsgBox MSG, vbOKOnly, "市场概览"
End Sub
Sub 现市单程降序_中股精分行业益盟()
    Dim 天组 As Variant
    Dim 天典 As New Dictionary
    MSG = MSG & 市调预程引擎初始(天组, 天典)
    MSG = MSG & 现市子程_中股精分行业益盟(ThisWorkbook, 是否排序:=常序降序, 天组:=天组, 天典:=天典)
    Call 市调预程引擎销毁(天组, 天典)
    Debug.Print MSG
    MsgBox MSG, vbOKOnly, "市场概览"
        End Sub
'========================================================================================
'########################################################################################
'########################################################################################
'#####################################   现市单程降序   ##################################
'########################################################################################
'########################################################################################


'########################################################################################
'########################################################################################
'#####################################   现市单程升序   ##################################
'########################################################################################
'########################################################################################
'========================================================================================
Sub 现市单程升序_中股精分汇总()
    Dim 天组 As Variant
    Dim 天典 As New Dictionary
    MSG = MSG & 市调预程引擎初始(天组, 天典)
    MSG = MSG & 现市子程_中股精分行业益盟(ThisWorkbook, 是否排序:=常序升序, 天组:=天组, 天典:=天典)
    MSG = MSG & 现市子程_中股精分概念益盟(ThisWorkbook, 是否排序:=常序升序, 天组:=天组, 天典:=天典)
    Call 市调预程引擎销毁(天组, 天典)
    Debug.Print MSG
    MsgBox MSG, vbOKOnly, "市场概览"
End Sub
'========================================================================================
Sub 现市单程升序_中股精分概念益盟()
    Dim 天组 As Variant
    Dim 天典 As New Dictionary
    MSG = MSG & 市调预程引擎初始(天组, 天典)
    MSG = MSG & 现市子程_中股精分概念益盟(ThisWorkbook, 是否排序:=常序升序, 天组:=天组, 天典:=天典)
    Call 市调预程引擎销毁(天组, 天典)
    Debug.Print MSG
    MsgBox MSG, vbOKOnly, "市场概览"
End Sub
Sub 现市单程升序_中股精分行业益盟()
    Dim 天组 As Variant
    Dim 天典 As New Dictionary
    MSG = MSG & 市调预程引擎初始(天组, 天典)
    MSG = MSG & 现市子程_中股精分行业益盟(ThisWorkbook, 是否排序:=常序升序, 天组:=天组, 天典:=天典)
    Call 市调预程引擎销毁(天组, 天典)
    Debug.Print MSG
    MsgBox MSG, vbOKOnly, "市场概览"
End Sub
'========================================================================================
'########################################################################################
'########################################################################################
'#####################################   现市单程升序   ##################################
'########################################################################################
'########################################################################################


'########################################################################################
'########################################################################################
'#####################################   现市单程降序   ##################################
'#####################################     海外市场     ##################################
'########################################################################################
'########################################################################################
'========================================================================================
'市场概览：全球市场 降序
'========================================================================================
Sub 现市单程降序_市场香港()
    MSG = 现市子程_市场港股(ThisWorkbook, 是否排序:=常序降序)
    Debug.Print MSG
    MsgBox MSG, vbOKOnly, "市场概览"
End Sub
Sub 现市单程降序_市场美国()
    MSG = 现市子程_市场美股(ThisWorkbook, 是否排序:=常序降序)
    Debug.Print MSG
    MsgBox MSG, vbOKOnly, "市场概览"
End Sub
'========================================================================================
'市场概览：全球市场 升序
'========================================================================================
Sub 现市单程升序_市场香港()
    MSG = 现市子程_市场港股(ThisWorkbook, 是否排序:=常序升序)
    Debug.Print MSG
    MsgBox MSG, vbOKOnly, "市场概览"
End Sub
Sub 现市单程升序_市场美国()
    MSG = 现市子程_市场美股(ThisWorkbook, 是否排序:=常序升序)
    Debug.Print MSG
    MsgBox MSG, vbOKOnly, "市场概览"
End Sub
'========================================================================================
'########################################################################################
'########################################################################################
'#####################################   现市单程降序  ##################################
'#####################################     海外市场    ##################################
'########################################################################################
'########################################################################################







'########################################################################################
'########################################################################################
'#####################################   市调子程   #####################################
'########################################################################################
'########################################################################################
'========================================================================================
'类别：不排序
'========================================================================================
Function 现市子程_全局全球(MB As Workbook) As String
    TT = Timer
    UTL宏工具_BEGIN
    '------------------------------------------------------------------------------------
    Dim 表名 As String
    表名 = "G"
    Dim MS As Worksheet
    Call PBASE格程工具_表操工表新增(MS, 表名, WB:=MB)
    MS.Cells.Font.Name = "宋体"
    MS.Cells.Font.Size = 9
    MS.Tab.ColorIndex = 56
    'MS.Cells.Interior.ColorIndex = 44
    '------------------------------------------------------------------------------------
    Call 现市基程_全局全球(MS)
    Set MS = Nothing
    UTL宏工具_END
    现市子程_全局全球 = "【全局全球】耗时：" & CInt(Timer - TT) & vbCrLf
End Function
Function 现市子程_全局监视(MB As Workbook, Optional 是否排序 As XlSortOrder = xlDescending) As String
    TT = Timer
    UTL宏工具_BEGIN
    '------------------------------------------------------------------------------------
    Dim 表名 As String
    表名 = "W"
    Dim MS As Worksheet
    Call PBASE格程工具_表操工表新增(MS, 表名, WB:=MB)
    MS.Cells.Font.Name = "宋体"
    MS.Cells.Font.Size = 9
    MS.Tab.ColorIndex = 56
    MS.Cells.Interior.ColorIndex = 37
    '------------------------------------------------------------------------------------
    Call 现市基程_全局监视(MS, 是否排序:=是否排序)
    Set MS = Nothing
    UTL宏工具_END
    现市子程_全局监视 = "【全局监视】耗时：" & CInt(Timer - TT) & vbCrLf
End Function
Function 现市子程_中股指基(MB As Workbook, Optional 天组 As Variant, Optional 天典 As Dictionary) As String
    TT = Timer
    UTL宏工具_BEGIN
    '------------------------------------------------------------------------------------
    Dim 表名 As String
    表名 = "指基"
    Dim MS As Worksheet
    Call PBASE格程工具_表操工表新增(MS, 表名, WB:=MB)
    MS.Cells.Font.Name = "宋体"
    MS.Cells.Font.Size = 9
    MS.Tab.ColorIndex = 49
    MS.Cells.Interior.ColorIndex = 20
    '------------------------------------------------------------------------------------
    Call 现市基程_中股指基(MS, 天组:=天组, 天典:=天典)
    Set MS = Nothing
    UTL宏工具_END
    现市子程_中股指基 = "【A股指基】耗时：" & CInt(Timer - TT) & vbCrLf
End Function
'========================================================================================
'========================================================================================
'类别：海外
'========================================================================================
'========================================================================================
Function 现市子程_市场港股(MB As Workbook, Optional 是否排序 As XlSortOrder = xlDescending) As String
    TT = Timer
    UTL宏工具_BEGIN
    '------------------------------------------------------------------------------------
    Dim 表名 As String
    表名 = "港"
    Dim MS As Worksheet
    Call PBASE格程工具_表操工表新增(MS, 表名, WB:=MB)
    MS.Cells.Font.Name = "宋体"
    MS.Cells.Font.Size = 9
    MS.Tab.ColorIndex = 49
    MS.Cells.Interior.ColorIndex = 37
    '------------------------------------------------------------------------------------
    Call 现市基程_市场香港(MS, 是否排序:=是否排序)
    Set MS = Nothing
    UTL宏工具_END
    现市子程_市场港股 = "【港股】耗时：" & CInt(Timer - TT) & vbCrLf
End Function
Function 现市子程_市场美股(MB As Workbook, Optional 是否排序 As XlSortOrder = xlDescending) As String
    TT = Timer
    UTL宏工具_BEGIN
    '------------------------------------------------------------------------------------
    Dim 表名 As String
    表名 = "美"
    Dim MS As Worksheet
    Call PBASE格程工具_表操工表新增(MS, 表名, WB:=MB)
    MS.Cells.Font.Name = "宋体"
    MS.Cells.Font.Size = 9
    MS.Tab.ColorIndex = 49
    MS.Cells.Interior.ColorIndex = 37
    '------------------------------------------------------------------------------------
    Call 现市基程_市场美国(MS, 是否排序:=是否排序)
    Set MS = Nothing
    UTL宏工具_END
    现市子程_市场美股 = "【美股】耗时：" & CInt(Timer - TT) & vbCrLf
End Function
'========================================================================================
'========================================================================================
Function 现市子程_中股异常(MB As Workbook, Optional 天组 As Variant, Optional 天典 As Dictionary) As String
    TT = Timer
    UTL宏工具_BEGIN
    '------------------------------------------------------------------------------------
    Dim 表名 As String
    表名 = "异"
    Dim MS As Worksheet
    Call PBASE格程工具_表操工表新增(MS, 表名, WB:=MB)
    MS.Cells.Font.Name = "宋体"
    MS.Cells.Font.Size = 9
    MS.Tab.Color = 常色主靛
    MS.Cells.Interior.ColorIndex = 56
    '------------------------------------------------------------------------------------
    Call 现市基程_中股异常(MS, 天组:=天组, 天典:=天典)
    Set MS = Nothing
    UTL宏工具_END
    现市子程_中股异常 = "【A股异常】耗时：" & CInt(Timer - TT) & vbCrLf
End Function
'========================================================================================
'类别：排序
'========================================================================================
Function 现市子程_中股精分行业益盟(MB As Workbook, Optional 是否排序 As XlSortOrder = xlDescending, Optional 天组 As Variant, Optional 天典 As Dictionary) As String
    TT = Timer
    UTL宏工具_BEGIN
    '------------------------------------------------------------------------------------
    Dim 表名 As String
    表名 = "行益"
    Dim MS As Worksheet
    Call PBASE格程工具_表操工表新增(MS, 表名, WB:=MB)
    MS.Cells.Font.Name = "宋体"
    MS.Cells.Font.Size = 9
    MS.Tab.ColorIndex = 49
    MS.Cells.Interior.ColorIndex = 35
    '------------------------------------------------------------------------------------
    Call 现市基程_族行业益盟(MS, 是否排序:=是否排序, 天组:=天组, 天典:=天典)
    Set MS = Nothing
    UTL宏工具_END
    现市子程_中股精分行业益盟 = "【A股行业益盟】耗时：" & CInt(Timer - TT) & vbCrLf
End Function
Function 现市子程_中股精分概念益盟(MB As Workbook, Optional 是否排序 As XlSortOrder = xlDescending, Optional 天组 As Variant, Optional 天典 As Dictionary) As String
    TT = Timer
    UTL宏工具_BEGIN
    '------------------------------------------------------------------------------------
    Dim 表名 As String
    表名 = "概念"
    Dim MS As Worksheet
    Call PBASE格程工具_表操工表新增(MS, 表名, WB:=MB)
    MS.Cells.Font.Name = "宋体"
    MS.Cells.Font.Size = 9
    MS.Tab.ColorIndex = 49
    MS.Cells.Interior.ColorIndex = 35
    '------------------------------------------------------------------------------------
    Call 现市基程_族概念益盟(MS, 是否排序:=是否排序, 天组:=天组, 天典:=天典)
    MS.Columns("D").ColumnWidth = 25
    Set MS = Nothing
    UTL宏工具_END
    现市子程_中股精分概念益盟 = "【A股概念益盟】耗时：" & CInt(Timer - TT) & vbCrLf
End Function
'========================================================================================
'########################################################################################
'########################################################################################
'#####################################   市调子程   #####################################
'########################################################################################
'########################################################################################





