Attribute VB_Name = "WMR现市_F1港股"
'========================================================================================
'========================================================================================
'调用：港股
'========================================================================================
'========================================================================================
Function 现市基程_市场香港( _
          MS As Worksheet _
        , Optional 是否排序 As XlSortOrder = xlDescending _
        , Optional 始行 As Integer = 3 _
        , Optional 始列 As Integer = 3 _
        ) As Boolean
'========================================================================================
'页面格式设置
'========================================================================================
    MS.Cells.Font.Size = 10
    MS.Columns.ColumnWidth = 2
    '------------------------------------------------------------------------------------
    MS.Cells(始行, 始行 + 1) = "芥蓝"
    MS.Columns(始行 + 1).ColumnWidth = 16
    MS.Columns(始行 + 2).ColumnWidth = 6
    MS.Columns(始行 + 3).ColumnWidth = 5
    MS.Columns(始行 + 3).Hidden = True
    '------------------------------------------------------------------------------------
    Dim 当列 As Integer
    当列 = 始行 + 5
'========================================================================================
'AH对比
'========================================================================================
    当列 = 现市特程_HK_中港AH对比(MS, 始行, 当列)
'========================================================================================
'指数系列
'========================================================================================
    当列 = 当列 + 2
    '------------------------------------------------------------------------------------
    当列 = 现市分程HK_成分_恒生系列(MS, 始行, 当列, 是否排序) + 1
    '------------------------------------------------------------------------------------
    当列 = 现市分程HK_成分_香港300系列(MS, 始行, 当列, 是否排序) + 1
    '------------------------------------------------------------------------------------
    当列 = 现市分程HK_成分_香港大盘系列(MS, 始行, 当列, 是否排序) + 1
    '------------------------------------------------------------------------------------
    当列 = 现市分程HK_成分_港股通系列(MS, 始行, 当列, 是否排序) + 1
'========================================================================================
'行业系列
'========================================================================================
    当列 = 当列 + 2
    当列 = 现市分程_类系列中证_香港消费类群(MS, 始行, 当列, 是否排序)
'========================================================================================
'页面格式设置
'========================================================================================
    With MS.Rows(始行)
        .Font.Bold = True
        .HorizontalAlignment = xlLeft
        .Borders(xlEdgeBottom).Weight = xlThin
    End With
    '------------------------------------------------------------------------------------
    MS.Activate
    Call PBASE格程工具_表冻结锁定(MS, 始行)
'========================================================================================
End Function





Function 现市分程_类系列中证_香港消费类群( _
          MS As Worksheet, 始行 As Integer, 始列 As Integer _
        , Optional 是否排序 As XlSortOrder = xlDescending _
        ) As Integer
    '========================================================================================
    MS.Cells(始行, 始列).Cells(1, 位简式名称) = "香港消费类群"
    '----------------------------------------------------------------------------------------
    Dim 目行 As Integer
    Dim 目列 As Integer
    目行 = 始行 + 1
    目列 = 始列
    Dim 码市 As String
    码市 = "HK"
    Dim 码类 As String
    Dim 码指 As String
    Dim 码组 As Variant
    '========================================================================================
    码类 = "中国主要消费"
    码组 = Array( _
          "hk00149", "hk00151", "hk00168", "hk00220", "hk00291", "hk00322", "hk00506" _
        , "hk00606", "hk01044", "hk01112", "hk01458", "hk01676", "hk02319" _
        , "hk06808")
    码指 = "H11158"
    目列 = 查程同市码组(码市, 码类, 码组, MS, 目行, 目列, 是否排序, 码指:=码指)
    Erase 码组
    '----------------------------------------------------------------------------------------
    码类 = "中国可选消费"
    码组 = Array( _
          "hk00175", "hk00308", "hk00425", "hk00489", "hk00493", "hk00751", "hk00819" _
        , "hk00868", "hk00881", "hk00921", "hk01060", "hk01114", "hk01211" _
        , "hk01293", "hk01317", "hk01361", "hk01528", "hk01569", "hk01571", "hk01728" _
        , "hk01958", "hk01970", "hk01999", "hk02020", "hk02238", "hk02313", "hk02331" _
        , "hk02333", "hk02382", "hk02669", "hk03606", "hk03669", "hk03813", "hk03836" _
        , "hk06068", "hk06169")
    码指 = "H11156"
    目列 = 查程同市码组(码市, 码类, 码组, MS, 目行, 目列, 是否排序, 码指:=码指)
    Erase 码组
    '----------------------------------------------------------------------------------------
    '========================================================================================
    现市分程_类系列中证_香港消费类群 = 目列
End Function


 
 
 
 
'========================================================================================
'========================================================================================
'恒生指数系列
'========================================================================================
'========================================================================================
Function 现市分程HK_成分_恒生系列(MS As Worksheet, 始行 As Integer, 始列 As Integer, Optional 是否排序 As XlSortOrder = xlDescending) As Integer
    MS.Cells(始行, 始列).Cells(1, 位简式名称) = "恒生系列指数"
    '------------------------------------------------------------------------------------
    Dim 目行 As Integer
    Dim 目列 As Integer
    目行 = 始行 + 1
    目列 = 始列
    Dim 码市 As String
    码市 = "HK"
    Dim 码类 As String
    Dim 码指 As String
    Dim 码组 As Variant
'========================================================================================
    '------------------------------------------------------------------------------------
    码类 = "恒生科技指数"
    码组 = Array( _
          "hk09999", "hk02015", "hk09898", "hk00268", "hk09988", "hk09888", "hk06690" _
        , "hk00700", "hk09618", "hk01833", "hk01024", "hk01810", "hk01797", "hk09626" _
        , "hk00772", "hk00992", "hk09698", "hk06060", "hk03888", "hk09961", "hk02382" _
        , "hk00285", "hk03690", "hk09866", "hk00241", "hk06618", "hk00981", "hk09868" _
        , "hk00020", "hk01347")
    码指 = "hkHTI"
    目列 = 查程同市码组(码市, 码类, 码组, MS, 目行, 目列, 是否排序, 码指:=码指)
    Erase 码组
    '------------------------------------------------------------------------------------
    码类 = "恒生指数"
    码组 = Array( _
          "hk09999", "hk00012", "hk00017", "hk01038", "hk00823", "hk00836", "hk01876" _
        , "hk00006", "hk02015", "hk01997", "hk02388", "hk00003", "hk00016", "hk00066" _
        , "hk00005", "hk01929", "hk03692", "hk00868", "hk00322", "hk01088", "hk01113" _
        , "hk02313", "hk00941", "hk00002", "hk00011", "hk00101", "hk00288", "hk00857" _
        , "hk01099", "hk01299", "hk01398", "hk00316", "hk01928", "hk00669", "hk01044" _
        , "hk02688", "hk00762", "hk03988", "hk00001", "hk00386", "hk00939", "hk09633" _
        , "hk09988", "hk09888", "hk00883", "hk06690", "hk00175", "hk02628", "hk03968" _
        , "hk00388", "hk01378", "hk00027", "hk02269", "hk00267", "hk00688", "hk01211" _
        , "hk01177", "hk00881", "hk00291", "hk00700", "hk09618", "hk02899", "hk01810" _
        , "hk02319", "hk00992", "hk01209", "hk09961", "hk02318", "hk02382", "hk02359" _
        , "hk03690", "hk00241", "hk01093", "hk00968", "hk01109", "hk06618", "hk00981" _
        , "hk02020", "hk06862", "hk02331", "hk06098", "hk00960")
    码指 = "hkHSI"
    目列 = 查程同市码组(码市, 码类, 码组, MS, 目行, 目列, 是否排序, 码指:=码指)
    Erase 码组
    '------------------------------------------------------------------------------------
    码类 = "恒生国企指数"
    码指 = "hkHSCEI"
    码组 = Array( _
          "hk09999", "hk02015", "hk01088", "hk02313", "hk00941", "hk03328", "hk00857" _
        , "hk01658", "hk01398", "hk02688", "hk01288", "hk03988", "hk00386", "hk00939" _
        , "hk09633", "hk09988", "hk09888", "hk00883", "hk06690", "hk00175", "hk02628" _
        , "hk03968", "hk00267", "hk00688", "hk01211", "hk01177", "hk00881", "hk00291" _
        , "hk00700", "hk09618", "hk01024", "hk01810", "hk02319", "hk00992", "hk09961" _
        , "hk02318", "hk02382", "hk02618", "hk03690", "hk01093", "hk00968", "hk01109" _
        , "hk06618", "hk00981", "hk02020", "hk06862", "hk09868", "hk02331", "hk00020" _
        , "hk00960")
    目列 = 查程同市码组(码市, 码类, 码组, MS, 目行, 目列, 是否排序, 码指:=码指)
    Erase 码组
'========================================================================================
    现市分程HK_成分_恒生系列 = 目列
End Function


 
'========================================================================================
'========================================================================================
'香港300指数系列
'========================================================================================
'========================================================================================
Function 现市分程HK_成分_香港300系列(MS As Worksheet, 始行 As Integer, 始列 As Integer, Optional 是否排序 As XlSortOrder = xlDescending) As Integer
    MS.Cells(始行, 始列).Cells(1, 位简式名称) = "香港300系列"
    '------------------------------------------------------------------------------------
    Dim 目行 As Integer
    Dim 目列 As Integer
    目行 = 始行 + 1
    目列 = 始列
    Dim 码市 As String
    码市 = "HK"
    Dim 码指 As String
    Dim 码组
'========================================================================================
    码指 = "香港300龙头"
    码组 = Array( _
          "hk00001", "hk00002", "hk00005", "hk00016", "hk00027", "hk00066", "hk00148" _
        , "hk00151", "hk00175", "hk00285", "hk00288", "hk00386", "hk00388", "hk00493" _
        , "hk00511", "hk00522", "hk00552", "hk00669", "hk00688", "hk00700", "hk00753" _
        , "hk00762", "hk00881", "hk00883", "hk00902", "hk00914", "hk00939", "hk00941" _
        , "hk00981", "hk01044", "hk01060", "hk01099", "hk01177", "hk01211", "hk01359" _
        , "hk01515", "hk01766", "hk01800", "hk01928", "hk02018", "hk02313", "hk02318" _
        , "hk02588", "hk02628", "hk03320", "hk03323", "hk03888", "hk06030", "hk06808" _
        )
    目列 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序)
    Erase 码组
    '------------------------------------------------------------------------------------
    码指 = "香港300银行"
    码组 = Array( _
          "hk00005", "hk00011", "hk00023", "hk00440", "hk00939", "hk00998", "hk01288" _
        , "hk01398", "hk01578", "hk01658", "hk01988", "hk02066", "hk02388", "hk02888" _
        , "hk03328", "hk03618", "hk03968", "hk03988", "hk06818")
    目列 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序)
    Erase 码组
    '------------------------------------------------------------------------------------
    码指 = "香港300金融服务"
    码组 = Array( _
          "hk00001", "hk00005", "hk00011", "hk00019", "hk00023", "hk00165", "hk00388" _
        , "hk00412", "hk00440", "hk00656", "hk00806", "hk00931", "hk00939" _
        , "hk00966", "hk00998", "hk01288", "hk01299", "hk01336", "hk01339" _
        , "hk01359", "hk01398", "hk01508", "hk01578", "hk01658", "hk01776", "hk01788" _
        , "hk01988", "hk02066", "hk02318", "hk02328", "hk02388", "hk02601", "hk02628" _
        , "hk02799", "hk02888", "hk03328", "hk03360", "hk03396", "hk03618", "hk03908" _
        , "hk03968", "hk03988", "hk06030", "hk06099", "hk06818", "hk06837", "hk06881" _
        , "hk06886")
    目列 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序)
    Erase 码组
    '------------------------------------------------------------------------------------
    码指 = "香港300地产"
    码组 = Array( _
          "hk00004", "hk00010", "hk00012", "hk00014", "hk00016", "hk00017", "hk00020" _
        , "hk00083", "hk00101", "hk00119", "hk00123", "hk00173", "hk00207" _
        , "hk00272", "hk00405", "hk00410", "hk00563", "hk00604", "hk00607", "hk00683" _
        , "hk00688", "hk00778", "hk00813", "hk00817", "hk00823", "hk00884", "hk00960" _
        , "hk01109", "hk01113", "hk01638", "hk01668", "hk01813", "hk01918" _
        , "hk02007", "hk02098", "hk02202", "hk02329", "hk02777", "hk02778", "hk03333" _
        , "hk03377", "hk03380", "hk03383", "hk03900", "hk87001")
    目列 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序)
    Erase 码组
    '------------------------------------------------------------------------------------
    码指 = "香港300基建"
    码组 = Array( _
          "hk00002", "hk00003", "hk00006", "hk00008", "hk00144", "hk00177", "hk00215" _
        , "hk00270", "hk00285", "hk00303", "hk00315", "hk00371", "hk00384", "hk00390" _
        , "hk00552", "hk00576", "hk00694", "hk00728", "hk00762", "hk00763", "hk00836" _
        , "hk00902", "hk00916", "hk00941", "hk01038", "hk01052", "hk01083" _
        , "hk01186", "hk01193", "hk01199", "hk01315", "hk01800", "hk01816", "hk02380" _
        , "hk02688", "hk02883", "hk03311", "hk03369", "hk03382")
    目列 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序)
    Erase 码组
    '------------------------------------------------------------------------------------
    码指 = "香港300运输"
    码组 = Array( _
          "hk00066", "hk00144", "hk00152", "hk00177", "hk00242", "hk00293", "hk00316" _
        , "hk00576", "hk00636", "hk00670", "hk00694", "hk00753", "hk01052" _
        , "hk01055", "hk01199", "hk01308", "hk01919", "hk03369", "hk03382")
    目列 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序)
    Erase 码组
    '------------------------------------------------------------------------------------
    码指 = "香港300资源"
    码组 = Array( _
          "hk00135", "hk00358", "hk00386", "hk00486", "hk00857", "hk00883", "hk01088" _
        , "hk01171", "hk01208", "hk01378", "hk01898", "hk02600", "hk02899" _
        )
    目列 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序)
    Erase 码组
    '------------------------------------------------------------------------------------
    码指 = "香港300TMT"
    码组 = Array( _
          "hk00008", "hk00148", "hk00215", "hk00285", "hk00303", "hk00315", "hk00400" _
        , "hk00439", "hk00511", "hk00522", "hk00552", "hk00696", "hk00698" _
        , "hk00700", "hk00728", "hk00762", "hk00763", "hk00777", "hk00861", "hk00941" _
        , "hk00981", "hk00992", "hk01060", "hk01357", "hk01888", "hk01970", "hk02018" _
        , "hk02038", "hk03888", "hk03969")
    目列 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序)
    Erase 码组
    '------------------------------------------------------------------------------------
    码指 = "香港300消费"
    码组 = Array( _
          "hk00027", "hk00069", "hk00136", "hk00142", "hk00151", "hk00168", "hk00175" _
        , "hk00178", "hk00200", "hk00220", "hk00288", "hk00291", "hk00308", "hk00321" _
        , "hk00322", "hk00330", "hk00341", "hk00345", "hk00425", "hk00489", "hk00493" _
        , "hk00506", "hk00511", "hk00551", "hk00590", "hk00606" _
        , "hk00669", "hk00751", "hk00868", "hk00880", "hk00881", "hk01044" _
        , "hk01060", "hk01114", "hk01117", "hk01128", "hk01211", "hk01293" _
        , "hk01316", "hk01368", "hk01382", "hk01448", "hk01458", "hk01565", "hk01680" _
        , "hk01836", "hk01910", "hk01913", "hk01928", "hk01958", "hk01970", "hk01999" _
        , "hk02020", "hk02199", "hk02238", "hk02282", "hk02313", "hk02319", "hk02331" _
        , "hk02333", "hk02382", "hk03813", "hk03818", "hk03918", "hk06808" _
        )
    目列 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序)
    Erase 码组
'========================================================================================
    现市分程HK_成分_香港300系列 = 目列
End Function


 
'========================================================================================
'========================================================================================
'香港大盘指数
'========================================================================================
'========================================================================================
Function 现市分程HK_成分_香港大盘系列(MS As Worksheet, 始行 As Integer, 始列 As Integer, Optional 是否排序 As XlSortOrder = xlDescending) As Integer
    MS.Cells(始行, 始列).Cells(1, 位简式名称) = "香港大盘指数"
    '------------------------------------------------------------------------------------
    Dim 目行 As Integer
    Dim 目列 As Integer
    目行 = 始行 + 1
    目列 = 始列
    Dim 码市 As String
    码市 = "HK"
    Dim 码指 As String
    Dim 码组
'========================================================================================
    码指 = "香港50"
    码组 = Array( _
          "hk00001", "hk00002", "hk00003", "hk00004", "hk00005", "hk00006", "hk00011" _
        , "hk00012", "hk00016", "hk00019", "hk00020", "hk00023", "hk00027", "hk00066" _
        , "hk00083", "hk00101", "hk00151", "hk00288", "hk00386", "hk00388", "hk00656" _
        , "hk00688", "hk00700", "hk00762", "hk00823", "hk00857", "hk00883", "hk00939" _
        , "hk00941", "hk00998", "hk01038", "hk01044", "hk01109", "hk01113", "hk01288" _
        , "hk01299", "hk01398", "hk01658", "hk01928", "hk02007", "hk02018", "hk02318" _
        , "hk02388", "hk02601", "hk02628", "hk02888", "hk03328", "hk03333", "hk03968" _
        , "hk03988")
    目列 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序)
    Erase 码组
    '------------------------------------------------------------------------------------
    码指 = "香港100"
    码组 = Array( _
          "hk00001", "hk00002", "hk00003", "hk00004", "hk00005", "hk00006", "hk00010" _
        , "hk00011", "hk00012", "hk00014", "hk00016", "hk00017", "hk00019", "hk00020" _
        , "hk00023", "hk00027", "hk00066", "hk00083", "hk00101", "hk00135", "hk00144" _
        , "hk00151", "hk00175", "hk00257", "hk00270", "hk00288", "hk00291", "hk00293" _
        , "hk00322", "hk00371", "hk00384", "hk00386", "hk00388", "hk00392", "hk00551" _
        , "hk00607", "hk00656", "hk00669", "hk00688", "hk00700", "hk00728", "hk00762" _
        , "hk00813", "hk00823", "hk00836", "hk00857", "hk00883", "hk00939", "hk00941" _
        , "hk00960", "hk00966", "hk00992", "hk00998", "hk01038", "hk01044" _
        , "hk01060", "hk01088", "hk01093", "hk01109", "hk01113", "hk01114", "hk01128" _
        , "hk01177", "hk01193", "hk01288", "hk01299", "hk01336", "hk01359" _
        , "hk01398", "hk01658", "hk01800", "hk01913", "hk01928", "hk01988", "hk02007" _
        , "hk02018", "hk02020", "hk02098", "hk02282", "hk02313", "hk02318", "hk02319" _
        , "hk02328", "hk02388", "hk02601", "hk02628", "hk02688", "hk02799", "hk02888" _
        , "hk03311", "hk03320", "hk03328", "hk03333", "hk03968", "hk03988" _
        , "hk06808", "hk06837")
    目列 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序)
    Erase 码组
'========================================================================================
    现市分程HK_成分_香港大盘系列 = 目列
End Function



'========================================================================================
'========================================================================================
'港股通系列
'========================================================================================
'========================================================================================
Function 现市分程HK_成分_港股通系列(MS As Worksheet, 始行 As Integer, 始列 As Integer, Optional 是否排序 As XlSortOrder = xlDescending) As Integer
    MS.Cells(始行, 始列).Cells(1, 位简式名称) = "港股通系列"
    '------------------------------------------------------------------------------------
    Dim 目行 As Integer
    Dim 目列 As Integer
    目行 = 始行 + 1
    目列 = 始列
    Dim 码市 As String
    码市 = "HK"
    Dim 码指 As String
    Dim 码组
'========================================================================================
    码指 = "港沪通"
    码组 = Array( _
          "hk00008", "hk00010", "hk00014", "hk00020", "hk00041", "hk00069", "hk00123", "hk00136", "hk00142" _
        , "hk00148", "hk00173", "hk00178", "hk00179", "hk00200", "hk00215", "hk00220", "hk00241", "hk00242", "hk00272" _
        , "hk00285", "hk00303", "hk00308", "hk00315", "hk00316", "hk00317", "hk00322", "hk00330", "hk00336", "hk00341" _
        , "hk00345", "hk00384", "hk00400", "hk00410", "hk00425", "hk00439", "hk00440", "hk00460", "hk00493" _
        , "hk00506", "hk00511", "hk00522", "hk00551", "hk00552", "hk00570", "hk00576", "hk00586", "hk00590", "hk00604" _
        , "hk00606", "hk00607", "hk00636", "hk00656", "hk00658", "hk00659", "hk00669", "hk00683" _
        , "hk00694", "hk00696", "hk00698", "hk00732", "hk00737", "hk00751", "hk00777", "hk00806" _
        , "hk00813", "hk00861", "hk00867", "hk00868", "hk00874", "hk00880", "hk00881", "hk00884", "hk00931", "hk00934" _
        , "hk00960", "hk00968", "hk00981", "hk01060", "hk01066", "hk01083", "hk01093" _
        , "hk01112", "hk01117", "hk01128", "hk01177", "hk01208", "hk01282", "hk01293", "hk01308" _
        , "hk01313", "hk01315", "hk01316", "hk01347", "hk01357", "hk01375", "hk01382", "hk01432" _
        , "hk01458", "hk01508", "hk01515", "hk01530", "hk01668", "hk01680", "hk01788", "hk01813", "hk01882", "hk01888" _
        , "hk01918", "hk01929", "hk01958", "hk01970", "hk01972", "hk01999", "hk02007", "hk02020", "hk02038", "hk02128" _
        , "hk02186", "hk02199", "hk02269", "hk02282", "hk02313", "hk02314", "hk02329", "hk02356", "hk02357", "hk02382" _
        , "hk02386", "hk02588", "hk02600", "hk02688", "hk02689", "hk02777", "hk02799", "hk02888", "hk03311", "hk03320" _
        , "hk03323", "hk03331", "hk03333", "hk03360", "hk03377", "hk03380", "hk03383", "hk03396", "hk03618", "hk03698" _
        , "hk03800", "hk03808", "hk03886", "hk03888", "hk03899", "hk03900", "hk03908", "hk03969", "hk06808" _
        )
    目列 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序)
    Erase 码组
    '------------------------------------------------------------------------------------
    码指 = "港深通"
    码组 = Array( _
          "hk00035", "hk00042", "hk00081", "hk00095", "hk00116", "hk00163", "hk00256", "hk00268", "hk00279" _
        , "hk00295", "hk00297", "hk00321", "hk00327", "hk00337", "hk00354", "hk00368", "hk00419", "hk00451" _
        , "hk00467", "hk00468", "hk00480", "hk00488", "hk00535", "hk00546", "hk00547", "hk00563", "hk00579", "hk00581" _
        , "hk00598", "hk00639", "hk00686", "hk00687", "hk00709", "hk00718", "hk00775", "hk00799" _
        , "hk00819", "hk00845", "hk00853", "hk00855", "hk00951", "hk00976", "hk00978", "hk01030", "hk01052", "hk01070" _
        , "hk01098", "hk01115", "hk01141", "hk01196", "hk01205", "hk01234", "hk01238", "hk01250", "hk01257" _
        , "hk01302", "hk01310", "hk01317", "hk01361", "hk01368", "hk01381", "hk01448", "hk01478", "hk01528", "hk01548" _
        , "hk01551", "hk01569", "hk01585", "hk01610", "hk01622", "hk01628", "hk01636", "hk01638", "hk01666", "hk01728" _
        , "hk01777", "hk01778", "hk01811", "hk01818", "hk01836", "hk01848", "hk01883", "hk01963" _
        , "hk01966", "hk01980", "hk02005", "hk02111", "hk02233", "hk02255", "hk02280", "hk02298", "hk02331", "hk02343" _
        , "hk02666", "hk02678", "hk02768", "hk02869", "hk02877", "hk03301", "hk03329", "hk03339", "hk03382", "hk03813" _
        , "hk03818", "hk03836", "hk03883", "hk03933", "hk03998", "hk06066", "hk06169", "hk06828", "hk06869")
    目列 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序)
    Erase 码组
    '------------------------------------------------------------------------------------
'========================================================================================
    现市分程HK_成分_港股通系列 = 目列
End Function





 
 
 
 
 
 
 
'========================================================================================
'========================================================================================
'========================================================================================
'AH行情基本模块
'========================================================================================
'========================================================================================
'========================================================================================
Function 现市特程_HK_中港AH对比(MS As Worksheet, 始行 As Integer, 始列 As Integer, Optional 是否排序 As XlSortOrder = xlDescending) As Integer
'========================================================================================
'代码对列表
'========================================================================================
Dim COLLAH As New Collection
With COLLAH
    '--------------------------------------------银行
    .Add Item:="sh601398", Key:="工商银行SS"
    .Add Item:="r_hk01398", Key:="工商银行HK"
    .Add Item:="sh601288", Key:="农业银行SS"
    .Add Item:="r_hk01288", Key:="农业银行HK"
    .Add Item:="sh601988", Key:="中国银行SS"
    .Add Item:="r_hk03988", Key:="中国银行HK"
    .Add Item:="sh601939", Key:="建设银行SS"
    .Add Item:="r_hk00939", Key:="建设银行HK"
    .Add Item:="sh601328", Key:="交通银行SS"
    .Add Item:="r_hk03328", Key:="交通银行HK"
    .Add Item:="sh600036", Key:="招商银行SS"
    .Add Item:="r_hk03968", Key:="招商银行HK"
    .Add Item:="sh600016", Key:="民生银行SS"
    .Add Item:="r_hk01988", Key:="民生银行HK"
    .Add Item:="sh601998", Key:="中信银行SS"
    .Add Item:="r_hk00998", Key:="中信银行HK"
    .Add Item:="sh601818", Key:="光大银行SS"
    .Add Item:="r_hk06818", Key:="光大银行HK"
    '--------------------------------------------保险
    .Add Item:="sh601318", Key:="中国平安SS"
    .Add Item:="r_hk02318", Key:="中国平安HK"
    .Add Item:="sh601628", Key:="中国人寿SS"
    .Add Item:="r_hk02628", Key:="中国人寿HK"
    .Add Item:="sh601601", Key:="中国太保SS"
    .Add Item:="r_hk02601", Key:="中国太保HK"
    .Add Item:="sh601336", Key:="新华保险SS"
    .Add Item:="r_hk01336", Key:="新华保险HK"
    '--------------------------------------------证券
    .Add Item:="sh600030", Key:="中信证券SS"
    .Add Item:="r_hk06030", Key:="中信证券HK"
    .Add Item:="sh600999", Key:="招商证券SS"
    .Add Item:="r_hk06099", Key:="招商证券HK"
    .Add Item:="sh601211", Key:="国泰君安SS"
    .Add Item:="r_hk02611", Key:="国泰君安HK"
    .Add Item:="sh600837", Key:="海通证券SS"
    .Add Item:="r_hk06837", Key:="海通证券HK"
    .Add Item:="sh600958", Key:="东方证券SS"
    .Add Item:="r_hk03958", Key:="东方证券HK"
    .Add Item:="sh601788", Key:="光大证券SS"
    .Add Item:="r_hk06178", Key:="光大证券HK"
    .Add Item:="sh601881", Key:="中国银河SS"
    .Add Item:="r_hk06881", Key:="中国银河HK"
    .Add Item:="sh601688", Key:="华泰证券SS"
    .Add Item:="r_hk06886", Key:="华泰证券HK"
    .Add Item:="sz000776", Key:="广发证券SS"
    .Add Item:="r_hk01776", Key:="广发证券HK"
    '--------------------------------------------制造
    .Add Item:="sz000063", Key:="中兴通讯SS"
    .Add Item:="r_hk00763", Key:="中兴通讯HK"
    .Add Item:="sz002202", Key:="金风科技SS"
    .Add Item:="r_hk02208", Key:="金风科技HK"
    .Add Item:="sh601766", Key:="中国中车SS"
    .Add Item:="r_hk01766", Key:="中国中车HK"
    .Add Item:="sz000157", Key:="中联重科SS"
    .Add Item:="r_hk01157", Key:="中联重科HK"
    .Add Item:="sz000338", Key:="潍柴动力SS"
    .Add Item:="r_hk02338", Key:="潍柴动力HK"
    .Add Item:="sh601038", Key:="一拖股份SS"
    .Add Item:="r_hk00038", Key:="一拖股份HK"
    .Add Item:="sh601717", Key:="郑煤机SS"
    .Add Item:="r_hk00564", Key:="郑煤机HK"
    '--------------------------------------------汽车
    .Add Item:="sh601633", Key:="长城汽车SS"
    .Add Item:="r_hk02333", Key:="长城汽车HK"
    .Add Item:="sh601238", Key:="广汽集团SS"
    .Add Item:="r_hk02238", Key:="广汽集团HK"
    .Add Item:="sz002594", Key:="比亚迪SS"
    .Add Item:="r_hk01211", Key:="比亚迪HK"
    '--------------------------------------------电气
    .Add Item:="sh601727", Key:="上海电气SS"
    .Add Item:="r_hk02727", Key:="上海电气HK"
    .Add Item:="sh600875", Key:="东方电气SS"
    .Add Item:="r_hk01072", Key:="东方电气HK"
    '--------------------------------------------建筑
    .Add Item:="sh601800", Key:="中国交建SS"
    .Add Item:="r_hk01800", Key:="中国交建HK"
    .Add Item:="sh601618", Key:="中国中冶SS"
    .Add Item:="r_hk01618", Key:="中国中冶HK"
    .Add Item:="sh601390", Key:="中国中铁SS"
    .Add Item:="r_hk00390", Key:="中国中铁HK"
    .Add Item:="sh601186", Key:="中国铁建SS"
    .Add Item:="r_hk01186", Key:="中国铁建HK"
    '--------------------------------------------房地产
    .Add Item:="sz000002", Key:="万科SS"
    .Add Item:="r_hk02202", Key:="万科HK"
    .Add Item:="sh600048", Key:="保利SS"
    .Add Item:="r_hk00119", Key:="保利HK"
    .Add Item:="sh601588", Key:="北辰实业SS"
    .Add Item:="r_hk00588", Key:="北辰实业HK"
    '--------------------------------------------有色
    .Add Item:="sh600362", Key:="江西铜业SS"
    .Add Item:="r_hk00358", Key:="江西铜业HK"
    .Add Item:="sh601899", Key:="紫金矿业SS"
    .Add Item:="r_hk02899", Key:="紫金矿业HK"
    .Add Item:="sh603993", Key:="洛阳钼业SS"
    .Add Item:="r_hk03993", Key:="洛阳钼业HK"
    '--------------------------------------------钢铁
    .Add Item:="sz000898", Key:="鞍钢股份SS"
    .Add Item:="r_hk00347", Key:="鞍钢股份HK"
    .Add Item:="sh600808", Key:="马钢股份SS"
    .Add Item:="r_hk00323", Key:="马钢股份HK"
    '--------------------------------------------煤炭
    .Add Item:="sh601088", Key:="中国神华SS"
    .Add Item:="r_hk01088", Key:="中国神华HK"
    .Add Item:="sh601898", Key:="中煤能源SS"
    .Add Item:="r_hk01898", Key:="中煤能源HK"
    .Add Item:="sh600188", Key:="兖州煤业SS"
    .Add Item:="r_hk01171", Key:="兖州煤业HK"
    '--------------------------------------------石化
    .Add Item:="sh601857", Key:="中国石油SS"
    .Add Item:="r_hk00857", Key:="中国石油HK"
    .Add Item:="sh600028", Key:="中国石化SS"
    .Add Item:="r_hk00386", Key:="中国石化HK"
    .Add Item:="sh600688", Key:="上海石化SS"
    .Add Item:="r_hk00338", Key:="上海石化HK"
    .Add Item:="sh601808", Key:="中海油服SS"
    .Add Item:="r_hk02883", Key:="中海油服HK"
    .Add Item:="sh600871", Key:="石化油服SS"
    .Add Item:="r_hk01033", Key:="石化油服HK"
    '--------------------------------------------电力
    .Add Item:="sh600027", Key:="华电国际SS"
    .Add Item:="r_hk01071", Key:="华电国际HK"
    .Add Item:="sh600011", Key:="华能国际SS"
    .Add Item:="r_hk00902", Key:="华能国际HK"
    .Add Item:="sh601991", Key:="大唐发电SS"
    .Add Item:="r_hk00991", Key:="大唐发电HK"
    '--------------------------------------------周期
    .Add Item:="sh600585", Key:="海螺水泥SS"
    .Add Item:="r_hk00914", Key:="海螺水泥HK"
    .Add Item:="sh601992", Key:="金隅股份SS"
    .Add Item:="r_hk02009", Key:="金隅股份HK"
    .Add Item:="sz000488", Key:="晨鸣纸业SS"
    .Add Item:="r_hk01812", Key:="晨鸣纸业HK"
    .Add Item:="sh600660", Key:="福耀玻璃SS"
    .Add Item:="r_hk03606", Key:="福耀玻璃HK"
    .Add Item:="sh600876", Key:="洛阳玻璃SS"
    .Add Item:="r_hk01108", Key:="洛阳玻璃HK"
    '--------------------------------------------航空
    .Add Item:="sh601111", Key:="中国国航SS"
    .Add Item:="r_hk00753", Key:="中国国航HK"
    .Add Item:="sh600115", Key:="东方航空SS"
    .Add Item:="r_hk00670", Key:="东方航空HK"
    .Add Item:="sh600029", Key:="南方航空SS"
    .Add Item:="r_hk01055", Key:="南方航空HK"
    '--------------------------------------------航运
    .Add Item:="sh601919", Key:="中远海控SS"
    .Add Item:="r_hk01919", Key:="中远海控HK"
    .Add Item:="sh601866", Key:="中远海发SS"
    .Add Item:="r_hk02866", Key:="中远海发HK"
    .Add Item:="sh600026", Key:="中远海能SS"
    .Add Item:="r_hk01138", Key:="中远海能HK"
    .Add Item:="sz000039", Key:="中集集团SS"
    .Add Item:="r_hk02039", Key:="中集集团HK"
    '--------------------------------------------港口
    .Add Item:="sh601880", Key:="大连港SS"
    .Add Item:="r_hk02880", Key:="大连港HK"
    .Add Item:="sh601326", Key:="秦港股份SS"
    .Add Item:="r_hk03369", Key:="秦港股份HK"
    '--------------------------------------------铁路公路
    .Add Item:="sh601333", Key:="广深铁路SS"
    .Add Item:="r_hk00525", Key:="广深铁路HK"
    .Add Item:="sh600377", Key:="宁沪高速SS"
    .Add Item:="r_hk00177", Key:="宁沪高速HK"
    .Add Item:="sh600012", Key:="皖通高速SS"
    .Add Item:="r_hk00995", Key:="皖通高速HK"
    .Add Item:="sh601107", Key:="四川成渝SS"
    .Add Item:="r_hk00107", Key:="四川成渝HK"
    .Add Item:="sh600548", Key:="深高速SS"
    .Add Item:="r_hk00548", Key:="深高速HK"
    '--------------------------------------------医药
    .Add Item:="sh600196", Key:="复星医药SS"
    .Add Item:="r_hk02196", Key:="复星医药HK"
    .Add Item:="sh601607", Key:="上海医药SS"
    .Add Item:="r_hk02607", Key:="上海医药HK"
    .Add Item:="sz000756", Key:="新华制药SS"
    .Add Item:="r_hk00719", Key:="新华制药HK"
    .Add Item:="sz000513", Key:="丽珠集团SS"
    .Add Item:="r_hk01513", Key:="丽珠集团HK"
    '--------------------------------------------食品饮料
    .Add Item:="sh600600", Key:="青岛啤酒SS"
    .Add Item:="r_hk00168", Key:="青岛啤酒HK"
    '--------------------------------------------其他
    .Add Item:="sz000921", Key:="海信科龙SS"
    .Add Item:="r_hk00921", Key:="海信科龙HK"
    .Add Item:="sh600775", Key:="南京熊猫SS"
    .Add Item:="r_hk00553", Key:="南京熊猫HK"
    .Add Item:="sh600635", Key:="大众公用SS"
    .Add Item:="r_hk01635", Key:="大众公用HK"
    .Add Item:="sh601811", Key:="新华文轩SS"
    .Add Item:="r_hk00811", Key:="新华文轩HK"
    .Add Item:="sh600874", Key:="创业环保SS"
    .Add Item:="r_hk01065", Key:="创业环保HK"
    .Add Item:="sz002703", Key:="浙江世宝SS"
    .Add Item:="r_hk01057", Key:="浙江世宝HK"
    .Add Item:="sz002672", Key:="东江环保SS"
    .Add Item:="r_hk00895", Key:="东江环保HK"
    .Add Item:="sh600860", Key:="*ST京城SS"
    .Add Item:="r_hk00187", Key:="*ST京城HK"
    .Add Item:="sz002490", Key:="*ST墨龙SS"
    .Add Item:="r_hk00568", Key:="*ST墨龙HK"
End With
'========================================================================================
'查询信息
'========================================================================================
    Dim 元素计数 As Integer
    Dim aQUO() As Variant
    ReDim aQUO(COLLAH.Count, 3) As Variant
    '------------------------------------------------------------------------------------
    Dim CIDL As String
    Dim nRESP As Integer
    Dim aRESP As Variant
    '------------------------------------------------------------------------------------
    On Error Resume Next
    For 元素计数 = 1 To COLLAH.Count
        '--------------------------------------------------------------------------------
        '查询信息
        '--------------------------------------------------------------------------------
        CIDL = COLLAH(元素计数)
        nRESP = UBHTTP腾实_查回组(aRESP, CIDL)
        If nRESP > 0 Then
            aQUO(元素计数, 0) = aRESP(位序腾实代码)
            aQUO(元素计数, 1) = aRESP(位序腾实代称)
            aQUO(元素计数, 2) = aRESP(位序腾实今涨)
            aQUO(元素计数, 3) = aRESP(位序腾实今收)
            Erase aRESP
       End If
        '--------------------------------------------------------------------------------
    Next
'========================================================================================
'列设置
'========================================================================================
    Dim 列AH对H股代码 As Integer
    Dim 列AH对H股代称 As Integer
    Dim 列AH对H股涨幅 As Integer
    Dim 列AH对H股价格 As Integer
    Dim 列AH对A股溢价 As Integer
    Dim 列AH对A股异步 As Integer
    Dim 列AH对A股价格 As Integer
    Dim 列AH对A股涨幅 As Integer
    Dim 列AH对A股代称 As Integer
    Dim 列AH对A股代码 As Integer
    Dim 列AH对总列数 As Integer
    列AH对H股代码 = 0
    列AH对H股代称 = 1
    列AH对H股涨幅 = 2
    列AH对H股价格 = 3
    列AH对A股溢价 = 4
    列AH对A股异步 = 5
    列AH对A股价格 = 6
    列AH对A股涨幅 = 7
    列AH对A股代称 = 8
    列AH对A股代码 = 9
    列AH对总列数 = 9
'========================================================================================
'填写信息
'========================================================================================
    Dim 代码对计数 As Integer
    Dim IDSS As Integer
    Dim IDHK As Integer
    Dim ROWID As Integer
    ROWID = 1
            
    For 代码对计数 = 1 To COLLAH.Count / 2
        '--------------------------------------------------------------------------------
        '提取信息
        '--------------------------------------------------------------------------------
        ROWID = 始行 + 代码对计数
        IDSS = 2 * 代码对计数 - 1
        IDHK = 2 * 代码对计数
        '--------------------------------------------------------------------------------
        With MS.Cells(ROWID, 始列)
                '------------------------------------------------------------------------
                .Offset(0, 列AH对H股代码) = "HK" & Format(aQUO(IDHK, 0), "0000")
                .Offset(0, 列AH对H股代称) = aQUO(IDHK, 1)
                .Offset(0, 列AH对H股涨幅) = CDbl(aQUO(IDHK, 2))
                .Offset(0, 列AH对H股价格) = CDbl(aQUO(IDHK, 3))
                
                .Offset(0, 列AH对A股价格) = CDbl(aQUO(IDSS, 3))
                .Offset(0, 列AH对A股涨幅) = CDbl(aQUO(IDSS, 2))
                .Offset(0, 列AH对A股代称) = aQUO(IDSS, 1)
                .Offset(0, 列AH对A股代码) = UBCID规制代码(aQUO(IDSS, 0))
                '------------------------------------------------------------------------
                .Offset(0, 列AH对A股溢价) = 100 * (.Offset(0, 列AH对H股价格) * 常汇率港币) / .Offset(0, 列AH对A股价格) - 100
                If .Offset(0, 列AH对H股涨幅) >= 0 Then
                    If .Offset(0, 列AH对A股涨幅) >= 0 Then
                        .Offset(0, 列AH对A股异步) = "同涨"
                    Else
                        .Offset(0, 列AH对A股异步) = "H涨A跌"
                    End If
                Else
                    If .Offset(0, 列AH对A股涨幅) >= 0 Then
                        .Offset(0, 列AH对A股异步) = "H跌A涨"
                    Else
                        .Offset(0, 列AH对A股异步) = "同跌"
                    End If
                End If
                '------------------------------------------------------------------------
                With .Offset(0, 列AH对H股代码)
                    .Interior.TintAndShade = -0.8
                    .Font.Color = .Interior.Color
                End With
                With .Offset(0, 列AH对A股代码)
                    .Interior.TintAndShade = -0.8
                    .Font.Color = .Interior.Color
                End With
                With .Offset(0, 列AH对H股代称)
                    .Interior.TintAndShade = -0.3
                End With
                With .Offset(0, 列AH对A股代称)
                    .Interior.TintAndShade = -0.3
                End With
                With .Offset(0, 列AH对H股涨幅)
                    .Interior.TintAndShade = IIf(.Value >= 0, 0.2, -0.1)
                End With
                With .Offset(0, 列AH对A股涨幅)
                    .Interior.TintAndShade = IIf(.Value >= 0, 0.2, -0.1)
                End With
'                With .Offset(0, 列AH对H股价格)
'                    .Interior.TintAndShade = -0.6
'                    .Font.Color = .Interior.Color
'                End With
'                With .Offset(0, 列AH对A股价格)
'                    .Interior.TintAndShade = -0.6
'                    .Font.Color = .Interior.Color
'                End With
                With .Offset(0, 列AH对A股溢价)
                    .Interior.TintAndShade = -0.2
                End With
                '------------------------------------------------------------------------
                With .Offset(0, 列AH对A股异步)
                    If .Value = "H涨A跌" Then
                        .Interior.ColorIndex = 43
                    ElseIf .Value = "H跌A涨" Then
                        .Interior.ColorIndex = 44
                    ElseIf .Value = "同涨" Then
                        .Interior.ColorIndex = 36
                    Else
                        .Interior.ColorIndex = 35
                    End If
                End With
                '------------------------------------------------------------------------
        End With
        '--------------------------------------------------------------------------------
    Next
    '------------------------------------------------------------------------------------
    Set COLLAH = Nothing
    Erase aQUO
    On Error GoTo 0
'========================================================================================
'格式化
'========================================================================================
    With MS
        '--------------------------------------------------------------------------------
        '列格式
        .Columns(始列 + 列AH对H股代码).ColumnWidth = 6
        .Columns(始列 + 列AH对A股代码).ColumnWidth = 10
        .Columns(始列 + 列AH对H股代称).ColumnWidth = 16
        .Columns(始列 + 列AH对H股代称).HorizontalAlignment = xlRight
        .Columns(始列 + 列AH对A股代称).ColumnWidth = 9
        .Columns(始列 + 列AH对H股涨幅).NumberFormatLocal = 全设格式of一位
        .Columns(始列 + 列AH对H股涨幅).ColumnWidth = 6
        .Columns(始列 + 列AH对A股涨幅).NumberFormatLocal = 全设格式of一位
        .Columns(始列 + 列AH对A股涨幅).ColumnWidth = 6
        .Columns(始列 + 列AH对H股价格).NumberFormatLocal = 全设格式of零位
        .Columns(始列 + 列AH对H股价格).ColumnWidth = 5
        .Columns(始列 + 列AH对A股价格).NumberFormatLocal = 全设格式of零位
        .Columns(始列 + 列AH对A股价格).ColumnWidth = 5
        .Columns(始列 + 列AH对A股溢价).NumberFormatLocal = 全设格式of零位
        .Columns(始列 + 列AH对A股溢价).ColumnWidth = 5
        .Columns(始列 + 列AH对A股溢价).HorizontalAlignment = xlCenter
        .Columns(始列 + 列AH对A股异步).ColumnWidth = 7
        .Columns(始列 + 列AH对A股异步).HorizontalAlignment = xlCenter
        '--------------------------------------------------------------------------------
        '首行
        .Cells(始行, 始列).Cells(1, 1 + 列AH对H股代码) = "H代码"
        .Cells(始行, 始列).Cells(1, 1 + 列AH对H股代称) = "H名称"
        .Cells(始行, 始列).Cells(1, 1 + 列AH对H股涨幅) = "H涨幅"
        .Cells(始行, 始列).Cells(1, 1 + 列AH对H股价格) = "H价"
        .Cells(始行, 始列).Cells(1, 1 + 列AH对A股价格) = "A价"
        .Cells(始行, 始列).Cells(1, 1 + 列AH对A股涨幅) = "A涨幅"
        .Cells(始行, 始列).Cells(1, 1 + 列AH对A股代称) = "A名称"
        .Cells(始行, 始列).Cells(1, 1 + 列AH对A股代码) = "A代码"
        .Cells(始行, 始列).Cells(1, 1 + 列AH对A股溢价) = "溢[A-H]%"
        .Cells(始行, 始列).Cells(1, 1 + 列AH对A股异步) = "异步"
        With .Cells(始行, 始列).Resize(1, 列AH对总列数)
            .Font.Bold = True
            .Font.Color = 常色主黑
        End With
'        .Cells(始行, 始列).Resize(1, 列AH对A股溢价).HorizontalAlignment = xlRight
        '--------------------------------------------------------------------------------
        '列显示
        .Columns(始列 + 列AH对H股代码).Hidden = True
        .Columns(始列 + 列AH对A股代码).Hidden = True
        .Columns(始列 + 列AH对H股价格).Hidden = True
        .Columns(始列 + 列AH对A股价格).Hidden = True
        '--------------------------------------------------------------------------------
    End With
'========================================================================================
    现市特程_HK_中港AH对比 = 始列 + 列AH对总列数 + 1
'========================================================================================
End Function






