Attribute VB_Name = "WMR现市_F2美股"
'========================================================================================
'========================================================================================
'调用：美股
'========================================================================================
'========================================================================================
Function 现市基程_市场美国( _
          MS As Worksheet _
        , Optional 是否排序 As XlSortOrder = xlDescending _
        , Optional 始行 As Integer = 3 _
        , Optional 始列 As Integer = 1 _
        ) As Boolean
'========================================================================================
'页面格式设置
'========================================================================================
    MS.Cells.Font.Size = 10
    MS.Columns.ColumnWidth = 2
    '------------------------------------------------------------------------------------
    MS.Cells(始行, 始行 + 1) = "芥蓝"
    MS.Columns(始行 + 1).ColumnWidth = 13
    MS.Columns(始行 + 2).ColumnWidth = 6
    MS.Columns(始行 + 3).ColumnWidth = 5
    MS.Columns(始行 + 3).Hidden = True
    '------------------------------------------------------------------------------------
    始列 = 始行 + 5
'========================================================================================
'按分类：跨市场品类
'========================================================================================
    Call 现市特程_US_行业(MS, 始行, 始列, True)
'========================================================================================
'ETF类
'========================================================================================
    始列 = 现市分程US_ETF类群(MS, PBASE格程工具_表参末行指定(MS, 始列) + 5, 始列)
'========================================================================================
'分类展示
'========================================================================================
    '始列 = 现市分程US_道琼斯板块(MS, 始行, 始列 + 3, 是否排序)
    '------------------------------------------------------------------------------------
    始列 = 现市分程US_成分_中概股系列(MS, 始行, 始列 + 2, 是否排序)
    '------------------------------------------------------------------------------------
    始列 = 现市分程US_成分_美行业板块(MS, 始行, 始列 + 1, 是否排序)
'========================================================================================
'页面格式设置
'========================================================================================
    With MS.Rows(始行)
        .Font.Bold = True
        .HorizontalAlignment = xlLeft
        .Borders(xlEdgeBottom).Weight = xlThin
    End With
    '------------------------------------------------------------------------------------
    MS.Activate
    Call PBASE格程工具_表冻结锁定(MS, 始行)
'========================================================================================
End Function






'========================================================================================
'========================================================================================
'板块知名企业
'========================================================================================
'========================================================================================
Function 现市分程US_成分_美行业板块(MS As Worksheet, 始行 As Integer, 始列 As Integer, Optional 是否排序 As XlSortOrder = xlDescending) As Integer
    MS.Cells(始行, 始列).Cells(1, 位简式名称) = "行业知名公司"
    '------------------------------------------------------------------------------------
    Dim 目行 As Integer
    Dim 目列 As Integer
    目行 = 始行 + 1
    目列 = 始列
    Dim 码市 As String
    码市 = "US"
    Dim 码指 As String
    Dim 码组
'========================================================================================
    '------------------------------------------------------------------------------------
    码指 = "美七姐妹"
    码组 = Array( _
          "AAPL", "GOOGL", "GOOG", "META", "AMZN", "NVDA", "MSFT", "TSLA")
    目列 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序)
    Erase 码组
    '------------------------------------------------------------------------------------
'    码指 = "美科技消费类"
'    码组 = Array( _
'           "GME", "RDDT", "SPOT", "DJT", "DASH", "SNAP", "NBIS", "MELI", "SE", "RBLX", "VZ", "T")
'    目列 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序)
'    Erase 码组
'    '------------------------------------------------------------------------------------
    码指 = "美芯片类"
    码组 = Array( _
        "AMAT", "ASML", "LRCX", "TER", "AVGO", "AMD", "MU", "MRVL", "QCOM", "INTC", "ARM", "ALAB", "MPWR", "MCHP", "WKEY", "LAES", "ON", "CRDO", "APH")
    目列 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序)
    Erase 码组
    '------------------------------------------------------------------------------------
    码指 = "美软件类"
    码组 = Array( _
        "SMCI", "RGTI", "IONQ", "ANET", "QUBT", "QBTS", "DELL", "RCAT", "PSTG", "MSTR", "SOUN", "APP", "UBER", "CRM", "NOW", "WDAY", "SNOW", "SHOP", "CDNS", "AI", "TTD", "DOCU", "DDOG", "BTDR", "U", "ASAN", "DUOL", "ZM", "PLTR", "ADBE", "CRWD", "ORCL", "PANW", "MDB", "SNPS", "SQ", "AFRM", "FTNT", "TWLO", "OKTA", "RBRK", "ZS", "NET")
    目列 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序)
    Erase 码组
    '------------------------------------------------------------------------------------
    码指 = "美制造类"
    码组 = Array( _
         "BA", "GE", "AXON", "SIDU", "LMT", "ACHR", "RKLB", "RTX", "UAL", "AAL", "GEV", "CEG", "VST", "XPO", "IBM", "ACN", "APLD", "CSCO", "CIEN", "FSLR", "XOM", "CVX", "OXY", "DVN", "GOLD", "F", "RIVN", "GM", "CVNA", "HON", "MMM", "VALE", "CAT", "DOW", "O", "VRT")
    目列 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序)
    Erase 码组
    '------------------------------------------------------------------------------------
    码指 = "美金融类"
    码组 = Array( _
          "JPM", "BAC", "C", "NU", "MARA", "HOOD", "GS", "RIOT", "MS", "CLSK", "HUT", "WULF", "V", "MA", "SOFI", "PYPL", "UPST", "COIN", "MSCI")
    目列 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序)
    Erase 码组
    '------------------------------------------------------------------------------------
    码指 = "美消费类"
    码组 = Array( _
        "COST", "WMT", "TGT", "NFLX", "DIS", "KO", "PEP", "CELH", "PM", "MO", "NKE", "ABNB", "RCL", "CCL", "PG", "EL", "HIMS", "LULU", "SBUX", "MCD", "UPS", "FDX")
    目列 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序)
    Erase 码组
    '------------------------------------------------------------------------------------
    码指 = "美生物类"
    码组 = Array( _
        "TNXP", "MRNA", "WBA", "ISRG", "UNH", "CVS", "LLY", "JNJ", "MRK", "PFE", "NVO", "ILMN")
    目列 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序)
    Erase 码组
'========================================================================================
    现市分程US_成分_美行业板块 = 目列
End Function









'========================================================================================
'========================================================================================
'美国中国概念系列
'========================================================================================
'========================================================================================
Function 现市分程US_成分_中概股系列(MS As Worksheet, 始行 As Integer, 始列 As Integer, Optional 是否排序 As XlSortOrder = xlDescending) As Integer
    MS.Cells(始行, 始列).Cells(1, 位简式名称) = "中概股系列"
    '------------------------------------------------------------------------------------
    Dim 目行 As Integer
    Dim 目列 As Integer
    目行 = 始行 + 1
    目列 = 始列
    Dim 码市 As String
    码市 = "US"
    Dim 码指 As String
    Dim 码组
'========================================================================================
    '------------------------------------------------------------------------------------
    码指 = "中概互联网"
    码组 = Array( _
          "BILI", "NTES", "SOHU", "BHAT", "GIGM", "CHT", "UCL" _
          , "PDD", "BABA", "JD", "VIPS", "YJ", "RERE", "DADA", "BZUN", "WNW", "ZKH" _
          , "LITB", "OCG", "JWEL", "MOGU", "TCOM", "TOUR", "BIDU", "TME", "BZ", "YY" _
          , "WB", "MOMO", "ATHM", "ZH", "TC", "NAMI", "DOYU", "JFIN", "CMCM", "CCG", "FENG", "BEKE", "DUO", "UK" _
          , "IQ", "HUYA", "KUKE", "CPOP", , "DIDIY")
    目列 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序)
    Erase 码组
    '------------------------------------------------------------------------------------
    码指 = "中概教育"
    码组 = Array( _
          "EDU", "TAL", "GOTU", "DAO", "COE", "YQ", "QSG", "BEDU", "FEDU", "AMBO", "WAFU", "IH", "STG", "CLEU", "EDTK", "AACG", "LXEH")
    目列 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序)
    Erase 码组
    '------------------------------------------------------------------------------------
    码指 = "中概互金"
    码组 = Array( _
          "NOAH", "PWM", "FUTU", "TIGR", "NCTY", "SOS", "MFH", "MEGL", "TOP", "GSIW", "ATIF", "ROMA" _
          , "QFIN", "LX", "LU", "FINV", "QD", "YRD", "XYF", "SNTG", "PT", "AIHS", "BTOG", "HUIZ", "ZBAO", "TIRX", "WDH", "CNF")
    目列 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序)
    Erase 码组
    '------------------------------------------------------------------------------------
    码指 = "中概汽车"
    码组 = Array( _
          "NIO", "XPEV", "LI", "ZK", "NIU", "LOT", "CYD", "AIEV", "LOBO", "HSAI", "CAAS", "KNDI", "JZXN", "CANG", "UCAR", "KXIN", "UXIN", "AZI")
    目列 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序)
    Erase 码组
    '------------------------------------------------------------------------------------
    码指 = "中概电子"
    码组 = Array( _
          "DQ", "TSM", "UMC", "ASX", "SIMO", "HIMX", "NA", "ICG", "HOLO", "OST", "DSWL", "IZM", "CBAT", "RAYA", "EPOW", "AGMH", "EBON", "YIBO", "FEBO", "ZEPP", "UTSI")
    目列 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序)
    Erase 码组
    '------------------------------------------------------------------------------------
    码指 = "中概医药"
    码组 = Array( _
          "CCM", "MHUA", "ZJYL", "PTHL", "YI", "AHG", "UPC", "HCM", "SXTC", "RGC", "CPHI" _
          , "ZCMD", "SY", "BGNE", "LEGN", "ZLAB", "ADAG", "IMAB", "BYSI", "APM", "CNTB", "BNR", "CJJD")
    目列 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序)
    Erase 码组
    '------------------------------------------------------------------------------------
    码指 = "中概软件信息"
    码组 = Array( _
          "GDS", "VNET", "BTCM", "JDZG", "JFU", "CLPS", "JZ" _
          , "YMM", "KC", "API", "WCT", "HKD", "MTC", "TROO", "AIXI", "FRGT", "FTFT", "IFBD", "HKIT" _
          , "LGCL", "XTKG", "RTC", "OCFT", "YXT", "QH", "MFI", "GCT", "TUYA", "UBXG", "XNET", "DTSS", "TAOP", "JG" _
          , "STFS", "WIMI", "HAO", "ICLK", "BAOS", "CHR", "LKCO", "CNET", "KRKR", "ANTE")
    目列 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序)
    Erase 码组
    '------------------------------------------------------------------------------------
    码指 = "中概工业"
    码组 = Array( _
          "TSL", "JASO", "CLNT", "CLWT", "CHNR", "CNEY", "BON", "ZJK", "XCH", "LBGJ", "HUHU", "GTEC", "JKS", "CSIQ", "SOL" _
          , "SPI", "RCON", "WRD", "EHGO", "PLAG", "GRFX", "SEED", "SISI", "NWGL", "MTEN", "HIHO" _
          , "AEHL", "RETO", "YSG", "TANH", "DSY", "VIOT", "GURE", "EH", "MGIH", "XIN", "SUGP" _
          , "CREG", "BEST", "YGMZ", "WLGS", "RITR", "JUNE" _
          , "HLP", "ZKIN", "HUDI", "JL", "CDTG")
    目列 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序)
    Erase 码组
    '------------------------------------------------------------------------------------
    码指 = "中概服务"
    码组 = Array( _
          "ZTO", "JYD", "SFWL", "ATXG", "LICN", "NISN", "MNSO", "PTLE", "CGTL", "NAAS", "BQ", "DDL" _
          , "HTHT", "ATAT", "GHG", "ITP", "RLX", "GLXG" _
          , "MLCO", "MSC" _
          , "EJH", "EM", "LKNCY", "YUMC", "CHSN", "PETZ", "ORIS", "WYHG", "FAMI", "PAVS", "DDC" _
          , "EZGO", "AS", "DOGZ", "GDHG")
    目列 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序)
    Erase 码组
    '------------------------------------------------------------------------------------
    码指 = "港股ADR"
    码组 = Array( _
          "HSBC", "LFC", "PTR", "SNP", "CEO", "SHI", "CHA" _
        , "CHL", "CHU", "ZNH", "CEA", "GSH", "ACH", "HNP" _
        , "SMI", "LKNCY", "TCEHY", "DIDIY", "XIACY", "MPNGY")
    目列 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序)
    Erase 码组
'========================================================================================
    现市分程US_成分_中概股系列 = 目列
End Function





'========================================================================================
'========================================================================================
'ETF系列
'========================================================================================
'========================================================================================
Function 现市分程US_ETF类群(MS As Worksheet, 始行 As Integer, 始列 As Integer, Optional 是否排序 As XlSortOrder = False) As Integer
    With MS.Cells(始行, 始列).Cells(1, 位简式名称)
        .Value = "美股ETF类群"
        .Font.Bold = True
    End With
    '------------------------------------------------------------------------------------
    Dim 目行 As Integer
    Dim 目列 As Integer
    目行 = 始行 + 1
    目列 = 始列
    Dim 码市 As String
    码市 = "US"
    Dim 码指 As String
    Dim 码组
'========================================================================================
'中国市场ETF
'========================================================================================
    With MS.Cells(目行, 始列).Cells(1, 位简式名称)
        .Value = "美国中概股ETF群"
        .Font.Bold = True
    End With
    目行 = 目行 + 1
    '====================================================================================
    码指 = "中国大盘指数ETF"
    码组 = Array("FXI", "ASHR", "MCHI", "CN", "CAF", "ASHS", "ECNS", "CNXT")
    目行 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序, 是否返列:=False)
    Erase 码组
    '------------------------------------------------------------------------------------
    码指 = "中国行业ETF"
    码组 = Array("CHIX", "CQQQ", "CHIM", "CHIE", "CHII", "CHIQ")
    目行 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序, 是否返列:=False)
    Erase 码组
    '------------------------------------------------------------------------------------
    码指 = "中国杠杆/反向"
    码组 = Array("YINN", "YANG", "XPP", "YXI", "FXP", "CHAU")
    目行 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序, 是否返列:=False)
    Erase 码组
    '------------------------------------------------------------------------------------
    码指 = "中国其他指数ETF"
    码组 = Array("FCA", "GXC", "CXSE", "KBA", "KFYP")
    目行 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序, 是否返列:=False)
    Erase 码组
    '------------------------------------------------------------------------------------
    码指 = "中国&新兴市场"
    码组 = Array("EWH", "PGJ", "KWEB")
    目行 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序, 是否返列:=False)
    Erase 码组
    '------------------------------------------------------------------------------------
'========================================================================================
'按分类：指数
'========================================================================================
    目行 = 目行 + 2
    With MS.Cells(目行, 始列).Cells(1, 位简式名称)
        .Value = "美国股市ETF群"
        .Font.Bold = True
    End With
    目行 = 目行 + 1
    '====================================================================================
    码指 = "恐慌指数"
    码组 = Array("VXX", "VXZ", "UVXY", "TVIX")
    目行 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序, 是否返列:=False)
    Erase 码组
    '------------------------------------------------------------------------------------
    码指 = "标普500"
    码组 = Array("SPY", "SSO", "UPRO", "SH", "SDS", "SPXU")
    目行 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序, 是否返列:=False)
    Erase 码组
    '------------------------------------------------------------------------------------
    码指 = "道琼斯"
    码组 = Array("DIA", "DDM", "UDOW", "DOG", "DXD", "SDOW")
    目行 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序, 是否返列:=False)
    Erase 码组
    '------------------------------------------------------------------------------------
    码指 = "纳斯达克100"
    码组 = Array("QQQ", "QLD", "TQQQ", "PSQ", "QID", "SQQQ")
    目行 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序, 是否返列:=False)
    Erase 码组
    '------------------------------------------------------------------------------------
    码指 = "中盘股"
    码组 = Array("MDY", "MVV", "MIDU", "MYY", "MZZ")
    目行 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序, 是否返列:=False)
    Erase 码组
    '------------------------------------------------------------------------------------
    码指 = "罗素2000"
    码组 = Array("IWM", "UWM", "TNA", "RWM", "TWM", "TZA")
    目行 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序, 是否返列:=False)
    Erase 码组
    '------------------------------------------------------------------------------------
    码指 = "美国国债指数"
    码组 = Array("TLT", "TBF", "UBT", "TBT", "TMF", "TMV")
    目行 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序, 是否返列:=False)
    Erase 码组
'========================================================================================
'按分类：行业
'========================================================================================
    目行 = 目行 + 2
    With MS.Cells(目行, 始列).Cells(1, 位简式名称)
        .Value = "美国行业ETF群"
        .Font.Bold = True
    End With
    目行 = 目行 + 1
    '====================================================================================
    码指 = "金融指数"
    码组 = Array("XLF", "IYF", "KBE", "SEF", "UYG", "SKF", "FAS", "FAZ")
    目行 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序, 是否返列:=False)
    Erase 码组
    '------------------------------------------------------------------------------------
    码指 = "房地产指数"
    码组 = Array("IYR", "VNQ", "REK", "URE", "SRS", "DRN", "DRV")
    目行 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序, 是否返列:=False)
    Erase 码组
    '------------------------------------------------------------------------------------
    码指 = "科技指数"
    码组 = Array("QQQ", "QLD", "TQQQ", "PSQ", "QID", "SQQQ")
    目行 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序, 是否返列:=False)
    Erase 码组
    '------------------------------------------------------------------------------------
    码指 = "半导体指数"
    码组 = Array("SMH", "USD", "SSG", "SOXL", "SOXS")
    目行 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序, 是否返列:=False)
    Erase 码组
    '------------------------------------------------------------------------------------
    码指 = "工业指数"
    码组 = Array("XLI")
    目行 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序, 是否返列:=False)
    Erase 码组
    '------------------------------------------------------------------------------------
    码指 = "能源指数"
    码组 = Array("XLE", "XOP", "DUG", "ERX", "ERY")
    目行 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序, 是否返列:=False)
    Erase 码组
    '------------------------------------------------------------------------------------
    码指 = "原材料指数"
    码组 = Array("XLB", "IYM", "UYM", "SMN")
    目行 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序, 是否返列:=False)
    Erase 码组
    '------------------------------------------------------------------------------------
    码指 = "黄金&矿业"
    码组 = Array("GDX", "GDXJ", "NUGT", "DUST")
    目行 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序, 是否返列:=False)
    Erase 码组
'========================================================================================
'按分类：商品与外汇
'========================================================================================
    目行 = 目行 + 2
    With MS.Cells(目行, 始列).Cells(1, 位简式名称)
        .Value = "商品&外汇ETF群"
        .Font.Bold = True
    End With
    目行 = 目行 + 1
    '====================================================================================
    码指 = "商品@石油"
    码组 = Array("USO", "UCO", "SCO")
    目行 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序, 是否返列:=False)
    Erase 码组
    '------------------------------------------------------------------------------------
    码指 = "商品@黄金"
    码组 = Array("GLD", "SLV", "IAU", "DGZ", "DGP", "dBB")
    目行 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序, 是否返列:=False)
    Erase 码组
    '------------------------------------------------------------------------------------
    码指 = "货币"
    码组 = Array( _
        "UUP", "UDN" _
        , "CYB" _
        , "FXE", "FXB", "FXY", "FXF", "FXC", "FXA")
    目行 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序, 是否返列:=False)
    Erase 码组
'========================================================================================
'全球市场ETF
'========================================================================================
    目行 = 目行 + 2
    With MS.Cells(目行, 始列).Cells(1, 位简式名称)
        .Value = "全球股市ETF群"
        .Font.Bold = True
    End With
    目行 = 目行 + 1
    '====================================================================================
    码指 = "新兴市场"
    码组 = Array("EEM", "EUM", "VWO", "EET", "EEV", "EDC", "EDZ")
    目行 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序, 是否返列:=False)
    Erase 码组
    '------------------------------------------------------------------------------------
    码指 = "欧洲市场"
    码组 = Array("VGK", "EZU", "EWG", "EWU")
    目行 = 查程同市码组(码市, 码指, 码组, MS, 目行, 目列, 是否排序, 是否返列:=False)
    Erase 码组
'========================================================================================
    现市分程US_ETF类群 = 目列 + 4
    '------------------------------------------------------------------------------------
    MS.Columns(始列).Columns(位简式名称).ColumnWidth = 50
    MS.Columns(始列).Columns(位简式名称).HorizontalAlignment = xlRight
    MS.Columns(始列).Columns(位简式涨幅).ColumnWidth = 6
End Function





