Attribute VB_Name = "IQQQ跨码_P展擎2频谱"
Public Const 常频块目列代称 = 1
Public Const 常频块目列定色变量 = 2
Public Const 常频块目列日类涨幅 = 3
Public Const 常频块目列日类高幅 = 4
Public Const 常频块目列日类低幅 = 5
Public Const 常频块目列代码 = 6
Public Const 常频块目列宽数 = 6
'--------------------------
Public Const 常频头列标组之名 = 1
Public Const 常频头列标类之名 = 2
Public Const 常频头列均高幅 = 3
Public Const 常频头列均涨幅 = 4
Public Const 常频头列均低幅 = 5
Public Const 常频头列比涨身 = 6
Public Const 常频头列数涨停 = 7
Public Const 常频头列标类之数 = 8
Public Const 常频头列列偏 = 8
'--------------------------
Public Const 常频头行标组之名 = 1
Public Const 常频头行标类之名 = 2
Public Const 常频头行再类之数 = 3
Public Const 常频头行再类之名 = 4
Public Const 常频头行总数 = 4
'--------------------------


'========================================================================================
'========================================================================================
'QQQ：设置分析项目
'========================================================================================
'========================================================================================
Function IQQQ展擎频谱输出分程( _
          ByRef wb As Workbook _
        , ByRef 谕组 As Variant _
        , Optional ByVal 参of筛频谱日类 As Boolean = False _
        , Optional ByVal 实结类型 As String = "cCCC" _
        ) As String
'========================================================================================
    Dim MSG As String
    Dim 频谱注释 As String
    Dim 频谱表名 As String
'========================================================================================
'参数设置
'========================================================================================
    '------------------------------------------------------------------------------------
    '设置字典：市板
    '------------------------------------------------------------------------------------
    Dim 集典市板 As New Dictionary
    集典市板.Add Item:=常市板票Qif, Key:=常市板票Qif
    集典市板.Add Item:=常市板票Qic, Key:=常市板票Qic
    集典市板.Add Item:=常市板票Qim, Key:=常市板票Qim
    集典市板.Add Item:=常市板票Qit, Key:=常市板票Qit
    集典市板.Add Item:=常市板票Qin, Key:=常市板票Qin
    集典市板.Add Item:=常市板票Qst, Key:=常市板票Qst
    集典市板.Add Item:=常市板基, Key:=常市板基
    '------------------------------------------------------------------------------------
    '设置字典：仓周类 全部
    '------------------------------------------------------------------------------------
    Dim 集典仓周类全 As New Dictionary
    集典仓周类全.Add Item:="唏", Key:="唏[abcryz]"
    集典仓周类全.Add Item:="银", Key:="银[abcryz]"
    集典仓周类全.Add Item:="金B", Key:="金[abr]"
    集典仓周类全.Add Item:="金X", Key:="金[cyz]"
    集典仓周类全.Add Item:="嘘", Key:="嘘[abcryz]"
    集典仓周类全.Add Item:="尿", Key:="尿[abcryz]"
    集典仓周类全.Add Item:="屎", Key:="屎[abcryz]"
    '------------------------------------------------------------------------------------
    '设置字典：仓日类 全部
    '------------------------------------------------------------------------------------
    Dim 集典仓日类全 As New Dictionary
    集典仓日类全.Add Item:="无", Key:="无"
    集典仓日类全.Add Item:="忑", Key:="忑[abcryz]"
    集典仓日类全.Add Item:="忠", Key:="忠[abcryz]"
    集典仓日类全.Add Item:="忐", Key:="忐[abcryz]"
    集典仓日类全.Add Item:="上B", Key:="上[abr]"
    集典仓日类全.Add Item:="上X", Key:="上[cyz]"
    集典仓日类全.Add Item:="中B", Key:="中[abr]"
    集典仓日类全.Add Item:="中X", Key:="中[cyz]"
    集典仓日类全.Add Item:="下", Key:="下[abcryz]"
'========================================================================================
'分布：概念益盟 * 集典仓日类全
'========================================================================================
    频谱注释 = "概念益盟 * 仓周类" & vbCrLf & 实结类型
    频谱表名 = 常簿缀频谱 & "概周"
    MSG = MSG & IQQQ展擎频谱输出基程(频谱注释, 频谱表名, 位qt概念, UTL族群引擎_概念益盟(是否含略:=False), 位谕of仓周类, 集典仓周类全, 谕组, wb)
    wb.Sheets(频谱表名).Columns(常频头列标类之名).ColumnWidth = 25
    '------------------------------------------------------------------------------------
    频谱注释 = "概念益盟 * 仓日类" & vbCrLf & 实结类型
    频谱表名 = 常簿缀频谱 & "概日"
    MSG = MSG & IQQQ展擎频谱输出基程(频谱注释, 频谱表名, 位qt概念, UTL族群引擎_概念益盟(是否含略:=False), 位谕of仓日类, 集典仓日类全, 谕组, wb)
    wb.Sheets(频谱表名).Columns(常频头列标类之名).ColumnWidth = 25
'========================================================================================
'分布：行业益盟 * 集典仓日类全
'========================================================================================
    '------------------------------------------------------------------------------------
    频谱注释 = "行业益盟 * 仓周类" & vbCrLf & 实结类型
    频谱表名 = 常簿缀频谱 & "行周"
    MSG = MSG & IQQQ展擎频谱输出基程(频谱注释, 频谱表名, 位qt行益, UTL族群引擎_行业益盟(), 位谕of仓周类, 集典仓周类全, 谕组, wb)
    '------------------------------------------------------------------------------------
    频谱注释 = "行业益盟 * 仓日类" & vbCrLf & 实结类型
    频谱表名 = 常簿缀频谱 & "行日"
    MSG = MSG & IQQQ展擎频谱输出基程(频谱注释, 频谱表名, 位qt行益, UTL族群引擎_行业益盟(), 位谕of仓日类, 集典仓日类全, 谕组, wb)
'========================================================================================
'返回
'========================================================================================
    Set 集典市板 = Nothing
    Set 集典仓周类全 = Nothing
    Set 集典仓周类全 = Nothing
    '------------------------------------------------------------------------------------
    IQQQ展擎频谱输出分程 = MSG
'========================================================================================
End Function






'增加超链接 指向 具体数据
'========================================================================================
'========================================================================================
'QQQ：按照【周期*指标】进行分列
'标类：交叉表的左列，主要为列举类，用instr进行可相容分类
'再类：交叉表的右列，主要为趋势类，用like进行不相容分类
'========================================================================================
'========================================================================================
Function IQQQ展擎频谱输出基程( _
          ByVal 频谱注释 As String _
        , ByVal 频谱表名 As String _
        , ByVal 严选标类定位 As Integer _
        , ByRef 组标类 As Variant _
        , ByVal 严选再类定位 As Integer _
        , ByRef 集合再类 As Dictionary _
        , ByRef 谕组 As Variant _
        , ByRef wb As Workbook _
        , Optional ByVal 基色底 As Long = 常色主碧 _
        ) As String
'========================================================================================
'设置工表
'========================================================================================
    Dim WSTO As Worksheet
    Call PBASE格程工具_表操工表新增(WSTO, 频谱表名, wb:=wb, 基色底:=基色底)
    '------------------------------------------------------------------------------------
    WSTO.Cells.Interior.ColorIndex = 56
    WSTO.Cells.Font.Size = 10
'========================================================================================
'设置参数
'========================================================================================
    Dim 典集标类 As New Dictionary
    Dim 典数标类 As Integer
    Dim 严选标组 As String
    Dim 严选标类 As String
    Dim 严选再类 As String
    '--------------------------
    Dim X As Integer
    Dim Y As Integer
    For X = LBound(组标类, 1) To UBound(组标类, 1)
        严选标组 = 组标类(X)(0)
        For Y = LBound(组标类(X), 1) + 1 To UBound(组标类(X), 1)
            严选标类 = 组标类(X)(Y)
            If Left$(严选标组, 1) <> "略" Then
                典集标类.Add Item:=严选标组, Key:=严选标类
            End If
        Next
    Next
    典数标类 = 典集标类.Count
'========================================================================================
'匹配花天信息
'========================================================================================
If 严选标类定位 = 位qt概念 Then
    '------------------------------------------------------------------------------------
    Dim WS花册 As Worksheet
    If STBASE外簿工具_花册链接(WS花册, 常花中股) = False Then
        Debug.Print 常花中股 & "不存在"
        Exit Function
    End If
    ARRYM = WS花册.Range("A1").CurrentRegion
    '------------------------------------------------------------------------------------
    Dim 典集行业益盟 As New Dictionary
    Dim 典集概念益盟 As New Dictionary
    Dim CIDL As String

    Dim R As Integer
    For R = LBound(ARRYM, 1) + 1 To UBound(ARRYM, 1)
        CIDL = ARRYM(R, 位列花天CIDL)
        典集行业益盟.Add Key:=CIDL, Item:=ARRYM(R, 位列花天行业益盟)
        典集概念益盟.Add Key:=CIDL, Item:=ARRYM(R, 位列花天概念益盟)
    Next R
    Erase ARRYM
    '------------------------------------------------------------------------------------
    For 遍历序号 = LBound(谕组, 1) To UBound(谕组, 1)
        CIDL = 谕组(遍历序号, 位qt代码)
        谕组(遍历序号, 位qt行益) = 典集行业益盟(CIDL)
        谕组(遍历序号, 位qt概念) = 典集概念益盟(CIDL)
    Next 遍历序号
    Set 典集行业益盟 = Nothing
    Set 典集概念益盟 = Nothing
    '------------------------------------------------------------------------------------
End If
'========================================================================================
'变量声明
'========================================================================================
    Dim 严选码典 As New Dictionary
    Dim 严选码数 As Integer
    Dim 遍历码集 As Integer
    Dim 遍历码集定位 As Integer
    '------------------------------------------------------------------------------------
    Dim 值数再类 As Integer
    值数再类 = 集合再类.Count
    Dim 全页头部列数 As Integer
    全页头部列数 = 常频头列列偏 + 值数再类
    '------------------------------------------------------------------------------------
    Dim 块组(1 To 常频块目列宽数) As Variant
    Dim 块目元 As Range
    Dim 块目行 As Integer
    Dim 块目列主列 As Long
    Dim 节色彩 As Long
    Dim 节色度 As Double
    '--------------------------
    Dim 严选排序按序 As Integer
    Dim 值定色变量 As String
    Dim 值日类涨幅 As Double
    '--------------------------
    Dim 本页码数 As Integer
    本页码数 = 0
'========================================================================================
'遍历
'========================================================================================
    For X = 1 To 典集标类.Count
        严选标组 = 典集标类.Items(X - 1)
        严选标类 = 典集标类.Keys(X - 1)
        严选码累数输出 = 0
        严选码累数停牌 = 0
        严选码累数涨停 = 0
        严选码累计涨幅 = 0
        严选码累计高幅 = 0
        严选码累计低幅 = 0
        For Y = 1 To 值数再类
            '----------------------------------------------------------------------------
            '筛选集合
            '----------------------------------------------------------------------------
            严选再类 = 集合再类.Keys(Y - 1)
            Call IQQQ展擎严选数程(严选码典, 谕组, 严选标类定位, 严选标类, 严选再类定位, 严选再类)
            严选码数 = 严选码典.Count
            '----------------------------------------------------------------------------
            '确定定位：输出列
            '----------------------------------------------------------------------------
'            块目列主列 = (X - 1) * 值数再类 + Y
'            块目列主列 = (块目列主列 - 1) * 常频块目列宽数 + 1
'            块目列主列 = 块目列主列 + 全页头部列数
            块目列主列 = (X - 1) * 常频块目列宽数 + 1
            块目列主列 = 块目列主列 + 全页头部列数
            '----------------------------------------------------------------------------
            '遍历输出码集
            '----------------------------------------------------------------------------
            For 遍历码集 = 1 To 严选码数
                    '---------------------------------------------
                    '输入定位
                    遍历码集定位 = 严选码典.Items(遍历码集 - 1)
                    '---------------------------------------------
                    Erase 块组
                    '输出严选名称
                    块组(常频块目列代称) = 谕组(遍历码集定位, 位qt代称)
                    块组(常频块目列代码) = 谕组(遍历码集定位, 位qt代码)
                    '输出严选属性
                    块组(常频块目列定色变量) = 谕组(遍历码集定位, 严选再类定位)
                    If 谕组(遍历码集定位, 位qt停牌) = "S" Then
                        严选码累数停牌 = 严选码累数停牌 + 1
                        块组(常频块目列日类涨幅) = "S"
                        块组(常频块目列日类高幅) = "S"
                        块组(常频块目列日类低幅) = "S"
                    Else
                        If Len(谕组(遍历码集定位, 位谕of日波BSPR)) > 0 Then
                            块组(常频块目列日类涨幅) = CDbl(谕组(遍历码集定位, 位谕of日波BSPR))
                            严选码累计涨幅 = 严选码累计涨幅 + 块组(常频块目列日类涨幅)
                            严选码累数涨停 = 严选码累数涨停 + IIf(块组(常频块目列日类涨幅) > 9, 1, 0)
                            块组(常频块目列日类高幅) = CDbl(谕组(遍历码集定位, 位谕of日波BSHR))
                            严选码累计高幅 = 严选码累计高幅 + 块组(常频块目列日类高幅)
                            块组(常频块目列日类低幅) = CDbl(谕组(遍历码集定位, 位谕of日波BSLR))
                            严选码累计低幅 = 严选码累计低幅 + 块组(常频块目列日类低幅)
                        End If
                    End If
                    '---------------------------------------------
                    '决定颜色
                    值定色变量 = 块组(常频块目列定色变量)
                    If 严选再类定位 = 位谕of仓日类 Then
                        节色彩 = STBASE结算工具_衍生色度按仓日类(值定色变量)
                    ElseIf 严选再类定位 = 位谕of仓周类 Then
                        节色彩 = STBASE结算工具_衍生色度按仓周类(值定色变量)
                    End If
                    '---------------------------------------------
                    值注释 = 谕组(遍历码集定位, 位谕of周道乾坤)
                    '---------------------------------------------
                    '输出定位
                    块目行 = 常频头行总数 + 严选码累数输出 + 遍历码集
                    Set 块目元 = WSTO.Cells(块目行, 块目列主列)
                    With 块目元
                        With .Resize(1, 常频块目列宽数)
                            .Value = 块组
                            .Interior.Color = 节色彩
                        End With
                        .Interior.TintAndShade = -0.1
                        '                    If Len(值注释) > 0 Then
                        '                    With .Cells(1, 1)
                        '                        '.Comment.Delete
                        '                        .AddComment
                        '                        .Comment.Visible = False
                        '                        .Comment.Shape.Width = 350
                        '                        .Comment.Shape.Height = 160
                        '                        .Comment.Shape.TextFrame.Characters.Font.Size = 10
                        '                        .Comment.Shape.TextFrame.Characters.Font.Name = "宋体"
                        '                        .Comment.Shape.Fill.Solid
                        '                        .Comment.text text:=值注释
                        '                        .Comment.Shape.Fill.ForeColor.SchemeColor = 34
                        '                    End With
                        '                    End If
                    End With
                    Set 块目元 = Nothing
                    '---------------------------------------------
            Next
            Set 严选码典 = Nothing
            严选码累数输出 = 严选码累数输出 + 严选码数
            '----------------------------------------------------------------------------
            '确定定位：汇总栏
            '----------------------------------------------------------------------------
            WSTO.Cells(常频头行总数 + X, 常频头列标组之名) = 严选标组
            WSTO.Cells(常频头行总数 + X, 常频头列标类之名) = 严选标类
            If 严选码数 > 0 Then
                WSTO.Cells(常频头行总数 + X, 常频头列列偏 + Y) = 严选码数
            End If
            '----------------------------------------------------------------------------
        Next
        本页码数 = 本页码数 + 严选码累数输出
        '--------------------------------------------------------------------------------
        '排序：按照
        '--------------------------------------------------------------------------------
        If 严选码累数输出 > 0 Then
            With WSTO.Cells(常频头行总数 + 1, 块目列主列).Resize(严选码累数输出, 常频块目列宽数)
                .Sort key1:=.Cells(1, 常频块目列日类涨幅), order1:=xlDescending _
                    , key2:=.Cells(1, 常频块目列定色变量), order2:=xlDescending _
                    , Header:=xlNo
            End With
        End If
        '--------------------------------------------------------------------------------
        WSTO.Columns(块目列主列).Columns(常频块目列代码).ColumnWidth = 9
        WSTO.Columns(块目列主列).Columns(常频块目列定色变量).ColumnWidth = 3
        WSTO.Columns(块目列主列).Columns(常频块目列日类涨幅).HorizontalAlignment = xlRight
        WSTO.Columns(块目列主列).Columns(常频块目列日类涨幅).ColumnWidth = 6
        WSTO.Columns(块目列主列).Columns(常频块目列日类涨幅).NumberFormatLocal = 全设格式of一位
        WSTO.Columns(块目列主列).Columns(常频块目列日类高幅).HorizontalAlignment = xlRight
        WSTO.Columns(块目列主列).Columns(常频块目列日类高幅).ColumnWidth = 6
        WSTO.Columns(块目列主列).Columns(常频块目列日类高幅).NumberFormatLocal = 全设格式of一位
        WSTO.Columns(块目列主列).Columns(常频块目列日类低幅).HorizontalAlignment = xlRight
        WSTO.Columns(块目列主列).Columns(常频块目列日类低幅).ColumnWidth = 6
        WSTO.Columns(块目列主列).Columns(常频块目列日类低幅).NumberFormatLocal = 全设格式of一位
        WSTO.Columns(块目列主列).Columns(常频块目列代码).Hidden = True
        WSTO.Columns(块目列主列).Columns(常频块目列定色变量).Hidden = True
        WSTO.Columns(块目列主列).Columns(常频块目列日类高幅).Hidden = True
        WSTO.Columns(块目列主列).Columns(常频块目列日类低幅).Hidden = True
        '--------------------------------------------------------------------------------
        '属性：头部
        '--------------------------------------------------------------------------------
        WSTO.Cells(常频头行标组之名, 块目列主列) = 严选标组
        WSTO.Cells(常频头行标类之名, 块目列主列) = 严选标类
        If 严选码累数输出 - 严选码累数停牌 > 0 Then
            WSTO.Cells(常频头行再类之名, 块目列主列).Cells(1, 常频块目列日类涨幅) = Round(严选码累计涨幅 / (严选码累数输出 - 严选码累数停牌), 1)
            WSTO.Cells(常频头行再类之名, 块目列主列).Cells(1, 常频块目列日类高幅) = Round(严选码累计高幅 / (严选码累数输出 - 严选码累数停牌), 1)
            WSTO.Cells(常频头行再类之名, 块目列主列).Cells(1, 常频块目列日类低幅) = Round(严选码累计低幅 / (严选码累数输出 - 严选码累数停牌), 1)
            If (WSTO.Cells(常频头行再类之名, 块目列主列).Cells(1, 常频块目列日类高幅) - WSTO.Cells(常频头行再类之名, 块目列主列).Cells(1, 常频块目列日类低幅)) <> 0 Then
                WSTO.Cells(常频头行再类之名, 块目列主列).Cells(1, 常频块目列代码) = Round((WSTO.Cells(常频头行再类之名, 块目列主列).Cells(1, 常频块目列日类涨幅) - WSTO.Cells(常频头行再类之名, 块目列主列).Cells(1, 常频块目列日类低幅)) / (WSTO.Cells(常频头行再类之名, 块目列主列).Cells(1, 常频块目列日类高幅) - WSTO.Cells(常频头行再类之名, 块目列主列).Cells(1, 常频块目列日类低幅)), 2)
            End If
        Else
            WSTO.Cells(常频头行再类之名, 块目列主列).Cells(1, 常频块目列日类涨幅) = "S"
            WSTO.Cells(常频头行再类之名, 块目列主列).Cells(1, 常频块目列日类高幅) = "S"
            WSTO.Cells(常频头行再类之名, 块目列主列).Cells(1, 常频块目列日类低幅) = "S"
            WSTO.Cells(常频头行再类之名, 块目列主列).Cells(1, 常频块目列代码) = "未冲"
        End If
        '标记：平均涨幅
        With WSTO.Cells(常频头行再类之名, 块目列主列).Cells(1, 常频块目列日类涨幅)
            Select Case .Value
            Case Is > 0.5
              .Font.Color = 常色八红
            Case Is < -0.5
              .Font.Color = 常色八绿
            Case Else
              .Font.Color = 常色八灰
            End Select
            .HorizontalAlignment = xlRight
            .Font.Bold = True
        End With
        '标记：平均高幅
        With WSTO.Cells(常频头行再类之数, 块目列主列)
            .Value = WSTO.Cells(常频头行再类之名, 块目列主列).Cells(1, 常频块目列日类高幅)
            .Font.Color = 常色主黑
            .Font.Bold = False
            .HorizontalAlignment = xlLeft
        End With
        '标记：平均低幅
        With WSTO.Cells(常频头行再类之数, 块目列主列).Cells(1, 常频块目列日类涨幅)
            .Value = WSTO.Cells(常频头行再类之名, 块目列主列).Cells(1, 常频块目列日类低幅)
            .Font.Color = 常色主黑
            .Font.Bold = False
            .HorizontalAlignment = xlRight
        End With
        '标记：上身比
        With WSTO.Cells(常频头行再类之名, 块目列主列)
            .Value = WSTO.Cells(常频头行再类之名, 块目列主列).Cells(1, 常频块目列代码)
            .Font.Color = 常色主黑
            .Font.Bold = False
            .HorizontalAlignment = xlLeft
            .NumberFormatLocal = 全设格式of百分
        End With
        '--------------------------------------------------------------------------------
        '左侧汇总
        '--------------------------------------------------------------------------------
        WSTO.Cells(常频头行总数 + X, 常频头列均涨幅) = WSTO.Cells(常频头行再类之名, 块目列主列).Cells(1, 常频块目列日类涨幅)
        WSTO.Cells(常频头行总数 + X, 常频头列均高幅) = WSTO.Cells(常频头行再类之名, 块目列主列).Cells(1, 常频块目列日类高幅)
        WSTO.Cells(常频头行总数 + X, 常频头列均低幅) = WSTO.Cells(常频头行再类之名, 块目列主列).Cells(1, 常频块目列日类低幅)
        WSTO.Cells(常频头行总数 + X, 常频头列数涨停) = 严选码累数涨停
        WSTO.Cells(常频头行总数 + X, 常频头列比涨身) = WSTO.Cells(常频头行再类之名, 块目列主列)
        WSTO.Cells(常频头行总数 + X, 常频头列标类之数) = 严选码累数输出
        WSTO.Hyperlinks.Add _
              Anchor:=WSTO.Cells(常频头行总数 + X, 常频头列数涨停) _
            , Address:="" _
            , SubAddress:=WSTO.Name & "!" & Cells(常频头行总数, 块目列主列).Address(0, 0)
        '--------------------------------------------------------------------------------
    Next
    典集标类.RemoveAll
    Set 典集标类 = Nothing
'========================================================================================
'输出
'========================================================================================
'    工表名称 = "谕组"
'    Dim WSMX As Worksheet
'    Call PBASE格程工具_表操工表新增(WSMX, 工表名称, WB:=WB )
'    Call UTL数据转换_集ARR2WS(谕组, WSMX)
'    Set WSMX = Nothing
'========================================================================================
'格式化
'========================================================================================
    '------------------------------------------------------------------------------------
    Dim 标类当前 As String
    Dim 标类列始 As Integer
    Dim 标类列数 As Integer
    标类列始 = 0
    标类列数 = 0
    '------------------------------------------------------------------------------------
    Dim 标组当前 As String
    Dim 标组列始 As Integer
    Dim 标组列数 As Integer
    标组列始 = 0
    标组列数 = 0
    '------------------------------------------------------------------------------------
    Dim 列总数 As Integer
    列总数 = 典数标类 * 常频块目列宽数
    '====================================================================================
    '占位：最后一列
    '====================================================================================
    With WSTO.Columns(全页头部列数 + 1).Columns(列总数 + 1)
        .Cells(常频头行标类之名, 1) = " "
        .Cells(常频头行标组之名, 1) = " "
        .Columns(1).Interior.Color = 常色五红
        .Columns(1).ColumnWidth = 2
    End With
    '====================================================================================
    '遍历合并
    '====================================================================================
    For Y = 1 To 列总数 + 1
        X = 全页头部列数 + Y
        '--------------------------------------------------------------------------------
        '格式化行：标类
        '--------------------------------------------------------------------------------
        If Len(WSTO.Cells(常频头行标类之名, X)) > 0 Then
            If WSTO.Cells(常频头行标类之名, X) <> 标类当前 Then
                If 标类列始 > 0 Then
                    标类列数 = X - 1 - 标类列始 + 1
                    '设置：标类之名
                    With WSTO.Cells(常频头行标类之名, 标类列始).Resize(1, 标类列数)
                        .ClearContents
                        .Merge
                        .Value = 标类当前
                        .Interior.Color = 常色主靛
                        
                        '左右边框
                        With .EntireColumn
                            With .Borders(xlEdgeLeft)
                                .LineStyle = xlContinuous
                                .Color = 常色五灰 '常色主黄
                                .Weight = xlThin
                            End With
                            With .Borders(xlEdgeRight)
                                .LineStyle = xlContinuous
                                .Color = 常色五灰 '常色主黄
                                .Weight = xlThin
                            End With
                        End With
                    End With
                End If
    
                '开始一个系列标类
                标类当前 = WSTO.Cells(常频头行标类之名, X)
                标类列始 = X
            End If
        End If
        '--------------------------------------------------------------------------------
        '格式化行：标组
        '--------------------------------------------------------------------------------
        If Len(WSTO.Cells(常频头行标组之名, X)) > 0 Then
            If WSTO.Cells(常频头行标组之名, X) <> 标组当前 Then
                If 标组列始 > 0 Then
                    标组列数 = X - 1 - 标组列始 + 1
                    '设置：标组之名
                    With WSTO.Cells(常频头行标组之名, 标组列始).Resize(1, 标组列数)
                        .ClearContents
                        .Merge
                        .Value = 标组当前
                        '.Interior.Color = 常色四靛

                        '左右边框
                        With .EntireColumn
                            With .Borders(xlEdgeLeft)
                                .LineStyle = xlContinuous
                                .Color = 常色五灰
                                .Weight = xlThick
                            End With
                            With .Borders(xlEdgeRight)
                                .LineStyle = xlContinuous
                                .Color = 常色五灰
                                .Weight = xlThick
                            End With
                        End With
                    End With
                End If

                '开始一个系列类组
                标组当前 = WSTO.Cells(常频头行标组之名, X)
                标组列始 = X
            End If
        End If
        '--------------------------------------------------------------------------------
        '格式化列：隐藏属性列
        '--------------------------------------------------------------------------------
'        If (Y Mod 常频块目列宽数 <> 1) And (Y Mod 常频块目列宽数 <> 常频块目列日类涨幅) Then
'                WSTO.Columns(X).Hidden = True
'        '隐藏无数据列
'        ElseIf WSTO.Cells(常频头行再类之数, X) = 0 Then
'                WSTO.Columns(X).ColumnWidth = 0.04
'        End If
        '--------------------------------------------------------------------------------
    Next
'========================================================================================
'整体格式化
'========================================================================================
    '====================================================================================
    '冻结
    '====================================================================================
    Call PBASE格程工具_表冻结锁定(WSTO, 基行:=常频头行总数, 基列:=全页头部列数)
    '====================================================================================
    '格式化：头部行
    '====================================================================================
    WSTO.Rows(常频头行标组之名).HorizontalAlignment = xlCenter
    WSTO.Rows(常频头行标类之名).HorizontalAlignment = xlCenter
    WSTO.Rows(常频头行标组之名).Font.Bold = True
    WSTO.Rows(常频头行标类之名).Font.Bold = True
    WSTO.Rows(常频头行再类之名).Font.Bold = True
    WSTO.Rows(常频头行标组之名).Font.Color = 常色主白
    WSTO.Rows(常频头行标类之名).Font.Color = 常色主白
    WSTO.Rows(常频头行标组之名).Font.Size = 20
    WSTO.Rows(常频头行标组之名).RowHeight = 25
    WSTO.Rows(常频头行标类之名).Font.Size = 10
    WSTO.Rows(常频头行标类之名).RowHeight = 25
    '====================================================================================
    '格式化：汇总栏
    '====================================================================================
    With WSTO
            '格式化列
            With .Cells(1, 1).Resize(1, 全页头部列数).EntireColumn
                .Font.Color = 常色六灰
                .ColumnWidth = 3
                .HorizontalAlignment = xlRight
            End With
            '中间边框
            With .Cells(常频头行总数, 常频头列列偏 + 1).Resize(1 + 典数标类, 值数再类)
               .Interior.Color = 常色四青
               .Interior.TintAndShade = -0.5
            End With
            '汇总栏再类标签
            .Cells(常频头行总数, 常频头列标类之名) = "组"
            .Cells(常频头行总数, 常频头列标类之名) = "类"
            .Cells(常频头行总数, 常频头列均高幅) = "%高"
            .Cells(常频头行总数, 常频头列均涨幅) = "%涨"
            .Cells(常频头行总数, 常频头列均低幅) = "%低"
            .Cells(常频头行总数, 常频头列数涨停) = "#停"
            .Cells(常频头行总数, 常频头列比涨身) = "%身"
            .Cells(常频头行总数, 常频头列标类之数) = "#标类"
            For Y = 1 To 值数再类
                With .Cells(常频头行总数, 常频头列列偏 + Y)
                    值定色变量 = 集合再类.Items(Y - 1)
                    .Value = 值定色变量
                    If 严选再类定位 = 位谕of仓日类 Then
                        .Interior.Color = STBASE结算工具_衍生色度按仓日类(值定色变量)
                    ElseIf 严选再类定位 = 位谕of仓周类 Then
                        .Interior.Color = STBASE结算工具_衍生色度按仓周类(值定色变量)
                    End If

                End With
            Next
    End With
    '格式化：表头
    With WSTO.Cells(1, 1).Resize(常频头行总数 - 1, 全页头部列数)
        .Merge
        .Value = 频谱注释
        .VerticalAlignment = xlTop
    End With
    '用于其他程序提取（汇总栏列数）作为参数
    WSTO.Cells(常频头行再类之名, 1) = 全页头部列数
    WSTO.Cells(常频头行再类之名, 1).Font.ColorIndex = 56
    '------------------------------------------------------------------------------------
    '统计：总数与首列比例
    '------------------------------------------------------------------------------------
    Dim 当类个数 As Integer
    Dim 首类比例 As Double
    For X = 1 To 典数标类
        目行 = 常频头行总数 + X
        For Y = 1 To 值数再类
            With WSTO.Cells(目行, 常频头列列偏 + Y)
                当类个数 = .Value
                .Font.Color = .Interior.Color
                If 当类个数 >= 20 Then
                    .Font.TintAndShade = 0.8
                ElseIf 当类个数 >= 10 Then
                    .Font.TintAndShade = 0.5
                ElseIf 当类个数 >= 3 Then
                    .Font.TintAndShade = 0.3
                Else
                    .Font.TintAndShade = 0.1
                End If
            End With
        Next
        With WSTO.Cells(目行, 常频头列数涨停)
            If .Value > 0 Then
'                .HorizontalAlignment = xlLeft
            Else
                .Font.Color = .Interior.Color
                .Font.TintAndShade = 0.1
                .Value = "〇"
            End If
        End With
    Next
    WSTO.Columns(常频头列标组之名).ColumnWidth = 10
    WSTO.Columns(常频头列标组之名).HorizontalAlignment = xlRight
'    WSTO.Columns(常频头列标组之名).Font.Bold = True
    WSTO.Columns(常频头列标类之名).ColumnWidth = 12
    WSTO.Columns(常频头列标类之名).Font.Bold = True
    WSTO.Columns(常频头列均高幅).NumberFormatLocal = "[红色]0_);[绿色](0)"
    WSTO.Columns(常频头列均高幅).ColumnWidth = 5
    WSTO.Columns(常频头列均涨幅).NumberFormatLocal = "[红色]0.0_);[绿色](0.0)"
    WSTO.Columns(常频头列均涨幅).ColumnWidth = 6
    WSTO.Columns(常频头列均低幅).NumberFormatLocal = "[红色]0_);[绿色](0)"
    WSTO.Columns(常频头列均低幅).ColumnWidth = 5
    WSTO.Columns(常频头列数涨停).ColumnWidth = 5
    WSTO.Columns(常频头列比涨身).ColumnWidth = 5
    WSTO.Columns(常频头列比涨身).NumberFormatLocal = 全设格式of百分
    WSTO.Columns(常频头列标类之数).ColumnWidth = 5
    WSTO.Columns(常频头列标类之数).Hidden = True
    '------------------------------------------------------------------------------------
    '排序
    '------------------------------------------------------------------------------------
    With WSTO.Cells(常频头行总数, 1).Offset(1, 0)
        .Resize(典数标类, 全页头部列数).Sort _
                key1:=.Cells(0, 常频头列均涨幅), order1:=xlDescending, _
                key2:=.Cells(0, 常频头列数涨停), order2:=xlAscending, _
                Header:=xlNo, SortMethod:=xlPinYin
    End With
'========================================================================================
'返回
'========================================================================================
    Dim MSG As String
    MSG = MSG & ">" & 频谱表名 & " " & Replace(频谱注释, vbCrLf, " ") & "：" & 本页码数 & vbCrLf
    Set WSTO = Nothing
    IQQQ展擎频谱输出基程 = MSG
'========================================================================================
End Function





'========================================================================================
'严选
'标类：交叉表的左列，主要为列举类，用instr进行可相容分类
'再类：交叉表的右列，主要为趋势类，用like进行不相容分类
'========================================================================================
Function IQQQ展擎严选数程( _
          ByRef 严选码典 As Dictionary _
        , ByRef 谕组 As Variant _
        , ByVal 严选标类定位 As Integer _
        , ByVal 严选标类 As String _
        , ByVal 严选再类定位 As Integer _
        , ByVal 严选再类 As String _
        ) As Integer
'========================================================================================
'声明变量
'========================================================================================
    Dim 遍历序号 As Integer
    Dim 严选条件 As Boolean
    Dim 值代码 As String
'========================================================================================
'严选标类：局
'交叉表为：标类 * 再类
'========================================================================================
    For 遍历序号 = LBound(谕组, 1) To UBound(谕组, 1)
        '--------------------------------------------------------------------------------
        If InStr(谕组(遍历序号, 严选标类定位), 严选标类) > 0 _
        And 谕组(遍历序号, 严选再类定位) Like 严选再类 _
        Then
            值代码 = 谕组(遍历序号, 位qt代码)
            严选码典.Add Key:=值代码, Item:=遍历序号
        End If
        '--------------------------------------------------------------------------------
'        If InStr(谕组(遍历序号, 严选标类定位), 严选标类) > 0 Then
'            值代码 = 谕组(遍历序号, 位qt代码)
'            严选码典.Add Key:=值代码, Item:=遍历序号
'        End If
        '--------------------------------------------------------------------------------
    Next 遍历序号
'========================================================================================
    IQQQ展擎严选数程 = 严选码典.Count
End Function
'########################################################################################
'########################################################################################
'##################################        严选引擎       ################################
'########################################################################################
'########################################################################################





'========================================================================================
'========================================================================================
'功能：区块操作
'========================================================================================
'========================================================================================
Sub IQQQ展擎频谱工具展开()
    '------------------------------------------------------------------------------------
    Dim 全页头部列数 As Integer
    全页头部列数 = ActiveSheet.Cells(常频头行再类之名, 1)
    '------------------------------------------------------------------------------------
    Dim i As Integer
    For Each Column In Selection.Columns
        本列 = Column.Column
        If (本列 - 全页头部列数) Mod 常频块目列宽数 = 1 Then
            '非空则展开所有列
            If ActiveSheet.Cells(常频头行再类之数, 本列) > 0 Then
                ActiveSheet.Cells(常频头行总数, 本列).Resize(1, 常频块目列宽数).EntireColumn.Hidden = False
            '空则只展开第一列
            Else
                ActiveSheet.Columns(本列).Hidden = False
            End If
        End If
    Next
    '------------------------------------------------------------------------------------
End Sub
Sub IQQQ展擎频谱工具折叠()
    '------------------------------------------------------------------------------------
    Dim 全页头部列数 As Integer
    全页头部列数 = ActiveSheet.Cells(常频头行再类之名, 1)
    '------------------------------------------------------------------------------------
    Dim i As Integer
    For Each Column In Selection.Columns
        本列 = Column.Column
        If (本列 - 全页头部列数) Mod 常频块目列宽数 = 1 Then
            ActiveSheet.Cells(常频头行总数, 本列).Resize(1, 常频块目列宽数).EntireColumn.Hidden = True
            ActiveSheet.Columns(本列).Hidden = False
        End If
    Next
    '------------------------------------------------------------------------------------
End Sub
'========================================================================================
'========================================================================================
'功能：本页着色
'能够代表活跃的指标：一是当天涨幅代表当天的活跃程度；一是势局，特别是日类，代表一段时间的活跃程度。
'========================================================================================
'========================================================================================
Sub IQQQ展擎频谱工具着色按日基势局()
    '------------------------------------------------------------------------------------
    Dim WSAS As Worksheet
    Set WSAS = ActiveSheet
    If Not WSAS.Name Like 常簿缀频谱 & "*" & 常簿缀频谱 Then
        Exit Sub
    End If
    '------------------------------------------------------------------------------------
    Dim 全页头部列数 As Integer
    全页头部列数 = WSAS.Cells(常频头行再类之名, 1)
    Dim 总列数本页 As Integer
    总列数本页 = PBASE格程工具_表参末列指定(WSAS, 常频头行再类之名)
    Dim 节色彩 As Long
    Dim 值仓日类 As String
    Dim 值日类涨幅 As Double
    '------------------------------------------------------------------------------------
    Dim 遍历行号 As Integer
    Dim 本列 As Integer
    For 本列 = 全页头部列数 + 1 To 总列数本页
        If (本列 - 全页头部列数) Mod 常频块目列宽数 = 1 Then
        For 遍历行号 = 常频头行总数 + 1 To PBASE格程工具_表参末行指定(WSAS, 本列)
            With WSAS.Cells(遍历行号, 本列)
                值仓日类 = .Cells(1, 常频块目列定色变量)
                节色彩 = STBASE结算工具_衍生色度按仓日类(值仓日类)
                .Resize(1, 常频块目列宽数).Interior.Color = 节色彩
            End With
            '---------------------------------------------
            'Debug.Print 本列; 遍历行号
            '---------------------------------------------
        Next
        End If
    Next
    '------------------------------------------------------------------------------------
End Sub
Sub IQQQ展擎频谱工具着色按日类涨幅()
    '------------------------------------------------------------------------------------
    Dim WSAS As Worksheet
    Set WSAS = ActiveSheet
    If Not WSAS.Name Like 常簿缀频谱 & "*" & 常簿缀频谱 Then
        Exit Sub
    End If
    '------------------------------------------------------------------------------------
    Dim 全页头部列数 As Integer
    全页头部列数 = WSAS.Cells(常频头行再类之名, 1)
    Dim 总列数本页 As Integer
    总列数本页 = PBASE格程工具_表参末列指定(WSAS, 常频头行再类之名)
    Dim 节色彩 As Long
    Dim 值日类涨幅 As Double
    '------------------------------------------------------------------------------------
    Dim 遍历行号 As Integer
    Dim 本列 As Integer
    For 本列 = 全页头部列数 + 1 To 总列数本页
        If (本列 - 全页头部列数) Mod 常频块目列宽数 = 1 Then
        For 遍历行号 = 常频头行总数 + 1 To PBASE格程工具_表参末行指定(WSAS, 本列)
            With WSAS.Cells(遍历行号, 本列)
                值日类涨幅 = .Cells(1, 常频块目列日类涨幅)
                节色彩 = STBASE结算工具_衍生色度按涨幅(值日类涨幅)
                .Resize(1, 常频块目列宽数).Interior.Color = 节色彩
            End With
            '---------------------------------------------
            'Debug.Print 本列; 遍历行号
            '---------------------------------------------
        Next
        End If
    Next
    '------------------------------------------------------------------------------------
End Sub


