Attribute VB_Name = "IQQQ跨码_P展擎7瓜页"

'########################################################################################
'##################################    定时运行引擎    ##################################
'########################################################################################
Public RunWhen As Double
Public Const cRunWhat = "UGSOP定时引擎刷新持页"

Sub UGSOP定时引擎开始()
    RunWhen = Now + TimeSerial(0, 0, 5)
    Application.OnTime EarliestTime:=RunWhen, procedure:=cRunWhat, schedule:=True
End Sub

Sub UGSOP定时引擎停止()
    On Error Resume Next
    Application.OnTime EarliestTime:=RunWhen, procedure:=cRunWhat, schedule:=False
End Sub

Sub UGSOP定时引擎刷新持页()
    Dim Sheet1 As Worksheet
    Set Sheet1 = ThisWorkbook.Sheets(常仓名宝合)
    Call IQQQ展擎瓜页引擎正程(Sheet1, "更新排日", "sSSC", 基色底:=常色指金, 禁弹消息:=True)
    Call UGSOP定时引擎开始
End Sub
'########################################################################################
'##################################    定时运行引擎    ##################################
'########################################################################################



'########################################################################################
'########################################################################################
'##################################     瓜页引擎     #####################################
'########################################################################################
'########################################################################################
'========================================================================================
Sub IQQQ展擎瓜页前调决策按B周仓周护()
    Call IQQQ展擎瓜页引擎正程(ActiveSheet, 瓜分类型:="周仓周护")
End Sub
Sub IQQQ展擎瓜页前调决策按B周仓周地()
    Call IQQQ展擎瓜页引擎正程(ActiveSheet, 瓜分类型:="周仓周地")
End Sub
Sub IQQQ展擎瓜页前调决策按B周仓周层()
    Call IQQQ展擎瓜页引擎正程(ActiveSheet, 瓜分类型:="周仓周层")
End Sub
Sub IQQQ展擎瓜页前调决策按B周仓日综()
    Call IQQQ展擎瓜页引擎正程(ActiveSheet, 瓜分类型:="周仓日综")
End Sub
Sub IQQQ展擎瓜页前调决策按B周仓日综滤()
    Call IQQQ展擎瓜页引擎正程(ActiveSheet, 瓜分类型:="周仓日综滤")
End Sub
Sub IQQQ展擎瓜页前调决策按B周仓日层()
    Call IQQQ展擎瓜页引擎正程(ActiveSheet, 瓜分类型:="周仓日层")
End Sub
'========================================================================================
Sub IQQQ展擎瓜页前调决策按B日仓日综()
    Call IQQQ展擎瓜页引擎正程(ActiveSheet, 瓜分类型:="日仓日综")
End Sub
Sub IQQQ展擎瓜页前调决策按B日仓日层()
    Call IQQQ展擎瓜页引擎正程(ActiveSheet, 瓜分类型:="日仓日层")
End Sub
Sub IQQQ展擎瓜页前调决策按B日仓日层滤()
    Call IQQQ展擎瓜页引擎正程(ActiveSheet, 瓜分类型:="日仓日层滤")
End Sub
Sub IQQQ展擎瓜页前调决策按B日仓日机()
    Call IQQQ展擎瓜页引擎正程(ActiveSheet, 瓜分类型:="日仓日机")
End Sub
'========================================================================================
Sub IQQQ展擎瓜页前调决策按B混日综()
    Call IQQQ展擎瓜页引擎正程(ActiveSheet, 瓜分类型:="混日综")
End Sub
Sub IQQQ展擎瓜页前调决策按D混周层()
    Call IQQQ展擎瓜页引擎正程(ActiveSheet, 瓜分类型:="混周层")
End Sub
Sub IQQQ展擎瓜页前调决策按D混周机()
    Call IQQQ展擎瓜页引擎正程(ActiveSheet, 瓜分类型:="混周机")
End Sub
Sub IQQQ展擎瓜页前调决策按D混日层()
    Call IQQQ展擎瓜页引擎正程(ActiveSheet, 瓜分类型:="混日层")
End Sub
Sub IQQQ展擎瓜页前调决策按D混日机()
    Call IQQQ展擎瓜页引擎正程(ActiveSheet, 瓜分类型:="混日机")
End Sub
'========================================================================================
Sub IQQQ展擎瓜页前调决策按E池()
    Call IQQQ展擎瓜页引擎正程(ActiveSheet, 瓜分类型:="池")
End Sub
Sub IQQQ展擎瓜页前调决策按H活()
    Call IQQQ展擎瓜页引擎正程(ActiveSheet, 瓜分类型:="活")
End Sub
'========================================================================================





'########################################################################################
'########################################################################################
'##################################     瓜页引擎     ####################################
'########################################################################################
'########################################################################################
'========================================================================================
'========================================================================================
'功能：加壳提高效率，外部调用基程
'========================================================================================
'========================================================================================
Function IQQQ展擎瓜页引擎正程( _
          Optional ByRef WSAS As Worksheet _
        , Optional ByVal 瓜分类型 As String = "更新" _
        , Optional ByVal 实结类型 As String = "cCCC" _
        , Optional ByVal 基色底 As Long = 常色指金 _
        , Optional ByVal 禁弹消息 As Boolean = False _
        ) As String
    '------------------------------------------------------------------------------------
    UTL宏工具_BEGIN
    MSG = IQQQ展擎瓜页引擎基程(WSAS, 瓜分类型, 实结类型, 基色底)
    UTL宏工具_END
    '------------------------------------------------------------------------------------
    If 禁弹消息 = False Then
        MsgBox MSG, vbOKOnly, IIf(InStr(瓜分类型, "更新") > 0, "更新本页", "瓜分本页")
    End If
End Function
Function IQQQ展擎瓜页引擎基程( _
          Optional ByRef WSAS As Worksheet _
        , Optional ByVal 瓜分类型 As String = "更新" _
        , Optional ByVal 实结类型 As String = "cCCC" _
        , Optional ByVal 基色底 As Long = 常色指金 _
        ) As String
    TTT = Timer
'========================================================================================
'验明正身
'========================================================================================
    If WSAS Is Nothing Then Exit Function
    '验明正身
    If PSOP格整理质程_是否适用首列(WSAS.Name) = False Then
        If WSAS.Name = "G" Then
            Call 现市单程_全局全球
            Exit Function
        End If
    End If
    '------------------------------------------------------------------------------------
    Dim wb As Workbook
    Set wb = WSAS.Parent
'========================================================================================
'输入
'要选取 【核心指数】以上部分
'========================================================================================
    Dim 当前表名  As String
    当前表名 = WSAS.Name
    '---------------------------------------------------------------------------------
    Dim 始行  As Integer
    始行 = 2
    Dim 末行 As Integer
    末行 = PBASE格程工具_表参定位特征行号(WSAS, 特征值:="核心指数")
    Dim 总行 As Integer
    总行 = 末行 - 始行 + 1
    If 总行 < 1 Then Exit Function
    '------------------------------------------------------------------------------------
    Dim 元组本页 As Variant
    元组本页 = WSAS.Cells(始行, 1).Resize(总行, 位谕列终全部)
'========================================================================================
'操作：设置工表
'========================================================================================
    Dim 指定表名 As String
    If 瓜分类型 = "更新排日" Or 瓜分类型 = "更新排周" Or 瓜分类型 = "更新排仓" Then
        指定表名 = 当前表名
        Call IQQQ展擎出程至页(wb, 指定表名, 是否建表:=True, 章色:=常色主碧, 章签:="")
    ElseIf 瓜分类型 = "更新排否" Then
        指定表名 = 当前表名
        'WSAS.Cells.ClearContents
        Call IQQQ展擎出程至页(wb, 指定表名, 是否建表:=True, 章色:=常色主碧, 章签:="")
    '------------------------------------------------------------------------------------
    ElseIf 瓜分类型 = "周局" Or 瓜分类型 = "池" Then
        指定表名 = 当前表名
        Call IQQQ展擎出程至页(wb, 指定表名, 是否建表:=True, 章色:=常色主碧, 章签:=指定表名)
    '------------------------------------------------------------------------------------
    Else
        指定表名 = 瓜分类型 & 当前表名
        Call IQQQ展擎出程至页(wb, 指定表名, 是否建表:=True, 章色:=常色主碧, 章签:="")
    End If
    '====================================================================================
    Dim MSG As String
    MSG = MSG & "【QQQ本页瓜分】" & 瓜分类型 & vbCrLf
    MSG = MSG & ">来表：" & 当前表名 & vbCrLf
    MSG = MSG & ">去表：" & 指定表名 & vbCrLf
'========================================================================================
'操作：瓜分
'========================================================================================
    '------------------------------------------------------------------------------------
    '按章按节
    '------------------------------------------------------------------------------------
    If 瓜分类型 = "周仓周护" Then
            MSG = MSG & IQQQ展擎筛程至C0章按通用(wb, 指定表名, 元组本页, 出章模式:="周仓", 出节模式:="周护", 出全是否:=True)
    ElseIf 瓜分类型 = "周仓周地" Then
            MSG = MSG & IQQQ展擎筛程至C0章按通用(wb, 指定表名, 元组本页, 出章模式:="周仓", 出节模式:="周地", 出全是否:=False)
    ElseIf 瓜分类型 = "周仓周层" Then
            MSG = MSG & IQQQ展擎筛程至C0章按通用(wb, 指定表名, 元组本页, 出章模式:="周仓", 出节模式:="周层", 出全是否:=True)
    ElseIf 瓜分类型 = "周仓日综" Then
            MSG = MSG & IQQQ展擎筛程至C0章按通用(wb, 指定表名, 元组本页, 出章模式:="周仓", 出节模式:="日综", 出全是否:=True)
    ElseIf 瓜分类型 = "周仓日综滤" Then
            MSG = MSG & IQQQ展擎筛程至C0章按通用(wb, 指定表名, 元组本页, 出章模式:="周仓", 出节模式:="日综", 出全是否:=False)
    ElseIf 瓜分类型 = "周仓日层" Then
            MSG = MSG & IQQQ展擎筛程至C0章按通用(wb, 指定表名, 元组本页, 出章模式:="周仓", 出节模式:="日层", 出全是否:=True)
    '------------------------------------------------------------------------------------
    ElseIf 瓜分类型 = "日仓日综" Then
            MSG = MSG & IQQQ展擎筛程至C0章按通用(wb, 指定表名, 元组本页, 出章模式:="日仓", 出节模式:="日综", 出全是否:=True)
    ElseIf 瓜分类型 = "日仓日层" Then
            MSG = MSG & IQQQ展擎筛程至C0章按通用(wb, 指定表名, 元组本页, 出章模式:="日仓", 出节模式:="日层", 出全是否:=True)
    ElseIf 瓜分类型 = "日仓日层滤" Then
            MSG = MSG & IQQQ展擎筛程至C0章按通用(wb, 指定表名, 元组本页, 出章模式:="日仓", 出节模式:="日层", 出全是否:=False)
    ElseIf 瓜分类型 = "日仓日机" Then
            MSG = MSG & IQQQ展擎筛程至C0章按通用(wb, 指定表名, 元组本页, 出章模式:="日仓", 出节模式:="日机", 出全是否:=False)
    '------------------------------------------------------------------------------------
    ElseIf 瓜分类型 = "活" Then
            MSG = MSG & IQQQ展擎筛程至C0章按通用(wb, 指定表名, 元组本页, 出章模式:="活", 出全是否:=True)
    '------------------------------------------------------------------------------------
    '混按节
    '------------------------------------------------------------------------------------
    ElseIf 瓜分类型 = "混日综" Then
            MSG = MSG & IQQQ展擎筛程至D0节按通用(wb, 指定表名, 元组本页, 出节模式:="日综", 出全是否:=True)
    ElseIf 瓜分类型 = "混周层" Then
            MSG = MSG & IQQQ展擎筛程至D0节按通用(wb, 指定表名, 元组本页, 出节模式:="周层", 出全是否:=True)
    ElseIf 瓜分类型 = "混周机" Then
            MSG = MSG & IQQQ展擎筛程至D0节按通用(wb, 指定表名, 元组本页, 出节模式:="周机", 出全是否:=False)
    ElseIf 瓜分类型 = "混日层" Then
            MSG = MSG & IQQQ展擎筛程至D0节按通用(wb, 指定表名, 元组本页, 出节模式:="日层", 出全是否:=True)
    ElseIf 瓜分类型 = "混日机" Then
            MSG = MSG & IQQQ展擎筛程至D0节按通用(wb, 指定表名, 元组本页, 出节模式:="日机", 出全是否:=True)
    '------------------------------------------------------------------------------------
    ElseIf 瓜分类型 = "池" Then
            MSG = MSG & IQQQ展擎筛程至B1书按池(wb, 指定表名, 元组本页)
    '------------------------------------------------------------------------------------
    ElseIf 瓜分类型 = "更新排否" Then
            MSG = MSG & IQQQ展擎筛程_出程更新通用(wb, 指定表名, 元组本页, 实结类型:=实结类型, 基色底:=基色底)
    ElseIf 瓜分类型 = "更新排周" Then
            MSG = MSG & IQQQ展擎筛程_出程更新通用(wb, 指定表名, 元组本页, 实结类型:=实结类型, 基色底:=基色底, 排序按周:=True, 仓日类型:=当前表名)
            If 当前表名 = 常仓名宝福 Or 当前表名 = 常仓名宝合 Then
                Dim 典核心指数 As New Dictionary
                Call 后台族非票精分调程_WA_设置典核心宽基(典核心指数)
                Call IQQQ展擎筛程_出程更新通用(wb, 指定表名, 典码输出:=典核心指数, 实结类型:=实结类型, 基色底:=基色底, 区签:="核心指数")
                Call 后台族非票精分调程_WA_设置典核心行业(典核心指数)
                Call IQQQ展擎筛程_出程更新通用(wb, 指定表名, 典码输出:=典核心指数, 实结类型:=实结类型, 基色底:=基色底, 区签:="核心行业指数")
                Call 后台族非票精分调程_WA_设置典核心大盘(典核心指数)
                Call IQQQ展擎筛程_出程更新通用(wb, 指定表名, 典码输出:=典核心指数, 实结类型:=实结类型, 基色底:=基色底, 区签:="核心大盘指数")
            End If
    ElseIf 瓜分类型 = "更新排日" Then
            MSG = MSG & IQQQ展擎筛程_出程更新通用(wb, 指定表名, 元组本页, 实结类型:=实结类型, 基色底:=基色底, 排序按日:=True, 仓日类型:=当前表名)
            If 当前表名 = 常仓名宝福 Or 当前表名 = 常仓名宝合 Then
                Call 后台族非票精分调程_WA_设置典核心宽基(典核心指数)
                Call IQQQ展擎筛程_出程更新通用(wb, 指定表名, 典码输出:=典核心指数, 实结类型:=实结类型, 基色底:=基色底, 区签:="核心指数")
                Call 后台族非票精分调程_WA_设置典核心行业(典核心指数)
                Call IQQQ展擎筛程_出程更新通用(wb, 指定表名, 典码输出:=典核心指数, 实结类型:=实结类型, 基色底:=基色底, 区签:="核心行业指数")
                Call 后台族非票精分调程_WA_设置典核心大盘(典核心指数)
                Call IQQQ展擎筛程_出程更新通用(wb, 指定表名, 典码输出:=典核心指数, 实结类型:=实结类型, 基色底:=基色底, 区签:="核心大盘指数")
            End If
    ElseIf 瓜分类型 = "更新排仓" Then
            MSG = MSG & IQQQ展擎筛程_出程更新通用(wb, 指定表名, 元组本页, 实结类型:=实结类型, 基色底:=基色底, 排序按仓:=True, 仓日类型:=当前表名)
            If 当前表名 = 常仓名宝福 Or 当前表名 = 常仓名宝合 Then
                Call 后台族非票精分调程_WA_设置典核心宽基(典核心指数)
                Call IQQQ展擎筛程_出程更新通用(wb, 指定表名, 典码输出:=典核心指数, 实结类型:=实结类型, 基色底:=基色底, 区签:="核心指数")
                Call 后台族非票精分调程_WA_设置典核心行业(典核心指数)
                Call IQQQ展擎筛程_出程更新通用(wb, 指定表名, 典码输出:=典核心指数, 实结类型:=实结类型, 基色底:=基色底, 区签:="核心行业指数")
                Call 后台族非票精分调程_WA_设置典核心大盘(典核心指数)
                Call IQQQ展擎筛程_出程更新通用(wb, 指定表名, 典码输出:=典核心指数, 实结类型:=实结类型, 基色底:=基色底, 区签:="核心大盘指数")
            End If
            If 当前表名 = 常仓名宝合 Or 当前表名 = 常仓名宝福 Or 当前表名 = 常仓名宝彦 Then
                wb.Sheets(指定表名).Columns(位qt仓主).Hidden = False
                wb.Sheets(指定表名).Columns(位qt仓周).Hidden = False
            End If
    End If
    '------------------------------------------------------------------------------------
    Erase 元组本页
'========================================================================================
'返回
'========================================================================================
    'MSG = MSG & vbCrLf & "QQQ筛选用时：" & CInt(Timer - TTT)
    Debug.Print MSG
    IQQQ展擎瓜页引擎基程 = MSG
End Function
'########################################################################################
'########################################################################################
'##################################     瓜页引擎     #####################################
'########################################################################################
'########################################################################################




Function IQQQ展擎筛程_出程更新通用( _
          ByRef wb As Workbook _
        , ByVal 指定表名 As String _
        , Optional ByRef 谕组 As Variant _
        , Optional ByRef 典码输出 As Dictionary _
        , Optional ByVal 实结类型 As String = "cCCC" _
        , Optional ByVal 基色底 As Long = 常色指金 _
        , Optional ByVal 区签 As String = "" _
        , Optional ByVal 排序按周 As Boolean = False _
        , Optional ByVal 排序按日 As Boolean = False _
        , Optional ByVal 排序按仓 As Boolean = False _
        , Optional ByVal 仓日类型 As String = 常仓名宝福 _
        ) As String
'========================================================================================
'验证
'========================================================================================
        If UTL判断工表存在(指定表名, wb) = False Then Exit Function
        '--------------------------------------------------------------------------------
        '如果【谕组】不空，用谕组；否则，用典码输出。
        '--------------------------------------------------------------------------------
        If VBA.IsMissing(谕组) = True Then
            If 典码输出 Is Nothing Then
                Exit Function
            Else
                Call UTL数据转换_集典码2组码(谕组, 典码输出)
            End If
        End If
        '--------------------------------------------------------------------------------
        Dim WS As Worksheet
        Set WS = wb.Sheets(指定表名)
        WS.Tab.Color = 基色底
'========================================================================================
'声明变量
'========================================================================================
        Dim MSG As String
        Dim 表名 As String
        Dim 始行  As Integer
        始行 = PBASE格程工具_表参末行指定(WS, 1) + 1
        Dim 末行 As Integer
        Dim 行号标签 As Integer
        Dim 行号数始 As Integer
        Dim i As Integer
'========================================================================================
'主程序：规制代码
'========================================================================================
        Dim CIDV As Variant
        Dim CIDL As String
        Dim 遍历序号 As Integer
        For 遍历序号 = LBound(谕组, 1) To UBound(谕组, 1)
            CIDV = 谕组(遍历序号, 位qt代码)
            CIDL = UBCID规制代码(CIDV)
            谕组(遍历序号, 位qt代码) = CIDL                    '替换为全码
        Next 遍历序号
'========================================================================================
'实结类型：只有行情
'========================================================================================
        If 实结类型 = "S___" Then
            If Not UBHTTP腾实_查是否断网 Then
                Call IQQQ跨码据擎_数程查询行情(谕组)
            End If
            Call UTL数据转换_集ARR2WS(谕组, WS, 始行:=2)
            Erase 谕组
            Exit Function
        End If
'========================================================================================
'实结类型：行情&系统
'========================================================================================
        '================================================================================
        '更新数据
        '================================================================================
        Call IQQQ跨码据擎_数程生成全息(谕组, 常花中股, 实结类型:=实结类型, 仓日类型:=仓日类型)
        '================================================================================
        '输出类型一：没有区标签，原样输出不改变格式
        '================================================================================
        If Len(区签) = 0 And 排序按周 = False And 排序按日 = False And 排序按仓 = False Then
                '------------------------------------------------------------------------
                '定位
                '------------------------------------------------------------------------
                末行 = PBASE格程工具_表参末行指定(WS, 1)
                行号数始 = 末行 + 1
                '------------------------------------------------------------------------
                '输出数据
                '------------------------------------------------------------------------
                Call UTL数据转换_集ARR2WS(谕组, WS, 始行:=行号数始)
                Erase 谕组
                '------------------------------------------------------------------------
                '格式化：数据
                '------------------------------------------------------------------------
                For i = PBASE格程工具_表参末行全页(WS) To 行号数始 Step -1
                    Debug.Print "更新", i
                    If UBCID是代码(WS.Cells(i, 1).Value) = False Then
                            With WS.Cells(i, 1).Resize(1, 位谕列终全部)
                                .Interior.Color = 基色底
                                .Interior.TintAndShade = -0.8
                                .Font.Color = 常色主白
                                .Font.Bold = True
                                .Font.Size = 12
                                .RowHeight = 20
                                .Borders(xlInsideVertical).LineStyle = xlNone
                                .HorizontalAlignment = xlLeft
                            End With
                            WS.Rows(i).ClearComments
                    Else
                            With WS.Cells(i, 1).Resize(1, 位qt主宽)
                                .Interior.Color = 基色底
                                .Interior.TintAndShade = 0.8
                            End With
                            WS.Cells(i, 位qt代称).Interior.TintAndShade = 0.5
                    End If
                Next
        '================================================================================
        '输出类型一：有区标签，重新输出
        '================================================================================
        Else
                '------------------------------------------------------------------------
                '定位
                '------------------------------------------------------------------------
                末行 = PBASE格程工具_表参末行指定(WS, 1)
                行号标签 = 末行 + 1
                行号数始 = 末行 + 2
                计数输出 = UBound(谕组, 1) - LBound(谕组, 1) + 1
                '------------------------------------------------------------------------
                '输出数据
                '------------------------------------------------------------------------
                Call UTL数据转换_集ARR2WS(谕组, WS, 始行:=行号数始)
                Erase 谕组
                '------------------------------------------------------------------------
                '删除非数据行
                '------------------------------------------------------------------------
                末行 = PBASE格程工具_表参末行指定(WS, 1)
                For i = 末行 To 行号数始 Step -1
                    If UBCID是代码(WS.Cells(i, 1).Value) = False Then
                        WS.Rows(i).Delete
                    End If
                Next
                '------------------------------------------------------------------------
                '格式化
                '------------------------------------------------------------------------
                末行 = PBASE格程工具_表参末行指定(WS, 1)
                计数输出 = 末行 - 行号数始 + 1
                If 计数输出 > 0 Then
                    '--------------------------------------------------------------------
                    '格式化：数据
                    '--------------------------------------------------------------------
                    With WS.Cells(行号数始, 1)
                        With .Resize(计数输出, 位qt主宽)
                            .Interior.Color = 基色底
                            .Interior.TintAndShade = 0.8
                        End With
                        .Cells(1, 位qt代称).Resize(计数输出, 1).Interior.TintAndShade = 0.5
                    End With
                    '--------------------------------------------------------------------
                    '排序
                    '--------------------------------------------------------------------
                    Dim 区域排序 As Range
                    Set 区域排序 = WS.Cells(行号数始, 1).Resize(计数输出, 1).EntireRow
                    '排序：周类排序
                    If 排序按周 = True Then
                            With 区域排序
                                .Sort _
                                    key1:=.Cells(1, 位谕of周层三鳄), order1:=xlDescending, _
                                    key2:=.Cells(1, 位qt行业), order2:=xlDescending, _
                                    Header:=xlNo
                                .Sort _
                                    key1:=.Cells(1, 位谕of周层大局), order1:=xlAscending, _
                                    key2:=.Cells(1, 位谕of周层护型), order2:=xlAscending, _
                                    key3:=.Cells(1, 位谕of周层柱型), order3:=xlDescending, _
                                    Header:=xlNo
                            End With
                            WS.Columns(位qt盯盘类别).Hidden = False
                    '排序：按照日类进行排序
                    ElseIf 排序按日 = True Then
                            With 区域排序
                                .Sort _
                                    key1:=.Cells(1, 位谕of周层大局), order1:=xlAscending, _
                                    key2:=.Cells(1, 位谕of周层护型), order2:=xlDescending, _
                                    Header:=xlNo
                                .Sort _
                                    key1:=.Cells(1, 位qt行业), order1:=xlDescending, _
                                    key2:=.Cells(1, 位qt代码), order2:=xlAscending, _
                                    Header:=xlNo
                            End With
                            WS.Columns(位qt盯盘类别).Hidden = False
                    '排序：按照仓位进行排序
                    ElseIf 排序按仓 = True Then
                            With 区域排序
                                .Sort _
                                    key1:=.Cells(1, 位谕of周层大局), order1:=xlAscending, _
                                    key2:=.Cells(1, 位谕of周层护型), order2:=xlAscending, _
                                    key3:=.Cells(1, 位谕of周层柱型), order3:=xlDescending, _
                                    Header:=xlNo
                                .Sort _
                                    key1:=.Cells(1, 位qt盯盘类别), order1:=xlDescending, _
                                    key2:=.Cells(1, 位qt行业), order2:=xlAscending, _
                                    key3:=.Cells(1, 位qt代码), order3:=xlAscending, _
                                    Header:=xlNo
                                .Sort _
                                    key1:=.Cells(1, 位qt仓主), order1:=xlDescending, _
                                    Header:=xlNo
                            End With
                            WS.Columns(位qt盯盘类别).Hidden = False
                    End If
                    Set 区域排序 = Nothing
                    '--------------------------------------------------------------------
                    '格式化：标签
                    '--------------------------------------------------------------------
                    With WS.Rows(行号标签)
                        With .Cells(1, 1)
                            .Value = IIf(Len(区签) > 0, 区签, 实结类型)
                            .Cells(1, 常列标签计数) = 计数输出 & "只"
                            With .Resize(1, 位谕列终全部)
                                .Interior.Color = 基色底
                                .Interior.TintAndShade = -0.8
                                .Font.Color = 常色主白
                                .Font.Bold = True
                                .Font.Size = 12
                                .RowHeight = 20
                                .Borders(xlInsideVertical).LineStyle = xlNone
                                .HorizontalAlignment = xlLeft
                            End With
                        End With
                    End With
                    '--------------------------------------------------------------------
                End If
                '------------------------------------------------------------------------
        End If
        '================================================================================
        '特殊处理
        '检视持仓区域   (仅应用于持仓工表)
        '================================================================================
        If WS.Name = 常仓名宝福 Or WS.Name = 常仓名宝彦 Then
                WS.Tab.Color = 常色主黑
                MSG = IQQQ跨码展擎_校验持仓区域(WS)
        End If
        Call IQQQ跨码展擎_按行汇总(WS, 基行:=始行, 是否跨码:=True)
'========================================================================================
'返回
'========================================================================================
        IQQQ展擎筛程_出程更新通用 = MSG
'========================================================================================
End Function
'########################################################################################
'########################################################################################
'##################################     更新引擎    #####################################
'########################################################################################
'########################################################################################





'########################################################################################
'##################################     更新单程    #####################################
'########################################################################################
Sub IQQQ展擎瓜页前调更新排否S___()
    Call IQQQ展擎瓜页引擎正程(ActiveSheet, "更新排否", "S___", 基色底:=常色指金)
End Sub
Sub IQQQ展擎瓜页前调更新排否_CCC()
    Call IQQQ展擎瓜页引擎正程(ActiveSheet, "更新排否", "_CCC", 基色底:=常色指金)
End Sub
Sub IQQQ展擎瓜页前调更新排否sCCC()
    Call IQQQ展擎瓜页引擎正程(ActiveSheet, "更新排否", "sCCC", 基色底:=常色指金)
End Sub
Sub IQQQ展擎瓜页前调更新排否sSCC()
    Call IQQQ展擎瓜页引擎正程(ActiveSheet, "更新排否", "sSCC", 基色底:=常色指金)
End Sub
Sub IQQQ展擎瓜页前调更新排否sSSC()
    Call IQQQ展擎瓜页引擎正程(ActiveSheet, "更新排否", "sSSC", 基色底:=常色指金)
End Sub
Sub IQQQ展擎瓜页前调更新排否sSSS()
    Call IQQQ展擎瓜页引擎正程(ActiveSheet, "更新排否", "sSSS", 基色底:=常色指金)
End Sub
'========================================================================================
'更新排周：完全按照【日类】进行排序。目的是看是否进行买卖操作。
'========================================================================================
'针对持仓页【Z.】进行日内买卖刷新
Sub IQQQ展擎瓜页前调更新排日sSCC()
    Call IQQQ展擎瓜页引擎正程(ActiveSheet, "更新排日", "sSCC", 基色底:=常色指金)
End Sub
Sub IQQQ展擎瓜页前调更新排日sSSC()
    Call IQQQ展擎瓜页引擎正程(ActiveSheet, "更新排日", "sSSC", 基色底:=常色指金)
End Sub
Sub IQQQ展擎瓜页前调更新排日sSSS()
    Call IQQQ展擎瓜页引擎正程(ActiveSheet, "更新排日", "sSSS", 基色底:=常色指金)
End Sub
'========================================================================================
'更新排周：完全按照【周类警损】进行排序。目的是看是否符合大势。
'========================================================================================
Sub IQQQ展擎瓜页前调更新排周sCCC()
    Call IQQQ展擎瓜页引擎正程(ActiveSheet, "更新排周", "sCCC", 基色底:=常色指金)
End Sub
Sub IQQQ展擎瓜页前调更新排周sSCC()
    Call IQQQ展擎瓜页引擎正程(ActiveSheet, "更新排周", "sSCC", 基色底:=常色指金)
End Sub
Sub IQQQ展擎瓜页前调更新排周sSSC()
    Call IQQQ展擎瓜页引擎正程(ActiveSheet, "更新排周", "sSSC", 基色底:=常色指金)
End Sub
Sub IQQQ展擎瓜页前调更新排周sSSS()
    Call IQQQ展擎瓜页引擎正程(ActiveSheet, "更新排周", "sSSS", 基色底:=常色指金)
End Sub
'========================================================================================
'更新排周：按照【持仓权重】【周类警损】进行排序。目的是看是聚焦大仓位以及不符合大势的仓位。
'========================================================================================
Sub IQQQ展擎瓜页前调更新排仓sCCC()
    Call IQQQ展擎瓜页引擎正程(ActiveSheet, "更新排仓", "sCCC", 基色底:=常色指金)
End Sub
Sub IQQQ展擎瓜页前调更新排仓sSCC()
    Call IQQQ展擎瓜页引擎正程(ActiveSheet, "更新排仓", "sSCC", 基色底:=常色指金)
End Sub
Sub IQQQ展擎瓜页前调更新排仓sSSC()
    Call IQQQ展擎瓜页引擎正程(ActiveSheet, "更新排仓", "sSSC", 基色底:=常色指金)
End Sub
Sub IQQQ展擎瓜页前调更新排仓sSSS()
    Call IQQQ展擎瓜页引擎正程(ActiveSheet, "更新排仓", "sSSS", 基色底:=常色指金)
End Sub
'########################################################################################
'##################################     更新单程     #####################################
'########################################################################################











