Attribute VB_Name = "PX算研_ZAL算比1引擎"
Option Explicit
Public Const 常算比类型为粗比 = "M"
Public Const 常表名统算比 = "统算比"
Public Const 常表名统算展 = "统算展"
'========================================================================================
Public Const 位统算比基础列始 = 1
Public Const 位统算比基础列数 = 3
Public Const 位统算比次门列始 = 位统算比基础列始 + 位统算比基础列数
Public Const 位统算比次门列数 = 8
Public Const 位统算比持门列始 = 位统算比基础列始 + 位统算比基础列数 + 位统算比次门列数
Public Const 位统算比持门列数 = 8
Public Const 位统算比龄门列始 = 位统算比基础列始 + 位统算比基础列数 + 位统算比次门列数 + 位统算比持门列数
Public Const 位统算比龄门列数 = 10
Public Const 位统算比全部列数 = 位统算比基础列始 + 位统算比基础列数 + 位统算比次门列数 + 位统算比持门列数 + 位统算比龄门列数
'========================================================================================

'模块级共享变量
Dim TT As Double
Dim MSG As String
Public Const 位统算比基础代码 = 位统算比基础列始 + 0
Public Const 位统算比基础代称 = 位统算比基础列始 + 1
Public Const 位统算比基础期类 = 位统算比基础列始 + 2
'-------------------------------------------
Public Const 位统算比次门算法名称 = 位统算比次门列始 + 0
Public Const 位统算比次门累赚均次最大 = 位统算比次门列始 + 1
Public Const 位统算比次门累赚合计最大 = 位统算比次门列始 + 2
Public Const 位统算比次门累涨合计最大 = 位统算比次门列始 + 3
Public Const 位统算比次门总持 = 位统算比次门列始 + 4
Public Const 位统算比次门总次 = 位统算比次门列始 + 5
Public Const 位统算比次门算法胜率 = 位统算比次门列始 + 6
Public Const 位统算比次门次年比率 = 位统算比次门列始 + 7
'-------------------------------------------
Public Const 位统算比持门算法名称 = 位统算比持门列始 + 0
Public Const 位统算比持门累赚均持最大 = 位统算比持门列始 + 1
Public Const 位统算比持门累赚合计最大 = 位统算比持门列始 + 2
Public Const 位统算比持门累涨合计最大 = 位统算比持门列始 + 3
Public Const 位统算比持门总持 = 位统算比持门列始 + 4
Public Const 位统算比持门总次 = 位统算比持门列始 + 5
Public Const 位统算比持门算法胜率 = 位统算比持门列始 + 6
Public Const 位统算比持门持年比率 = 位统算比持门列始 + 7
'-------------------------------------------
Public Const 位统算比龄门算法名称 = 位统算比龄门列始 + 0
Public Const 位统算比龄门累赚均年最大 = 位统算比龄门列始 + 1
Public Const 位统算比总年 = 位统算比龄门列始 + 2
Public Const 位统算比龄门累赚均龄最大 = 位统算比龄门列始 + 3
Public Const 位统算比总龄 = 位统算比龄门列始 + 4
Public Const 位统算比龄门累赚合计最大 = 位统算比龄门列始 + 5
Public Const 位统算比龄门累涨合计最大 = 位统算比龄门列始 + 6
Public Const 位统算比龄门总持 = 位统算比龄门列始 + 7
Public Const 位统算比龄门总次 = 位统算比龄门列始 + 8
Public Const 位统算比龄门算法胜率 = 位统算比龄门列始 + 9
'========================================================================================






Function XL算比引擎正程测试()
'========================================================================================
'参数设置
'========================================================================================
    Dim 被研代码 As String
    Dim 被研期类 As String
    Dim 组被研算法 As Variant
    '------------------------------------------------------------------------------------
    被研代码 = "sh600150"
    '------------------------------------------------------------------------------------
    被研期类 = 常期类为月
    '------------------------------------------------------------------------------------
    组被研算法 = Array(常算比类型为粗比, _
         "s@均<ZB>" _
        , "T@均<JB>", "T@均<JB>2" _
        , "s@阶鑫<IA>", "s@阶鑫<IAB>", "s@阶鑫<IABC>" _
        )
    组被研算法 = Array(常算比类型为粗比, _
        "s@均<ZB>" _
        , "s@阶鑫<IA>", "s@阶鑫<IAB>", "s@阶鑫<IABC>" _
        )
'========================================================================================
    Call XL算比引擎正程( _
          被研代码:=被研代码 _
        , 被研期类:=被研期类 _
        , 组被研算法:=组被研算法 _
        , 是否外簿:=False _
        , 是否明细:=True _
        )
'========================================================================================
End Function






'########################################################################################
'########################################################################################
'##################################   算比引擎正程   #####################################
'########################################################################################
'########################################################################################
'========================================================================================
'========================================================================================
'正程：对单一代码进行分析
'========================================================================================
'========================================================================================
Function XL算比引擎正程( _
          被研代码 As String _
        , 被研期类 As String _
        , 组被研算法 As Variant _
        , Optional 是否外簿 As Boolean = False _
        , Optional 是否明细 As Boolean = False _
        , Optional 基色底 As Long = 常色研究 _
        ) As Integer
'----------------------------------------------------------------------------------------
    TT = Timer
'========================================================================================
'准备工作簿
'========================================================================================
    Dim wb As Workbook
    If 是否外簿 = False Then
        Set wb = ThisWorkbook
    Else
        Set wb = Workbooks.Add
    End If
'========================================================================================
'统计分析：统算比 统算展
'========================================================================================
    '------------------------------------------------------------------------------------
    '统算比：指定工表
    '------------------------------------------------------------------------------------
    Dim 工表统算比  As Worksheet
    If UTL判断工表存在(常表名统算比) = False Then
        Call PBASE格程工具_表操工表新增(工表统算比, 常表名统算比, 基色底:=基色底)
        工表统算比.Cells.Interior.ColorIndex = 1
    Else
        Set 工表统算比 = ThisWorkbook.Sheets(常表名统算比)
    End If
    
    '格式化
    Call XL算比引擎格程统算比
    '------------------------------------------------------------------------------------
    '统算展：指定工表
    '------------------------------------------------------------------------------------
    Dim 工表统算展  As Worksheet
    If UTL判断工表存在(常表名统算展) = False Then
        Call PBASE格程工具_表操工表新增(工表统算展, 常表名统算展, 基色底:=常色研究)
        工表统算展.Cells.Interior.ColorIndex = 1
    Else
        Set 工表统算展 = ThisWorkbook.Sheets(常表名统算展)
    End If
    
    '统算展：设置隔离边框
    Dim 统算展行始 As Integer
    统算展行始 = PBASE格程工具_表参末行指定(工表统算展, 1) + 1
'========================================================================================
'统算：算法比较
'========================================================================================
    '------------------------------------------------------------------------------------
    '设置工作簿：算法汇总
    '------------------------------------------------------------------------------------
    Dim 表名统算 As String
    表名统算 = 常表名统算比 & "." & 被研期类 & "." & 被研代码
    
    Dim WSTO As Worksheet
    Call PBASE格程工具_表操工表新增(WSTO, 表名统算, wb:=wb, 基色底:=基色底)
    WSTO.Cells.Interior.ColorIndex = 1
    '------------------------------------------------------------------------------------
    '算法比较
    '------------------------------------------------------------------------------------
    Dim 算比类型 As String
    算比类型 = 组被研算法(0)
    Dim 被研表名 As String
    
    '算比类型为粗比：仅进行展示
    If 算比类型 = 常算比类型为粗比 Then
        '--------------------------------------------------------------------------------
        '算法粗比
        '--------------------------------------------------------------------------------
        Dim 被研算法 As String
        
        Dim i As Integer
        For i = LBound(组被研算法) + 1 To UBound(组被研算法)
            被研算法 = 组被研算法(i)
            被研表名 = ""
            
            '根据算法前缀调用(单期/跨期)
            If XL算灌引擎判断算法类型(被研算法) = 常算法类型为单期 Then
                If 是否明细 = True Then 被研表名 = 常簿缀研究 & "1." & 被研期类 & i
                
                Call XL算比质程单期粗比( _
                      被研代码:=被研代码 _
                    , 被研期类:=被研期类 _
                    , 被研算法:=被研算法 _
                    , WSTO:=WSTO, 被研表名:=被研表名, wb:=wb, 基色底:=基色底 _
                    )
            ElseIf XL算灌引擎判断算法类型(被研算法) = 常算法类型为跨期 Then
                If 是否明细 = True Then 被研表名 = 常簿缀研究 & "3." & 被研期类 & i
                
                Call XL算比质程乾期粗比( _
                      被研代码:=被研代码 _
                    , 被研期类:=被研期类 _
                    , 被研算法:=被研算法 _
                    , WSTO:=WSTO, 被研表名:=被研表名, wb:=wb, 基色底:=基色底 _
                    )
            End If
        Next
        '--------------------------------------------------------------------------------
    Else
        '--------------------------------------------------------------------------------
        '算法精比
        '--------------------------------------------------------------------------------
        Dim 被研算法挑版 As String
        Dim 被研算法冠版 As String
        被研算法挑版 = 组被研算法(1)
        被研算法冠版 = 组被研算法(2)
       
        If XL算灌引擎判断算法类型(被研算法挑版) = 常算法类型为单期 _
        And XL算灌引擎判断算法类型(被研算法冠版) = 常算法类型为单期 _
        Then
            If 是否明细 = True Then
                被研表名 = 常簿缀研究 & "2." & 被研期类 & "." & 被研代码
            Else
                被研表名 = 常簿缀研究 & "2." & 被研期类 & "." & 被研代码
            End If
            Call XL算比质程单期精比( _
                  被研代码:=被研代码 _
                , 被研期类:=被研期类 _
                , 被研算法挑版:=被研算法挑版 _
                , 被研算法冠版:=被研算法冠版 _
                , WSTO:=WSTO, 被研表名:=被研表名, wb:=wb, 基色底:=基色底 _
                )
        ElseIf XL算灌引擎判断算法类型(被研算法挑版) = 常算法类型为跨期 _
        And XL算灌引擎判断算法类型(被研算法冠版) = 常算法类型为跨期 _
        Then
            If 是否明细 = True Then
                被研表名 = 常簿缀研究 & "6." & 被研期类 & "." & 被研代码
            Else
                被研表名 = 常簿缀研究 & "6." & 被研期类 & "." & 被研代码
            End If
            Call XL算比质程乾期精比( _
                  被研代码:=被研代码 _
                , 被研期类:=被研期类 _
                , 被研算法挑版:=被研算法挑版 _
                , 被研算法冠版:=被研算法冠版 _
                , WSTO:=WSTO, 被研表名:=被研表名, wb:=wb, 基色底:=基色底 _
                )
        Else
            Debug.Print "提供同类算法类型用于精比！"
        End If
        '--------------------------------------------------------------------------------
    End If
    '------------------------------------------------------------------------------------
    '清理
    '------------------------------------------------------------------------------------
    WSTO.Columns.AutoFit
    Call PBASE格程工具_表冻结锁定(WSTO, 2)
'========================================================================================
'统计分析汇总
'========================================================================================
    '------------------------------------------------------------------------------------
    '统算展：格式化
    '------------------------------------------------------------------------------------
    Dim 统算展行终 As Integer
    统算展行终 = PBASE格程工具_表参末行指定(工表统算展, 1)
    
    With 工表统算展.Cells(统算展行始, 1).Resize(1, 位统算展列数汇总)
        With .Borders(xlTop)
            .LineStyle = xlContinuous
            .ColorIndex = 56
            .Weight = xlMedium
        End With
    End With
    With 工表统算展.Cells(统算展行终, 1).Resize(1, 位统算展列数汇总)
        With .Borders(xlBottom)
            .LineStyle = xlContinuous
            .ColorIndex = 56
            .Weight = xlMedium
        End With
    End With
    
    Dim 被研代称 As String
    被研代称 = 工表统算展.Cells(统算展行终, 位统算展基础代称)
    '------------------------------------------------------------------------------------
    '统算展：获取最值
    '------------------------------------------------------------------------------------
    Dim 值累赚合计最大 As Long
    Dim 值累赚均次最大 As Long
    Dim 值累赚均持最大 As Long
    值累赚合计最大 = 工表统算展.Cells(统算展行始, 位统算展累赚合计)
    值累赚均次最大 = 工表统算展.Cells(统算展行始, 位统算展累赚均次)
    值累赚均持最大 = 工表统算展.Cells(统算展行始, 位统算展累赚均持)
    Dim k As Integer
    For k = 统算展行始 To 统算展行终
        If 工表统算展.Cells(k, 位统算展累赚合计) > 值累赚合计最大 Then
            值累赚合计最大 = 工表统算展.Cells(k, 位统算展累赚合计)
        End If
        If 工表统算展.Cells(k, 位统算展累赚均次) > 值累赚均次最大 Then
            值累赚均次最大 = 工表统算展.Cells(k, 位统算展累赚均次)
        End If
        If 工表统算展.Cells(k, 位统算展累赚均持) > 值累赚均持最大 Then
            值累赚均持最大 = 工表统算展.Cells(k, 位统算展累赚均持)
        End If
    Next k
    
    Dim 定位行累赚合计最大 As Integer
    Dim 定位行累赚均次最大 As Integer
    Dim 定位行累赚均持最大 As Integer
    Dim 定位行累赚合计最大 As Integer
    Dim 定位行累赚均次最大 As Integer
    Dim 定位行累赚均持最大 As Integer
    For k = 统算展行始 To 统算展行终
        If 工表统算展.Cells(k, 位统算展累赚合计) = 值累赚合计最大 Then
            工表统算展.Cells(k, 位统算展累涨合计).Font.ColorIndex = 3
            工表统算展.Cells(k, 位统算展累赚合计).Font.ColorIndex = 3
            定位行累赚合计最大 = k
        End If
        If 工表统算展.Cells(k, 位统算展累赚均次) = 值累赚均次最大 Then
            工表统算展.Cells(k, 位统算展累赚均次).Font.ColorIndex = 3
            定位行累赚均次最大 = k
        End If
        If 工表统算展.Cells(k, 位统算展累赚均持) = 值累赚均持最大 Then
            工表统算展.Cells(k, 位统算展累赚均持).Font.ColorIndex = 3
            定位行累赚均持最大 = k
        End If
    Next k
    '------------------------------------------------------------------------------------
    '统算比：输出
    '------------------------------------------------------------------------------------
    Dim 统算比目行 As Integer
    统算比目行 = PBASE格程工具_表参末行指定(工表统算比, 1) + 1
    '------------------------------------------------------------------------------------
    工表统算比.Rows(统算比目行).Font.ColorIndex = 44
    
    工表统算比.Cells(统算比目行, 位统算比基础代码) = 工表统算展.Cells(统算展行终, 位统算展基础代码)
    工表统算比.Cells(统算比目行, 位统算比基础代码).Font.ColorIndex = 43
    工表统算比.Cells(统算比目行, 位统算比基础代称) = 工表统算展.Cells(统算展行终, 位统算展基础代称)
    工表统算比.Cells(统算比目行, 位统算比基础代称).Font.ColorIndex = 43
    工表统算比.Cells(统算比目行, 位统算比基础期类) = 工表统算展.Cells(统算展行终, 位统算展基础期类)
    工表统算比.Cells(统算比目行, 位统算比基础期类).Font.ColorIndex = 43
    '------------------------------------------------------------------------------------
    '统算比：记录最值
    '------------------------------------------------------------------------------------
    k = 定位行累赚均次最大
        工表统算比.Cells(统算比目行, 位统算比次门算法名称) = 工表统算展.Cells(k, 位统算展算法名称)
        工表统算比.Cells(统算比目行, 位统算比次门累赚均次最大) = 工表统算展.Cells(k, 位统算展累赚均次)
        工表统算比.Cells(统算比目行, 位统算比次门累赚均次最大).Font.Bold = True
        工表统算比.Cells(统算比目行, 位统算比次门累赚合计最大) = 工表统算展.Cells(k, 位统算展累赚合计)
        工表统算比.Cells(统算比目行, 位统算比次门累涨合计最大) = 工表统算展.Cells(k, 位统算展累涨合计)
        工表统算比.Cells(统算比目行, 位统算比次门累涨合计最大).Font.ColorIndex = 35
        工表统算比.Cells(统算比目行, 位统算比次门总持) = 工表统算展.Cells(k, 位统算展总持)
        工表统算比.Cells(统算比目行, 位统算比次门总持).Font.ColorIndex = 35
        工表统算比.Cells(统算比目行, 位统算比次门总次) = 工表统算展.Cells(k, 位统算展总次)
        工表统算比.Cells(统算比目行, 位统算比次门算法胜率) = 工表统算展.Cells(k, 位统算展算法胜率)
        工表统算比.Cells(统算比目行, 位统算比次门算法胜率).Font.ColorIndex = 37
        工表统算比.Cells(统算比目行, 位统算比次门次年比率) = 工表统算展.Cells(k, 位统算展总次) / 工表统算展.Cells(k, 位统算展龄年)
        工表统算比.Cells(统算比目行, 位统算比次门次年比率).Font.ColorIndex = 15
    
    k = 定位行累赚均持最大
        工表统算比.Cells(统算比目行, 位统算比持门算法名称) = 工表统算展.Cells(k, 位统算展算法名称)
        工表统算比.Cells(统算比目行, 位统算比持门累赚均持最大) = 工表统算展.Cells(k, 位统算展累赚均持)
        工表统算比.Cells(统算比目行, 位统算比持门累赚均持最大).Font.Bold = True
        工表统算比.Cells(统算比目行, 位统算比持门累赚合计最大) = 工表统算展.Cells(k, 位统算展累赚合计)
        工表统算比.Cells(统算比目行, 位统算比持门累涨合计最大) = 工表统算展.Cells(k, 位统算展累涨合计)
        工表统算比.Cells(统算比目行, 位统算比持门累涨合计最大).Font.ColorIndex = 35
        工表统算比.Cells(统算比目行, 位统算比持门总持) = 工表统算展.Cells(k, 位统算展总持)
        工表统算比.Cells(统算比目行, 位统算比持门总次) = 工表统算展.Cells(k, 位统算展总次)
        工表统算比.Cells(统算比目行, 位统算比持门总次).Font.ColorIndex = 37
        工表统算比.Cells(统算比目行, 位统算比持门算法胜率) = 工表统算展.Cells(k, 位统算展算法胜率)
        工表统算比.Cells(统算比目行, 位统算比持门算法胜率).Font.ColorIndex = 37
        工表统算比.Cells(统算比目行, 位统算比持门持年比率) = 工表统算展.Cells(k, 位统算展总持) / 工表统算展.Cells(k, 位统算展龄年)
        工表统算比.Cells(统算比目行, 位统算比持门持年比率).Font.ColorIndex = 15
    
    k = 定位行累赚合计最大
        工表统算比.Cells(统算比目行, 位统算比龄门算法名称) = 工表统算展.Cells(k, 位统算展算法名称)
        工表统算比.Cells(统算比目行, 位统算比龄门累赚均年最大) = CInt(工表统算展.Cells(k, 位统算展累赚合计) / 工表统算展.Cells(统算展行终, 位统算展龄年))
        工表统算比.Cells(统算比目行, 位统算比龄门累赚均年最大).Font.ColorIndex = 43
        工表统算比.Cells(统算比目行, 位统算比龄门累赚均年最大).Font.Bold = True
        工表统算比.Cells(统算比目行, 位统算比总年) = 工表统算展.Cells(统算展行终, 位统算展龄年)
        工表统算比.Cells(统算比目行, 位统算比总年).Font.ColorIndex = 43
        工表统算比.Cells(统算比目行, 位统算比龄门累赚均龄最大) = CInt(工表统算展.Cells(k, 位统算展累赚合计) / 工表统算展.Cells(统算展行终, 位统算展龄日))
        工表统算比.Cells(统算比目行, 位统算比龄门累赚均龄最大).Font.Bold = True
        工表统算比.Cells(统算比目行, 位统算比总龄) = 工表统算展.Cells(统算展行终, 位统算展龄日)
        工表统算比.Cells(统算比目行, 位统算比龄门累赚合计最大) = 工表统算展.Cells(k, 位统算展累赚合计)
        工表统算比.Cells(统算比目行, 位统算比龄门累涨合计最大) = 工表统算展.Cells(k, 位统算展累涨合计)
        工表统算比.Cells(统算比目行, 位统算比龄门累涨合计最大).Font.ColorIndex = 35
        工表统算比.Cells(统算比目行, 位统算比龄门总持) = 工表统算展.Cells(k, 位统算展总持)
        工表统算比.Cells(统算比目行, 位统算比龄门总持).Font.ColorIndex = 35
        工表统算比.Cells(统算比目行, 位统算比龄门总次) = 工表统算展.Cells(k, 位统算展总次)
        工表统算比.Cells(统算比目行, 位统算比龄门总次).Font.ColorIndex = 37
        工表统算比.Cells(统算比目行, 位统算比龄门算法胜率) = 工表统算展.Cells(k, 位统算展算法胜率)
        工表统算比.Cells(统算比目行, 位统算比龄门算法胜率).Font.ColorIndex = 37
    '------------------------------------------------------------------------------------
    工表统算展.Columns.AutoFit
    Call PBASE格程工具_表冻结锁定(工表统算展, 1)
    Set 工表统算展 = Nothing
    '------------------------------------------------------------------------------------
    工表统算比.Activate
    工表统算比.Columns.AutoFit
    Call PBASE格程工具_表冻结锁定(工表统算比, 2)
    Set 工表统算比 = Nothing
'========================================================================================
'保存：外部存档
'========================================================================================
    Dim 工簿简称 As String
    工簿简称 = 表名统算
    工簿简称 = 工簿简称 & "." & 被研代称
    工簿简称 = VBA.Replace(工簿简称, "*", "")
    '------------------------------------------------------------------------------------
    '进行保存
    '------------------------------------------------------------------------------------
    If wb.Name <> ThisWorkbook.Name Then
        MSG = MSG & vbCrLf & PBASE格程工具_表操保存外簿(wb, 工簿简称)
        'WB.Close
    End If
    '------------------------------------------------------------------------------------
    Set wb = Nothing
'========================================================================================
'返回
'========================================================================================
    XL算比引擎正程 = CInt(Timer - TT)
'========================================================================================
End Function





'========================================================================================
'========================================================================================
'功能：设置统算比的格式
'========================================================================================
'========================================================================================
Function XL算比引擎格程统算比(Optional 基色底 As Long = 常色四靛) As Boolean
'========================================================================================
'鉴别宿主
'========================================================================================
    Dim 工表统算比  As Worksheet
    If UTL判断工表存在(常表名统算比) = False Then
        Call PBASE格程工具_表操工表新增(工表统算比, 常表名统算比, 基色底:=基色底)
        工表统算比.Cells.Interior.ColorIndex = 1
    Else
        Set 工表统算比 = ThisWorkbook.Sheets(常表名统算比)
    End If
'========================================================================================
'格式化
'========================================================================================
    Dim 当行 As Integer
    '------------------------------------------------------------------------------------
    '合并行标题
    '------------------------------------------------------------------------------------
    当行 = 1
    With 工表统算比.Cells(当行, 1).Resize(1, 位统算比全部列数)
        .VerticalAlignment = xlTop
        .HorizontalAlignment = xlCenter
        .Interior.Color = 基色底
        .Interior.TintAndShade = -0.5
        .Font.Color = 基色底
        .Font.TintAndShade = 0.5
        .Font.Bold = True
        .Font.Size = 20
    End With
    With 工表统算比.Cells(当行, 1).Resize(1, 位统算比基础列数)
        .UnMerge
        .ClearContents
        .Merge
        .Value = "基础"
        With .EntireColumn
            With .Borders(xlEdgeLeft)
                .LineStyle = xlContinuous
                .Color = 常色主靛 ' 基色底
                .Weight = xlMedium
            End With
        End With
    End With
    With 工表统算比.Cells(当行, 位统算比次门列始).Resize(1, 位统算比次门列数)
        .UnMerge
        .ClearContents
        .Merge
        .Value = "次门"
        With .EntireColumn
            With .Borders(xlEdgeLeft)
                .LineStyle = xlContinuous
                .Color = 常色主靛 ' 基色底
                .Weight = xlMedium
            End With
        End With
    End With
    With 工表统算比.Cells(当行, 位统算比持门列始).Resize(1, 位统算比持门列数)
        .UnMerge
        .ClearContents
        .Merge
        .Value = "持门"
        With .EntireColumn
            With .Borders(xlEdgeLeft)
                .LineStyle = xlContinuous
                .Color = 常色主靛 ' 基色底
                .Weight = xlMedium
            End With
        End With
    End With
    With 工表统算比.Cells(当行, 位统算比龄门列始).Resize(1, 位统算比龄门列数)
        .UnMerge
        .ClearContents
        .Merge
        .Value = "龄门"
        With .EntireColumn
            With .Borders(xlEdgeLeft)
                .LineStyle = xlContinuous
                .Color = 常色主靛 ' 基色底
                .Weight = xlMedium
            End With
            With .Borders(xlEdgeRight)
                .LineStyle = xlContinuous
                .Color = 常色主靛
                .Weight = xlMedium
            End With
        End With
    End With
    '------------------------------------------------------------------------------------
    '具体行标题
    '------------------------------------------------------------------------------------
    当行 = 2
    With 工表统算比
        '--------------------------------------------------------------------------------
        With .Cells(当行, 1).Resize(1, 位统算比全部列数)
            .VerticalAlignment = xlTop
            .HorizontalAlignment = xlRight
            .Interior.Color = 基色底
            .Interior.TintAndShade = -0.5
            .Font.Color = 基色底
            .Font.TintAndShade = 0
            .Font.Bold = True
        End With
        '--------------------------------------------------------------------------------
        .Cells(当行, 位统算比基础代码) = "代码"
        .Cells(当行, 位统算比基础代码).HorizontalAlignment = xlLeft
        .Cells(当行, 位统算比基础代称) = "代称"
        .Cells(当行, 位统算比基础代称).HorizontalAlignment = xlLeft
        .Cells(当行, 位统算比基础期类) = "期类"
        .Cells(当行, 位统算比基础期类).HorizontalAlignment = xlLeft
        .Cells(当行, 位统算比总年) = "总年"
        .Cells(当行, 位统算比总龄) = "总龄"
       
        .Cells(当行, 位统算比次门算法名称) = "算法" & vbCrLf & "名称"
        .Cells(当行, 位统算比次门算法名称).HorizontalAlignment = xlLeft
        .Cells(当行, 位统算比次门累赚均次最大) = "最大" & vbCrLf & "累赚" & vbCrLf & "均次"
        .Cells(当行, 位统算比次门累赚合计最大) = "最大" & vbCrLf & "累赚" & vbCrLf & "合计"
        .Cells(当行, 位统算比次门累涨合计最大) = "最大" & vbCrLf & "累涨" & vbCrLf & "合计"
        .Cells(当行, 位统算比次门总持) = "总持"
        .Cells(当行, 位统算比次门总次) = "总次"
        .Cells(当行, 位统算比次门算法胜率) = "算法" & vbCrLf & "每次" & vbCrLf & "胜率"
        .Cells(当行, 位统算比次门次年比率) = "次年" & vbCrLf & "比率"
        
        .Cells(当行, 位统算比持门算法名称) = "算法" & vbCrLf & "名称"
        .Cells(当行, 位统算比持门算法名称).HorizontalAlignment = xlLeft
        .Cells(当行, 位统算比持门累赚均持最大) = "最大" & vbCrLf & "累赚" & vbCrLf & "均持"
        .Cells(当行, 位统算比持门累赚合计最大) = "最大" & vbCrLf & "累赚" & vbCrLf & "合计"
        .Cells(当行, 位统算比持门累涨合计最大) = "最大" & vbCrLf & "累涨" & vbCrLf & "合计"
        .Cells(当行, 位统算比持门总持) = "总持"
        .Cells(当行, 位统算比持门总次) = "总次"
        .Cells(当行, 位统算比持门算法胜率) = "算法" & vbCrLf & "每次" & vbCrLf & "胜率"
        .Cells(当行, 位统算比持门持年比率) = "持年" & vbCrLf & "比率"
        
        .Cells(当行, 位统算比龄门算法名称) = "算法" & vbCrLf & "名称"
        .Cells(当行, 位统算比龄门算法名称).HorizontalAlignment = xlLeft
        .Cells(当行, 位统算比龄门累赚均年最大) = "最大" & vbCrLf & "累赚" & vbCrLf & "均年"
        .Cells(当行, 位统算比龄门累赚均龄最大) = "最大" & vbCrLf & "累赚" & vbCrLf & "均龄"
        .Cells(当行, 位统算比龄门累赚合计最大) = "最大" & vbCrLf & "累赚" & vbCrLf & "合计"
        .Cells(当行, 位统算比龄门累涨合计最大) = "最大" & vbCrLf & "累涨" & vbCrLf & "合计"
        .Cells(当行, 位统算比龄门总持) = "总持"
        .Cells(当行, 位统算比龄门总次) = "总次"
        .Cells(当行, 位统算比龄门算法胜率) = "算法" & vbCrLf & "每次" & vbCrLf & "胜率"
        '--------------------------------------------------------------------------------
    End With
    '------------------------------------------------------------------------------------
    '列格式
    '------------------------------------------------------------------------------------
    工表统算比.Columns(位统算比总年).NumberFormatLocal = 全设格式of零位
    
    工表统算比.Columns(位统算比次门累涨合计最大).NumberFormatLocal = 全设格式of百分
    工表统算比.Columns(位统算比持门累涨合计最大).NumberFormatLocal = 全设格式of百分
    工表统算比.Columns(位统算比龄门累涨合计最大).NumberFormatLocal = 全设格式of百分
    
    工表统算比.Columns(位统算比次门算法胜率).NumberFormatLocal = 全设格式of百分
    工表统算比.Columns(位统算比持门算法胜率).NumberFormatLocal = 全设格式of百分
    工表统算比.Columns(位统算比龄门算法胜率).NumberFormatLocal = 全设格式of百分
    
    工表统算比.Columns(位统算比次门次年比率).NumberFormatLocal = 全设格式of一位
    工表统算比.Columns(位统算比持门持年比率).NumberFormatLocal = 全设格式of零位
    '------------------------------------------------------------------------------------
    工表统算比.Columns.ColumnWidth = 20
    工表统算比.Rows.AutoFit
    工表统算比.Columns.AutoFit
'========================================================================================
End Function
'########################################################################################
'########################################################################################
'##################################   算比引擎正程   #####################################
'########################################################################################
'########################################################################################









'########################################################################################
'########################################################################################
'############################   算比引擎  统算展精比     ##################################
'########################################################################################
'########################################################################################
'========================================================================================
'========================================================================================
'功能：统算展中【同代码】【同期类】算法进行精比
'========================================================================================
'========================================================================================
Sub XL算比引擎特程统算展精比()
'========================================================================================
'基础设置
'========================================================================================
    Dim 是否外簿 As Boolean
    是否外簿 = False
    Dim 是否明细 As Boolean
    是否明细 = Not 是否外簿
'========================================================================================
'获取信息
'========================================================================================
    '------------------------------------------------------------------------------------
    '鉴别宿主
    '------------------------------------------------------------------------------------
    With ActiveSheet
        If .Name <> "统算展" Then
            MsgBox "NP"
            Exit Sub
        End If
    End With
    
    Dim WSAS As Worksheet
    Set WSAS = ActiveSheet
    '------------------------------------------------------------------------------------
    '遍历文件获取代码列表
    '------------------------------------------------------------------------------------
    Dim 代码 As String
    Dim 期类 As String
    Dim 算法 As String
    Dim 集选定代码 As New Collection
    Dim 集选定期类 As New Collection
    Dim 集选定算法 As New Collection
    
    On Error Resume Next
    Dim 行号遍历 As Integer
    For 行号遍历 = 2 To PBASE格程工具_表参末行指定(WSAS, 1)
        If Intersect(WSAS.Rows(行号遍历), Selection) Is Nothing Then
        Else
            代码 = WSAS.Cells(行号遍历, 位统算展基础代码).Value
            期类 = WSAS.Cells(行号遍历, 位统算展基础期类).Value
            算法 = WSAS.Cells(行号遍历, 位统算展算法名称).Value
            '针对代码
            If UBCID是代码(代码) = True Then
                集选定代码.Add Item:=代码, Key:=代码
                集选定期类.Add Item:=期类, Key:=期类
                集选定算法.Add Item:=算法, Key:=算法
            End If
        End If
    Next
    On Error GoTo 0
    '------------------------------------------------------------------------------------
    Set WSAS = Nothing
'========================================================================================
'进行分析
'========================================================================================
    If 集选定算法.Count >= 2 _
    Or 集选定代码.Count = 1 _
    Or 集选定期类.Count = 1 _
    Then
        Dim 被研代码 As String
        被研代码 = 集选定代码(1)
        Dim 被研期类 As String
        被研期类 = 集选定期类(1)
        Dim 组被研算法 As Variant
        组被研算法 = Array("二次精选", 集选定算法(1), 集选定算法(2))
    
        Call XL算比引擎正程( _
              被研代码 _
            , 被研期类 _
            , 组被研算法 _
            , 是否外簿:=是否外簿 _
            , 是否明细:=是否明细 _
        )
    End If
'========================================================================================
End Sub
'########################################################################################
'########################################################################################
'############################   算比引擎  统算展精比     ##################################
'########################################################################################
'########################################################################################





'更大待办工程：将OS拆为两部分，一部分为基本信息，另一部分为操作系统。针对基本信息可以有不同的操作系统





'########################################################################################
'########################################################################################
'##################################     粗比基程     #####################################
'########################################################################################
'########################################################################################
'========================================================================================
'========================================================================================
'算法对比：单期算法
'被研表名：作为是否进行输出的标志
'========================================================================================
'========================================================================================
Function XL算比质程单期粗比( _
          被研代码 As String _
        , 被研期类 As String _
        , 被研算法 As String _
        , WSTO As Worksheet _
        , Optional 被研表名 As String _
        , Optional wb As Workbook _
        , Optional 基色底 As Long = 常色研究 _
        ) As Integer
'========================================================================================
'数据准备
'========================================================================================
    '====================================================================================
    '数据导入
    '====================================================================================
    Dim ARRLA As Variant
    Dim 计数导入 As Integer
    计数导入 = XL算展数程单期(ARRLA, 被研代码, 被研期类)
    If 计数导入 < 1 Then Exit Function
    '====================================================================================
    '算法灌入
    '====================================================================================
    Call XL算灌引擎单期(ARRLA, 规则算法:=被研算法)
'========================================================================================
'明细输出：是否选择输出
'========================================================================================
    If Len(被研表名) > 0 Then
        '------------------------------------------------------------------------------------
        '建表
        '------------------------------------------------------------------------------------
        Dim WS As Worksheet
        Call PBASE格程工具_表操工表新增(WS, 被研表名, wb:=wb, 基色底:=基色底)
        '------------------------------------------------------------------------------------
        '输出算法明细
        '------------------------------------------------------------------------------------
        Call XL算展格程单期(ARRLA, WS, 基色底:=基色底)
        '------------------------------------------------------------------------------------
    End If
'========================================================================================
'统计分析
'========================================================================================
    Dim 列统算展 As Integer
    列统算展 = PBASE格程工具_表参末列指定(WSTO, 1)
    列统算展 = IIf(列统算展 = 1, 1, 列统算展 + 1)
    '------------------------------------------------------------------------------------
    '算法分析
    '------------------------------------------------------------------------------------
    列统算展 = XL算展统算展基程(ARRLA, 花偏甲道, WSTO, 1, 列统算展, WSIN:=WS)
'========================================================================================
'返回
'========================================================================================
    Set WS = Nothing
    Erase ARRLA
End Function


    
'========================================================================================
'========================================================================================
'算法对比：单期算法
'========================================================================================
'========================================================================================
Function XL算比质程乾期粗比( _
          被研代码 As String _
        , 被研期类 As String _
        , 被研算法 As String _
        , WSTO As Worksheet _
        , Optional 被研表名 As String _
        , Optional wb As Workbook _
        , Optional 基色底 As Long = 常色研究 _
        ) As Integer
'========================================================================================
'数据准备
'========================================================================================
    '====================================================================================
    '数据导入
    '====================================================================================
    Dim ARRLLLX As Variant
    Dim 计数导入 As Integer
    计数导入 = XL算展数程跨期(ARRLLLX, 被研代码)
    If 计数导入 < 1 Then Exit Function
    '====================================================================================
    '算法灌入
    '====================================================================================
    Call XL算灌引擎跨期(ARRLLLX, 规则算法:=被研算法)
'========================================================================================
'明细输出：是否选择输出
'========================================================================================
    If Len(被研表名) > 0 Then
        '------------------------------------------------------------------------------------
        '建表
        '------------------------------------------------------------------------------------
        Dim WS As Worksheet
        Call PBASE格程工具_表操工表新增(WS, 被研表名, wb:=wb, 基色底:=基色底)
        '------------------------------------------------------------------------------------
        '输出算法明细
        '------------------------------------------------------------------------------------
        Call XL算展格程跨期(ARRLLLX, WS, 基色底:=基色底)
        '------------------------------------------------------------------------------------
    End If
'========================================================================================
'统计分析
'========================================================================================
    Dim 列统算展 As Integer
    列统算展 = PBASE格程工具_表参末列指定(WSTO, 1)
    列统算展 = IIf(列统算展 = 1, 1, 列统算展 + 1)
    '====================================================================================
    '算法分析：算法对比
    '====================================================================================
    Dim 被研法偏 As Integer
    If 被研期类 = 常期类为周 Then
        被研法偏 = 花偏乙道
    ElseIf 被研期类 = 常期类为日 Then
        被研法偏 = 花偏甲道
    End If
    
    列统算展 = XL算展统算展基程(ARRLLLX, 被研法偏, WSTO, 1, 列统算展, WSIN:=WS)
'========================================================================================
'返回
'========================================================================================
    Set WS = Nothing
    Erase ARRLLLX
End Function
'########################################################################################
'########################################################################################
'##################################     粗比基程     #####################################
'########################################################################################
'########################################################################################












'研究两个问题：
'一是月线为什么会中断，是否存在上升区间的组合被忽视的情况
'而是如何提高  长短共振 情况下的准确率

'待修改：分析月线站上JB之后，获取稳定收益的概率
'========================================================================================
'========================================================================================
'算法对比：跨期
'========================================================================================
'========================================================================================
Function XL算比质程跨期精比测试()
    '------------------------------------------------------------------------------------
    Dim 被研算法挑版 As String
    Dim 被研算法冠版 As String
    被研算法挑版 = "跨阶严格"
    被研算法冠版 = "T@阶<IA>@阶丑@阶丑"
    '------------------------------------------------------------------------------------
    Dim 代码 As String
    '代码 = "sh000001"
    代码 = "sz399006"
    '代码 = "sz300018"
    代码 = "sh600150"
    '------------------------------------------------------------------------------------
    Call XLANA算法精比正程( _
          代码:=代码 _
        , 被研期类:=True _
        , 被研算法挑版:=被研算法挑版 _
        , 被研算法冠版:=被研算法冠版 _
        , 是否外簿:=False _
        )
    '------------------------------------------------------------------------------------
End Function
'########################################################################################
'########################################################################################
'结论：
'########################################################################################
'########################################################################################






'========================================================================================
'========================================================================================
'算法对比：单期
'========================================================================================
'========================================================================================
 Private Sub XL算比质程单期精比测试()
    '------------------------------------------------------------------------------------
    Dim 被研算法挑版 As String
    Dim 被研算法冠版 As String
    被研算法挑版 = "s@阶鑫<IA>"
    被研算法冠版 = "s@阶丑"
    '------------------------------------------------------------------------------------
    Dim 代码 As String
    代码 = "sh600150"
    '------------------------------------------------------------------------------------
    Call XL算比质程单期精比( _
          被研代码:=代码 _
        , 被研期类:=常期类为月 _
        , 被研算法挑版:=被研算法挑版 _
        , 被研算法冠版:=被研算法冠版 _
        , 是否外簿:=False _
        )
    '------------------------------------------------------------------------------------
End Sub
'########################################################################################
'########################################################################################
'结论：
'########################################################################################
'########################################################################################
'进行循环跑，遍历一系列老代码，判断是否

    

'########################################################################################
'########################################################################################
'##################################     精比基程     #####################################
'########################################################################################
'########################################################################################
'========================================================================================
'========================================================================================
'算法对比：单期算法
'========================================================================================
'========================================================================================
Function XL算比质程单期精比( _
          被研代码 As String _
        , 被研期类 As String _
        , 被研算法挑版 As String _
        , 被研算法冠版 As String _
        , WSTO As Worksheet _
        , Optional 被研表名 As String _
        , Optional wb As Workbook _
        , Optional 基色底 As Long = 常色研究 _
        ) As Integer
'----------------------------------------------------------------------------------------
    Dim 基列 As Integer
    基列 = 1
'========================================================================================
'数据准备
'========================================================================================
    '====================================================================================
    '数据导入
    '====================================================================================
    Dim ARRLA As Variant
    Dim 计数导入 As Integer
    计数导入 = XL算展数程单期(ARRLA, 被研代码, 被研期类)
    
    If 计数导入 < 1 Then Exit Function
    '====================================================================================
    '算法灌入：挑版
    '====================================================================================
    Call XL算灌引擎单期(ARRLA, 规则算法:=被研算法挑版)
    '====================================================================================
    '算法灌入：冠版
    '====================================================================================
    Dim ARRLB As Variant
    ARRLB = ARRLA
    Call XL算灌引擎单期(ARRLB, 规则算法:=被研算法冠版)
    '====================================================================================
    '数程合并
    '====================================================================================
    Dim ARRLL As Variant
    ARRLL = ARRLA
    Call STBASE罗盘数程_OS按日墨汁数程基程(ARRLL, ARRLB)
'========================================================================================
'明细输出：整合输出
'========================================================================================
    '====================================================================================
    '建表
    '====================================================================================
    Dim WS As Worksheet
    Call PBASE格程工具_表操工表新增(WS, 被研表名, wb:=wb, 基色底:=基色底)
    '====================================================================================
    '输出算法明细
    '====================================================================================
    Call UTL数据转换_集ARR2WS(ARRLL, WS, 2, 基列)
    Erase ARRLL
    '====================================================================================
    '格式化：基础
    '====================================================================================
    Call PBASE格程工具_表冻结锁定(WS, 1)
    '------------------------------------------------------------------------------------
    Dim 列定位 As Integer
    列定位 = 基列
    列定位 = IQQQ跨码展擎_按列OS区域(WS, 列定位, 基色底:=基色底, 基色调:=0)
    列定位 = IQQQ跨码展擎_按列OS区域(WS, 列定位, 基色底:=基色底, 基色调:=0.6)
    
    WS.Cells(1, 基列).Resize(1, 花宽单道 * 3).EntireColumn.Hidden = True
'========================================================================================
'重组
'========================================================================================
    Dim 重输始列数组 As Variant
    Dim 重输指标数组 As Variant
    '------------------------------------------------------------------------------------
    '重组：索引
    '------------------------------------------------------------------------------------
    重输始列数组 = Array(基列)
    重输指标数组 = Array( _
            Array(位os基累龄, 6), Array(位os结期, 9) _
        )
    列定位 = UG区域格程重组(重输始列数组, 重输指标数组, WS, 列定位)
    Erase 重输指标数组
    Erase 重输始列数组
    '------------------------------------------------------------------------------------
    '重组：持仓对比
    '------------------------------------------------------------------------------------
    重输始列数组 = Array(基列, 基列 + 花宽单道)
    重输指标数组 = Array( _
            Array(位os算法名, 12) _
        , , Array(位os算累持, 4), Array(位os算累赚, 7), Array(位os算今赚, 6), Array(位os算今手, 5), Array(位os算今仓, 4) _
        )
    列定位 = UG区域格程重组(重输始列数组, 重输指标数组, WS, 列定位)
    Erase 重输指标数组
    Erase 重输始列数组
'========================================================================================
'统计分析
'========================================================================================
    Dim 列统算展 As Integer
    列统算展 = PBASE格程工具_表参末列指定(WSTO, 1)
    列统算展 = IIf(列统算展 = 1, 1, 列统算展 + 1)
    '====================================================================================
    '算法分析：算法对比
    '====================================================================================
    列统算展 = XL算展统算展基程(ARRLA, 花偏甲道, WSTO, 1, 列统算展, WSIN:=WS)
    列统算展 = XL算展统算展基程(ARRLB, 花偏甲道, WSTO, 1, 列统算展, WSIN:=WS)
'========================================================================================
'返回
'========================================================================================
    Set WS = Nothing
    Erase ARRLA
    Erase ARRLB
'========================================================================================
End Function



    
    
'将返回值设置为优胜者 的名称
'========================================================================================
'========================================================================================
'算法对比：单期算法
'========================================================================================
'========================================================================================
Function XL算比质程乾期精比( _
          被研代码 As String _
        , 被研期类 As String _
        , 被研算法挑版 As String _
        , 被研算法冠版 As String _
        , WSTO As Worksheet _
        , Optional 被研表名 As String _
        , Optional wb As Workbook _
        , Optional 基色底 As Long = 常色研究 _
        ) As Integer
'----------------------------------------------------------------------------------------
    Dim 基列 As Integer
    基列 = 1
'========================================================================================
'数据准备
'========================================================================================
    '====================================================================================
    '数据导入
    '====================================================================================
    Dim ARRLLLX As Variant
    Dim 计数导入 As Integer
    计数导入 = XL算展数程跨期(ARRLLLX, 被研代码)
    If 计数导入 < 1 Then Exit Function
    '====================================================================================
    '算法灌入：挑版
    '====================================================================================
    Call XL算灌引擎跨期(ARRLLLX, 规则算法:=被研算法挑版)
    '====================================================================================
    '算法灌入：冠版
    '====================================================================================
    Dim ARRLLLY As Variant
    ARRLLLY = ARRLLLX
    Call XL算灌引擎跨期(ARRLLLY, 规则算法:=被研算法冠版)
    '====================================================================================
    '数程合并
    '====================================================================================
    Dim ARRLLLLLL As Variant
    ARRLLLLLL = ARRLLLX
    Call STBASE罗盘数程_OS按日墨汁数程基程(ARRLLLLLL, ARRLLLY)
'========================================================================================
'明细输出：整合输出
'========================================================================================
    '====================================================================================
    '建表
    '====================================================================================
    Dim WS As Worksheet
    Call PBASE格程工具_表操工表新增(WS, 被研表名, wb:=wb, 基色底:=基色底)
    '====================================================================================
    '输出算法明细
    '====================================================================================
    Call UTL数据转换_集ARR2WS(ARRLLLLLL, WS, 2, 基列)
    Erase ARRLLLLLL
    '====================================================================================
    '格式化：基础
    '====================================================================================
    Call PBASE格程工具_表冻结锁定(WS, 1)
    '------------------------------------------------------------------------------------
    Dim 列定位 As Integer
    列定位 = 基列
    列定位 = IQQQ跨码展擎_按列OS区域(WS, 列定位, 基色底:=基色底, 基色调:=0.6)
    列定位 = IQQQ跨码展擎_按列OS区域(WS, 列定位, 基色底:=基色底, 基色调:=0.5)
    列定位 = IQQQ跨码展擎_按列OS区域(WS, 列定位, 基色底:=基色底, 基色调:=0)
    列定位 = IQQQ跨码展擎_按列OS区域(WS, 列定位, 基色底:=基色底, 基色调:=0.6)
    列定位 = IQQQ跨码展擎_按列OS区域(WS, 列定位, 基色底:=基色底, 基色调:=0.5)
    列定位 = IQQQ跨码展擎_按列OS区域(WS, 列定位, 基色底:=基色底, 基色调:=0)
    
    WS.Cells(1, 基列).Resize(1, 花宽单道 * 6).EntireColumn.Hidden = True
    '====================================================================================
    Dim 基列一期 As Integer
    Dim 基列二期 As Integer
    Dim 基列三期 As Integer
    基列一期 = 基列
    基列二期 = 基列 + 花宽单道 * 1
    基列三期 = 基列 + 花宽单道 * 2
    Dim 基列四期 As Integer
    Dim 基列五期 As Integer
    Dim 基列六期 As Integer
    基列四期 = 基列 + 花宽单道 * 3
    基列五期 = 基列 + 花宽单道 * 4
    基列六期 = 基列 + 花宽单道 * 5
'========================================================================================
'格式化：重组
'========================================================================================
    Dim 重输始列数组 As Variant
    Dim 重输指标数组 As Variant
    '------------------------------------------------------------------------------------
    '重组：基本信息
    '------------------------------------------------------------------------------------
    重输指标数组 = Array( _
            Array(位os基累龄, 6), Array(位os结期, 10) _
        )
    重输始列数组 = Array(基列)
    列定位 = UG区域格程重组(重输始列数组, 重输指标数组, WS, 列定位)
    Erase 重输指标数组
    Erase 重输始列数组
    '------------------------------------------------------------
    重输指标数组 = Array( _
            Array(位os结收, 6) _
        , , Array(位os结幅PR0, 6) _
        )
    重输始列数组 = Array( _
          基列三期 _
        , 基列二期 _
        , 基列一期 _
        )
    列定位 = UG区域格程重组(重输始列数组, 重输指标数组, WS, 列定位)
    Erase 重输指标数组
    Erase 重输始列数组
    '------------------------------------------------------------------------------------
    '重组：持仓对比
    '------------------------------------------------------------------------------------
    重输指标数组 = Array( _
            Array(位os算法名, 10) _
        )
    重输始列数组 = Array( _
          基列三期 _
        , 基列六期 _
        )
    列定位 = UG区域格程重组(重输始列数组, 重输指标数组, WS, 列定位)
    Erase 重输指标数组
    Erase 重输始列数组
    '------------------------------------------------------------
    重输始列数组 = Array( _
          基列三期, 基列六期 _
        , 基列二期, 基列五期 _
        , 基列一期, 基列四期 _
        )
    重输指标数组 = Array( _
        Array(位os算累持, 4), Array(位os算累赚, 7), Array(位os算今赚, 6), Array(位os算今手, 5), Array(位os算今仓, 4) _
        )
    列定位 = UG区域格程重组(重输始列数组, 重输指标数组, WS, 列定位)
    Erase 重输指标数组
    Erase 重输始列数组
    '------------------------------------------------------------------------------------
    '重组：BT
    '------------------------------------------------------------------------------------
    重输指标数组 = Array( _
              Array(位osBTZA, 3), Array(位osBTZB, 3), Array(位osBTZC, 3), Array(位osBTAB, 3), Array(位osBTAC, 3), Array(位osBTBC, 3), Array(位osBTAG, 4), Array(位osBTAD, 4), Array(位osBTCG, 4) _
              )
    重输始列数组 = Array(基列三期)
    列定位 = UG区域格程重组(重输始列数组, 重输指标数组, WS, 列定位)
    重输始列数组 = Array(基列二期)
    列定位 = UG区域格程重组(重输始列数组, 重输指标数组, WS, 列定位)
    重输始列数组 = Array(基列一期)
    列定位 = UG区域格程重组(重输始列数组, 重输指标数组, WS, 列定位)
    Erase 重输指标数组
    Erase 重输始列数组
    '------------------------------------------------------------------------------------
    '重组：基本信息
    '------------------------------------------------------------------------------------
    重输指标数组 = Array( _
            Array(位os结幅PR0, 6) _
        , , Array(位os结收, 6) _
        , , Array(位os期类, 2), Array(位os基累龄, 6), Array(位os结期, 10) _
        )
    重输始列数组 = Array( _
          基列三期 _
        , 基列二期 _
        , 基列一期 _
        )
    列定位 = UG区域格程重组(重输始列数组, 重输指标数组, WS, 列定位)
    Erase 重输指标数组
    Erase 重输始列数组
'========================================================================================
'统计分析
'========================================================================================
    Dim 列统算展 As Integer
    列统算展 = PBASE格程工具_表参末列指定(WSTO, 1)
    列统算展 = IIf(列统算展 = 1, 1, 列统算展 + 1)
    '====================================================================================
    '算法分析：算法对比
    '====================================================================================
    Dim 被研法偏 As Integer
    If 被研期类 = 常期类为周 Then
        被研法偏 = 花偏乙道
    ElseIf 被研期类 = 常期类为日 Then
        被研法偏 = 花偏甲道
    End If
    
    列统算展 = XL算展统算展基程(ARRLLLX, 被研法偏, WSTO, 1, 列统算展, WSIN:=WS)
    列统算展 = XL算展统算展基程(ARRLLLY, 被研法偏, WSTO, 1, 列统算展, WSIN:=WS)
'    '====================================================================================
'    '算法分析：算法对比
'    '====================================================================================
'    列统算展 = XL算展统算展基程(ARRLLLX, 花偏丙道, WSTO, 1, 列统算展, WSIN:=WS)
'    列统算展 = XL算展统算展基程(ARRLLLY, 花偏丙道, WSTO, 1, 列统算展, WSIN:=WS)
'    列统算展 = XL算展统算展基程(ARRLLLX, 花偏乙道, WSTO, 1, 列统算展, WSIN:=WS)
'    列统算展 = XL算展统算展基程(ARRLLLY, 花偏乙道, WSTO, 1, 列统算展, WSIN:=WS)
'    列统算展 = XL算展统算展基程(ARRLLLX, 花偏甲道, WSTO, 1, 列统算展, WSIN:=WS)
'    列统算展 = XL算展统算展基程(ARRLLLY, 花偏甲道, WSTO, 1, 列统算展, WSIN:=WS)
'========================================================================================
'返回
'========================================================================================
    Set WS = Nothing
    Erase ARRLLLX
    Erase ARRLLLY
'========================================================================================
End Function
'########################################################################################
'########################################################################################
'##################################     精比基程     #####################################
'########################################################################################
'########################################################################################


