Attribute VB_Name = "ROS据管_DM0花册管理"
Public Const 位列花天CIDL = 1
Public Const 位列花天代称 = 2
Public Const 位列花天市板 = 3
Public Const 位列花天市日 = 4
Public Const 位列花天交易所码 = 5
Public Const 位列花天市场板类 = 6
Public Const 位列花天对应大势 = 7
Public Const 位列花天CIDS = 8
Public Const 位列花天地区新浪 = 9
Public Const 位列花天行业新浪 = 10
'------------
Public Const 位列花天概念益盟 = 11
Public Const 位列花天行业益盟 = 12
Public Const 位列花天是否上证50 = 13
Public Const 位列花天是否中股300 = 14
Public Const 位列花天是否中证500 = 15
Public Const 位列花天是否中证1000 = 16
Public Const 位列花天是否中证2000 = 17
Public Const 位列花天是否成分 = 18
Public Const 位列花天是否创业板50 = 19
Public Const 位列花天是否港股通 = 20
Public Const 位列花天是否MSCI中国 = 21
'------------
Public Const 位列花天仓宝福 = 22
Public Const 位列花天仓宝彦 = 23
Public Const 位列花天仓宝合 = 24
Public Const 位列花天仓周 = 25
'------------
Public Const 位列花天今池 = 26
Public Const 位列花天在池 = 27
'------------
Public Const 位列花天量比 = 28
Public Const 位列花天换手 = 29
Public Const 位列花天交量 = 30
Public Const 位列花天流市 = 31
Public Const 位列花天总市 = 32
Public Const 位列花天停牌 = 33
'========================================================================================
'定义基准列
'【花宽主道】针对花册设定
'【位qt主宽】针对展示设定
'========================================================================================
Public Const 花宽主道 = 52
Public Const 花宽单道 = 位os终基类
Public Const 花宽全道 = 花宽主道 + 花宽单道 * 3
'-----------
Public Const 花列主道 = 1
Public Const 花列甲道 = 花宽主道 + 1
Public Const 花列乙道 = 花宽主道 + 花宽单道 * 1 + 1
Public Const 花列丙道 = 花宽主道 + 花宽单道 * 2 + 1
Public Const 花列统道 = 花宽主道 + 花宽单道 * 3 + 1
'-----------
'以下待删除
Public Const 花偏甲道 = 0
Public Const 花偏乙道 = 花宽单道
Public Const 花偏丙道 = 花宽单道 * 2
'========================================================================================
'Public Const 位qt主宽 = 26

   
'########################################################################################
'花册花天重整操作顺序:
'（1.1）生成黑表Zn以及金银非索引；
'（1.2）导入tushare列表；
'（1.3）导入金银非今黑信息：需要提前保留池黑信息，否则需要全部从益盟导入；
'（2）导入益盟信息；
'（3）导入持仓；
'（4）全新结算；
'########################################################################################
'========================================================================================
'花册：初始化
'========================================================================================
Sub STCALL花册管理_重制花天P1调程导入列表()
    '预备：导出池信息
    MSG = MSG & STBASE池管理_索引基程(实结类型:="cCCC", 是否索引池金:=True, 是否索引池银:=True, 是否索引池铜:=True)
    '导入：导入tushare列表
    MSG = MSG & STCALL花册管理_重制花天P1正程导入列表
    '导入金银非今黑信息：需要提前保留池黑信息，否则需要全部从益盟导入
    MSG = MSG & STCALL花册管理_重制花天P9正程设置信息(是否更新市板:=True, 是否更新在池:=True, 是否更新停牌:=True, 是否更新代称:=True)
    MsgBox MSG, vbOKOnly, "花册导入列表"
End Sub
Sub STCALL花册管理_重制花天P2调程导入益盟()
    MSG = STCALL花册管理_重制花天P2正程导入益盟
    MsgBox MSG, vbOKOnly, "花册导入益盟"
End Sub
'========================================================================================
'导入华宝持仓
'========================================================================================
Sub STCALL花册管理_重制花天P3调程导入仓宝福()
    Dim 计数导入 As Integer
    计数导入 = STCALL花册管理_重制花天P3正程导入华宝(位列花天仓宝福, 是否更新仓周:=False)
    If 计数导入 > 0 Then
        MSG = MSG & STCALL花册管理_重制花天P9正程设置信息(是否更新市板:=True, 是否更新在池:=True, 是否更新停牌:=True, 是否更新代称:=False)
        Call IQQQ乾坤分布调程花天sSCC_仓宝福
        MsgBox MSG, vbOKOnly, "花册导入仓宝福"
    End If
End Sub
Sub STCALL花册管理_重制花天P3调程导入仓宝福周池()
    Dim 计数导入 As Integer
    计数导入 = STCALL花册管理_重制花天P3正程导入华宝(位列花天仓宝福, 是否更新仓周:=True)
    If 计数导入 > 0 Then
        MSG = MSG & STCALL花册管理_重制花天P9正程设置信息(是否更新市板:=True, 是否更新在池:=True, 是否更新停牌:=True, 是否更新代称:=False)
        Call IQQQ乾坤分布调程花天sSCC_仓宝福
        MsgBox MSG, vbOKOnly, "花册导入仓宝福"
    End If
End Sub
Sub STCALL花册管理_重制花天P3调程导入仓宝彦()
    Dim 计数导入 As Integer
    计数导入 = STCALL花册管理_重制花天P3正程导入华宝(位列花天仓宝彦, 是否更新仓周:=False)
    If 计数导入 > 0 Then
        MSG = MSG & STCALL花册管理_重制花天P9正程设置信息(是否更新市板:=True, 是否更新在池:=True, 是否更新停牌:=True, 是否更新代称:=False)
        Call IQQQ乾坤分布调程花天sSCC_仓宝彦
        MsgBox MSG, vbOKOnly, "花册导入持仓宝彦"
    End If
End Sub
Sub STCALL花册管理_重制花天P3调程导入仓宝彦周池()
    Dim 计数导入 As Integer
    计数导入 = STCALL花册管理_重制花天P3正程导入华宝(位列花天仓宝彦, 是否更新仓周:=True)
    If 计数导入 > 0 Then
        MSG = MSG & STCALL花册管理_重制花天P9正程设置信息(是否更新市板:=True, 是否更新在池:=True, 是否更新停牌:=True, 是否更新代称:=False)
        Call IQQQ乾坤分布调程花天sSCC_仓宝彦
        MsgBox MSG, vbOKOnly, "花册导入持仓宝彦"
    End If
End Sub
'========================================================================================
'备用单独调用
'========================================================================================
Sub STCALL花册管理_重制花天P9调程设置信息()
    'MSG = STCALL花册管理_重制花天P9正程设置信息(是否更新市板:=True, 是否更新在池:=True, 是否更新停牌:=True, 是否更新代称:=False)
    MSG = STCALL花册管理_重制花天P9正程设置信息(是否更新市板:=True, 是否更新在池:=True, 是否更新停牌:=True, 是否更新代称:=True)
    MsgBox MSG, vbOKOnly, "花册设置基本信息"
End Sub
'========================================================================================
'########################################################################################
    
    
    
'偈语：类源与HX本是同生
'########################################################################################
'########################################################################################
'##################################     花册管理     ####################################
'########################################################################################
'########################################################################################
'========================================================================================
'========================================================================================
'导入信息：全部股票列表
'导入文件：Tushare basics文件zdata.TSstock
'========================================================================================
'========================================================================================
Private Function STCALL花册管理_重制花天P1正程导入列表() As String
    UTL宏工具_BEGIN
'========================================================================================
'花册：建立
'========================================================================================
    Dim 指定花册 As String
    指定花册 = 常花中股
    Dim WS花册 As Worksheet
    Call PBASE格程工具_表操工表新增(WS花册, 指定花册, wb:=ThisWorkbook, 基色底:=常色四紫)
'========================================================================================
'导入列表：单票
'========================================================================================
    Dim 计数单票 As Integer
    计数单票 = STCALL花册管理_重制花天P1子程导入列表单票(WS花册)
'========================================================================================
'导入列表：指数
'========================================================================================
    Dim 计数指数 As Integer
    计数指数 = STCALL花册管理_重制花天P1子程导入列表指数(WS花册)
'========================================================================================
    UTL宏工具_END
    MSG = MSG & "导入列表" _
            & vbCrLf & "计数单票 >>" & 计数单票 _
            & vbCrLf & "计数指数 >>" & 计数指数 _
            & vbCrLf
    STCALL花册管理_重制花天P1正程导入列表 = MSG
End Function




'========================================================================================
'========================================================================================
'导入信息：益盟行业 益盟概念
'导入文件：益盟信息
'注意：【位列花天概念益盟】删除程序在【STCALL花册工具_控制显示花天】
'========================================================================================
'========================================================================================
Private Function STCALL花册管理_重制花天P2正程导入益盟() As String
'========================================================================================
'验证文件存在
'========================================================================================
'========================================================================================
'益盟：导入文件
'========================================================================================
    Dim FILEOPEN
    'FILEOPEN = Application.GetOpenFilename("益盟信息文件,*.xls", , "请选择益盟信息文件xls", , False)
    '注20260524：从益盟导出文件时，一定要选择csv文件格式，而不要选择xls文件，因为xls会截断字符串（最长为255）。切记！
    FILEOPEN = Application.GetOpenFilename("益盟信息文件,*.csv", , "请选择益盟信息文件csv，不要导出为xls文件（会截断字符串）", , False)
    If FILEOPEN = False Then
        Exit Function
    End If
'========================================================================================
    UTL宏工具_BEGIN
'========================================================================================
    Dim 位列YM代码 As Integer
    Dim 位列YM代称 As Integer
    Dim 位列YM行业益盟 As Integer
    Dim 位列YM概念益盟 As Integer
    '------------------------------------------------------------------------------------
    '导入数组
    '------------------------------------------------------------------------------------
    Dim WBYM As Workbook
    Set WBYM = GetObject(FILEOPEN)
    Dim ARRYM As Variant
    With WBYM.ActiveSheet
        ARRYM = .Range("A1").CurrentRegion
        位列YM代码 = .Rows(1).Find(What:="代码").Column
        位列YM代称 = .Rows(1).Find(What:="A股板块").Column
        位列YM行业益盟 = .Rows(1).Find(What:="行业").Column
        位列YM概念益盟 = .Rows(1).Find(What:="所属概念").Column
    End With
    WBYM.Close False
    Set WBYM = Nothing
'========================================================================================
'益盟：输出中间工作表
'========================================================================================
'    '------------------------------------------------------------------------------------
'    '建立工作簿
'    '------------------------------------------------------------------------------------
'    Dim WSYM As Worksheet
'    Call PBASE格程工具_表操工表新增(WSYM, "IOYM", WB:=ThisWorkbook, 基色底:=常色十红)
'    '------------------------------------------------------------------------------------
'    '输出数组
'    '------------------------------------------------------------------------------------
'    Call UTL数据转换_集ARR2WS(ARRYM, WSYM)
'    '------------------------------------------------------------------------------------
'    '格式化
'    '------------------------------------------------------------------------------------
'    WSYM.Rows(1).Font.Bold = True
'    WSYM.Columns(位列YM代码).NumberFormatLocal = 全设格式of代码
'    WSYM.Columns.AutoFit
'    '------------------------------------------------------------------------------------
'    '按照代码进行排序
'    '------------------------------------------------------------------------------------
'    WSYM.Cells.Sort key1:=WSYM.Cells(1, 位列YM代码), order1:=xlAscending, Header:=xlYes
'    '------------------------------------------------------------------------------------
'    WSYM.Activate
'    ActiveWindow.Zoom = 80
'    Debug.Print WSYM.Cells(65536, 位列YM代码).End(xlUp).Row
'    Set WSYM = Nothing
'========================================================================================
'输入
'========================================================================================
    Dim WS花册 As Worksheet
    If STBASE外簿工具_花册链接(WS花册, 常花中股) = False Then
        UTL宏工具_END
        Exit Function
    End If
    Dim 组花册 As Variant
    Call UTL数据转换_集WS2ARR(组花册, WS花册, 始行:=2, 始列:=1, 总列:=花宽主道)
'========================================================================================
'花册：合并 益盟行业 益盟概念
'========================================================================================
    '------------------------------------------------------------------------------------
    '制作字典
    '------------------------------------------------------------------------------------
    Dim 典集行业益盟 As New Dictionary
    Dim 典集概念益盟 As New Dictionary
    Dim CIDV As Variant
    Dim CIDL As String
    
    Dim R As Integer
    For R = LBound(ARRYM, 1) + 1 To UBound(ARRYM, 1)
        CIDV = ARRYM(R, 位列YM代码)
        CIDL = UBCID规制代码(CIDV)
        典集行业益盟.Add Key:=CIDL, Item:=ARRYM(R, 位列YM行业益盟)
        典集概念益盟.Add Key:=CIDL, Item:=ARRYM(R, 位列YM概念益盟)
    Next R
    Erase ARRYM
    '------------------------------------------------------------------------------------
    '导入
    '------------------------------------------------------------------------------------
    Dim X As Integer
    For X = LBound(组花册, 1) To UBound(组花册, 1)
        '--------------------------------------------------------------------------------
        CIDL = 组花册(X, 位列花天CIDL)
        '--------------------------------------------------------------------------------
        If UBCID是中股票(CIDL) = True Then
                组花册(X, 位列花天行业益盟) = ""
                组花册(X, 位列花天概念益盟) = ""
                If 典集行业益盟.Exists(CIDL) Then
                        组花册(X, 位列花天行业益盟) = 典集行业益盟(CIDL)
                        组花册(X, 位列花天概念益盟) = 典集概念益盟(CIDL)
                End If
                '设置：主要归属
                值概念益盟 = 典集概念益盟(CIDL)
                If Len(值概念益盟) > 0 Then
                        '----------------------------------------------------------------
                        组花册(X, 位列花天是否上证50) = IIf(InStr(值概念益盟, "上证50") > 0, "Y", "")
                        组花册(X, 位列花天是否中股300) = IIf(InStr(值概念益盟, "沪深300") > 0, "Y", "")
                        组花册(X, 位列花天是否中证500) = IIf(InStr(值概念益盟, "中证500") > 0, "Y", "")
                        组花册(X, 位列花天是否中证1000) = IIf(InStr(值概念益盟, "中证1000") > 0, "Y", "")
                        组花册(X, 位列花天是否中证2000) = IIf(InStr(值概念益盟, "中证2000") > 0, "Y", "")
                        组花册(X, 位列花天是否创业板50) = IIf(InStr(值概念益盟, "创业板50") > 0, "Y", "")
                        '----------------------------------------------------------------
                        '注释20240220：由于国家队通过ETF救市，所以对不属于各指数基金的股票进行标注。MSCI中国已经不重要。
                        If InStr(值概念益盟, "上证50") > 0 Then
                            组花册(X, 位列花天是否成分) = "IH"
                        ElseIf InStr(值概念益盟, "沪深300") > 0 Then
                            组花册(X, 位列花天是否成分) = "IF"
                        ElseIf InStr(值概念益盟, "中证500") > 0 Then
                            组花册(X, 位列花天是否成分) = "IC"
                        ElseIf InStr(值概念益盟, "中证1000") > 0 Then
                            组花册(X, 位列花天是否成分) = "Im"
                        ElseIf InStr(值概念益盟, "中证2000") > 0 Then
                            组花册(X, 位列花天是否成分) = "It"
                        Else
                            组花册(X, 位列花天是否成分) = "N"
                        End If
                        '----------------------------------------------------------------
                        If InStr(值概念益盟, "沪股通") > 0 Then
                            组花册(X, 位列花天是否港股通) = "沪"
                        ElseIf InStr(值概念益盟, "深股通") > 0 Then
                            组花册(X, 位列花天是否港股通) = "深"
                        Else
                            组花册(X, 位列花天是否港股通) = ""
                        End If
                         组花册(X, 位列花天是否MSCI中国) = IIf(InStr(值概念益盟, "MSCI中国") > 0, "Y", "")
                       '----------------------------------------------------------------
                End If
        '--------------------------------------------------------------------------------
        ElseIf UBCID是中股指(CIDL) = True Or UBCID是中股基(CIDL) = True Then
                组花册(X, 位列花天行业益盟) = 组花册(X, 位列花天行业新浪)
        End If
        '--------------------------------------------------------------------------------
    Next
    Set 典集行业益盟 = Nothing
    Set 典集概念益盟 = Nothing
'========================================================================================
'输出：花册
'========================================================================================
    Call UTL数据转换_集ARR2WS(组花册, WS花册, 始行:=2, 始列:=1)
    Erase 组花册
    '------------------------------------------------------------------------------------
    '格式化：花册
    '------------------------------------------------------------------------------------
    Call STCALL花册工具_花册格程(WS花册)
    WS花册.Activate
    Set WS花册 = Nothing
'========================================================================================
    UTL宏工具_END
    MSG = "导入益盟信息完成" & vbCrLf
    STCALL花册管理_重制花天P2正程导入益盟 = MSG
End Function




'========================================================================================
'========================================================================================
'功能：1.导入华宝持仓
'========================================================================================
'========================================================================================
Public Function STCALL花册管理_重制花天P3正程导入华宝(Optional 指定列仓 As Integer = 位列花天仓宝福, Optional 是否更新仓周 As Boolean = False) As Integer
'========================================================================================
'注2025061：用于区分是否属于周仓：用于排序。临时仓位排在前面，周仓位排在后面。
'在每周结算日导入周仓，其余交易日导入日仓。在Z陈列时，将日仓放在前面，将周仓放在后面。
'========================================================================================
    '====================================================================================
    '设置：根据仓列确定池
    '====================================================================================
    Dim 值常池名  As String
    If 指定列仓 = 位列花天仓宝福 Then
        值常池名 = 常仓名宝福
    ElseIf 指定列仓 = 位列花天仓宝彦 Then
        值常池名 = 常仓名宝彦
    End If
    '====================================================================================
    '设置：导入验证：周仓只在周五-周日可以导入，其他时间必须人工确认。
    '====================================================================================
    If 是否更新仓周 = True Then
        If Weekday(Date, vbMonday) >= 5 Then
        Else
            是否导入周池 = MsgBox("周池应只在周末进行导入。请确认是否导入？", vbOKCancel, "导入周池" & 值常池名)
            If 是否导入周池 <> vbOK Then Exit Function
        End If
    End If
'========================================================================================
'验证文件存在
'========================================================================================
'========================================================================================
'导入文件：华宝
'========================================================================================
    Dim FILEOPEN
    FILEOPEN = Application.GetOpenFilename("华宝持仓文件,*.xls", , "请选择华宝持仓文件" & 值常池名, , False)
    Debug.Print FILEOPEN
'    Stop
    If FILEOPEN = False Then
        Exit Function
    End If
'========================================================================================
    UTL宏工具_BEGIN
'========================================================================================
'导入数组
'========================================================================================
    Dim 所在区域 As Range
    Dim 位列TS代码 As Integer
    Dim 位列TS代称 As Integer
    Dim 位列TS摊薄成本 As Integer
    Dim 位列TS持仓数量 As Integer
    Dim 位列TS持仓金额 As Integer
    Dim 位列TS交易所名 As Integer
    '-------------------------------
    Application.Calculation = xlCalculationAutomatic
    '注20260610：必须设置这个选项，否则将导致文件导入不正确。
    'Application.Calculation = xlManual（手动计算模式）是导致 ="币种" 显示为 0 的最直接原因：
    '这些 ="..." 在 Excel 里是公式，不是纯文本
    '手动计算模式下，新打开的文件公式不会被自动计算
    '未计算的公式单元格没有缓存值 → 显示为 0
    '-------------------------------
    Dim WBTS As Workbook
    Set WBTS = GetObject(FILEOPEN)
    Dim ARRTS  As Variant
    With WBTS.ActiveSheet
            Set 所在区域 = .Columns(1).Find(What:="证券代码").CurrentRegion
            ARRTS = 所在区域
            位列TS代码 = 所在区域.Rows(1).Find(What:="证券代码").Column
            位列TS代称 = 所在区域.Rows(1).Find(What:="证券名称").Column
            位列TS持仓数量 = 所在区域.Rows(1).Find(What:="证券数量").Column
            位列TS摊薄成本 = 所在区域.Rows(1).Find(What:="摊薄成本").Column
            位列TS持仓金额 = 所在区域.Rows(1).Find(What:="最新市值").Column
            位列TS交易所名 = 所在区域.Rows(1).Find(What:="交易所名称").Column
            Set 所在区域 = Nothing
    End With
    WBTS.Close False
    Set WBTS = Nothing
'========================================================================================
'输入
'========================================================================================
    Dim WS花册 As Worksheet
    If STBASE外簿工具_花册链接(WS花册, 常花中股) = False Then
        UTL宏工具_END
        Exit Function
    End If
    Dim 组花册 As Variant
    Call UTL数据转换_集WS2ARR(组花册, WS花册, 始行:=2, 始列:=1, 总列:=花宽主道)
'========================================================================================
'设置：花册信息
'包括：清除原有持仓信息
'========================================================================================
    '====================================================================================
    '设置
    '====================================================================================
    Dim CIDL As String
    Dim 典集花册行号 As New Dictionary
    For X = LBound(组花册, 1) To UBound(组花册, 1)
        '--------------------------------------------------------------------------------
        CIDL = 组花册(X, 1)
        典集花册行号.Add Item:=X, Key:=CIDL
        '--------------------------------------------------------------------------------
        '清空原有信息：持仓
        '--------------------------------------------------------------------------------
        组花册(X, 指定列仓) = ""
        '--------------------------------------------------------------------------------
        '清空原有信息：仓周。只删除对应仓位的周池记录
        '--------------------------------------------------------------------------------
        If 是否更新仓周 = True Then
            If 组花册(X, 位列花天仓周) = 值常池名 Then 组花册(X, 位列花天仓周) = ""
        End If
        '--------------------------------------------------------------------------------
    Next
'========================================================================================
'常花中股：导入股票列表
'========================================================================================
    Dim CIDV As Variant
    Dim 值持仓数量 As Long
    Dim 值交易所名 As String
    Dim 计数导入 As Integer
    '====================================================================================
    '导入
    '====================================================================================
    计数导入 = 0
    For X = LBound(ARRTS, 1) + 1 To UBound(ARRTS, 1)
        定位花册行号 = 0
        '--------------------------------------------------------------------------------
        '处理代码
        '--------------------------------------------------------------------------------
        CIDV = ARRTS(X, 位列TS代码)
        CIDL = UBCID规制代码(CIDV)
        值持仓数量 = ARRTS(X, 位列TS持仓数量)
        If 值持仓数量 >= 1 Then
            计数导入 = 计数导入 + 1
            值交易所名 = ARRTS(X, 位列TS交易所名)
            If 值交易所名 = "上海A股" Or 值交易所名 = "深圳A股" Or 值交易所名 = "北交所" Then
                If 典集花册行号.Exists(CIDL) = True Then
                    定位花册行号 = 典集花册行号(CIDL)
                    组花册(定位花册行号, 指定列仓) = (ARRTS(X, 位列TS持仓数量)) & "," & (ARRTS(X, 位列TS摊薄成本))
                    '更新周池信息：标注是否为周层以及对应账户
                    If 是否更新仓周 = True Then 组花册(定位花册行号, 位列花天仓周) = 值常池名
                Else
                    定位花册行号 = -1
                End If
            ElseIf 值交易所名 = "沪港" Or 值交易所名 = "深港" Then
                CIDL = "r_hk" & Format(CIDV, "00000")
            End If
        End If
        '--------------------------------------------------------------------------------
        值代称 = ARRTS(X, 位列TS代称)
        Debug.Print "华宝持仓导入>>>"; X; 值代称, CIDL, CIDV, 定位花册行号
        '--------------------------------------------------------------------------------
    Next
    Erase ARRTS
    Set 典集花册行号 = Nothing
'========================================================================================
'输出：花册
'========================================================================================
    Call UTL数据转换_集ARR2WS(组花册, WS花册, 始行:=2, 始列:=1)
    Erase 组花册
    '------------------------------------------------------------------------------------
    '格式化：花册
    '------------------------------------------------------------------------------------
    Call STCALL花册工具_花册格程(WS花册)
    'WS花册.Activate
    Set WS花册 = Nothing
'========================================================================================
'返回
'========================================================================================
    UTL宏工具_END
    MSG = "导入持仓 >>" & 计数导入 & vbCrLf
    STCALL花册管理_重制花天P3正程导入华宝 = 计数导入
End Function





'########################################################################################
'########################################################################################
'##################################     设置信息     ####################################
'########################################################################################
'########################################################################################
'========================================================================================
'========================================================================================
'功能：设置基础信息
'========================================================================================
'========================================================================================
Public Function STCALL花册管理_重制花天P9正程设置信息( _
          Optional 是否更新市板 As Boolean = False _
        , Optional 是否更新在池 As Boolean = False _
        , Optional 是否更新停牌 As Boolean = False _
        , Optional 是否更新代称 As Boolean = False _
        ) As String
'========================================================================================
    UTL宏工具_BEGIN
    TT = Timer
'========================================================================================
'输入
'========================================================================================
    Dim WS花册 As Worksheet
    If STBASE外簿工具_花册链接(WS花册, 常花中股) = False Then
        UTL宏工具_END
        Exit Function
    End If
    Dim 组花册 As Variant
    Call UTL数据转换_集WS2ARR(组花册, WS花册, 始行:=2, 始列:=1, 总列:=花宽全道)
'========================================================================================
'设置：信息
'========================================================================================
    '------------------------------------------------------------------------------------
    Dim MSG As String
    MSG = MSG & "【任务】设置花册基本信息" & vbCrLf
    '------------------------------------------------------------------------------------
    If 是否更新市板 = True Then
        Call STCALL花册管理_重制花天P9子程重置信息1市板(组花册)
        MSG = MSG & "1.重置市板"
        MSG = MSG & vbCrLf
    End If
    '------------------------------------------------------------------------------------
    If 是否更新在池 = True Then
        MSG在池 = STCALL花册管理_重制花天P9子程重置信息2在池(组花册)
        MSG = MSG & "2.重置在池  " & MSG在池
        MSG = MSG & vbCrLf
    End If
    '------------------------------------------------------------------------------------
    If 是否更新停牌 = True Then
        MSG停牌 = STCALL花册管理_重制花天P9子程重置信息8停牌(组花册, 法道基列:=花列甲道, 指定花册:=常花中股)
        MSG = MSG & "8.重置停牌  " & MSG停牌
        MSG = MSG & vbCrLf
    End If
    '------------------------------------------------------------------------------------
    '注意20220824：此过程耗时较长，仅在导入指数列表时运行；其余更新代称过程，放在运行行情异常时同步完成。
    If 是否更新代称 = True Then
        Call STCALL花册管理_重制花天P9子程重置信息5代称(组花册)
        MSG = MSG & "9.更新名称"
        MSG = MSG & vbCrLf
    End If
'========================================================================================
'输出：花册
'========================================================================================
    Call UTL数据转换_集ARR2WS(组花册, WS花册, 始行:=2, 始列:=1)
    Erase 组花册
    '------------------------------------------------------------------------------------
    '格式化：花册
    '------------------------------------------------------------------------------------
    Call STCALL花册工具_花册格程(WS花册)
    Call 历研统时引擎5格程按列(WS花册, 始列:=花列统道)
    WS花册.Activate
    Set WS花册 = Nothing
'========================================================================================
'返回
'========================================================================================
    UTL宏工具_END
    MSG = MSG & "【重置信息耗时】" & CInt(Timer - TT) & vbCrLf
    '------------------------------------------------------------------------------------
    STCALL花册管理_重制花天P9正程设置信息 = MSG
End Function




'========================================================================================
'设置信息：停牌
'注20240601：【指定头码】是该代码群中指定【基准日期】的代码
'========================================================================================
Function STCALL花册管理_重制花天P9子程重置信息8停牌( _
          组花册 As Variant _
        , Optional 法道基列 As Integer = 花列甲道 _
        , Optional 指定花册 As String = 常花中股 _
        , Optional 指定头码 As String = 常查询代码中股 _
        ) As String
    '------------------------------------------------------------------------------------
    Dim 基位日类 As Integer
    基位日类 = 法道基列 - 1
    Dim 计数停牌 As Integer
    Dim 基准结期日类 As Date
    Dim 基准结期周类 As Date
    Dim 基准结期月类 As Date
    Dim X As Integer
    For X = LBound(组花册, 1) To UBound(组花册, 1)
                        '----------------------------------------------------------------
                        '获取基准日期：sh000001结算日期作为基准日期
                        If 组花册(X, 1) = 指定头码 Then
                            基准结期日类 = 组花册(X, 基位日类 + 位os结期)
                            基准结期周类 = 组花册(X, 基位日类 + 位os结期 + 花宽单道 * 1)
                            基准结期月类 = 组花册(X, 基位日类 + 位os结期 + 花宽单道 * 2)
                            Exit For
                        End If
                        '----------------------------------------------------------------
    Next
    '------------------------------------------------------------------------------------
    For X = LBound(组花册, 1) To UBound(组花册, 1)
                        '----------------------------------------------------------------
                        '过滤非基准日期
                        组花册(X, 基位日类 + 位os停牌) = ""
                        If 组花册(X, 基位日类 + 位os结期) <> 基准结期日类 Then
                            组花册(X, 基位日类 + 位os停牌) = "S"
                            If 组花册(X, 位列花天市板) <> 常市板指 And 组花册(X, 位列花天市板) <> 常市板基 Then
                                计数停牌 = 计数停牌 + 1
                            End If
                        End If
                        '----------------------------------------------------------------
    Next
    '------------------------------------------------------------------------------------
    STCALL花册管理_重制花天P9子程重置信息8停牌 = 计数停牌 & vbCrLf & "【结算终期日类】" & 基准结期日类 & vbCrLf & "【结算终期周类】" & 基准结期周类 & vbCrLf & "【结算终期月类】" & 基准结期月类
End Function


'========================================================================================
'设置信息：代称
'注意20220824：此过程耗时较长，仅在导入指数列表时运行；其余更新代称过程，放在运行行情异常时同步完成。
'========================================================================================
Function STCALL花册管理_重制花天P9子程重置信息5代称( _
          组花册 As Variant _
        ) As Integer
    Dim CIDL As String
    Dim aRESP As Variant
    Dim X As Integer
    For X = LBound(组花册, 1) To UBound(组花册, 1)
                        '----------------------------------------------------------------
                        CIDL = 组花册(X, 位列花天CIDL)
                        If UBHTTP腾实_查回组(aRESP, CIDL) > 0 Then
                            组花册(X, 位列花天代称) = aRESP(位序腾实代称)
                            组花册(X, 位列花天量比) = aRESP(位序腾实A量比)
                            组花册(X, 位列花天换手) = aRESP(位序腾实A换手)
                            组花册(X, 位列花天交量) = aRESP(位序腾实交量)
                            组花册(X, 位列花天流市) = aRESP(位序腾实流市)
                            组花册(X, 位列花天总市) = aRESP(位序腾实总市)
                            组花册(X, 位列花天停牌) = aRESP(位序腾实停牌)
                            Erase aRESP
                        End If
                        '----------------------------------------------------------------
    Next
    STCALL花册管理_重制花天P9子程重置信息5代称 = UBound(组花册, 1) - LBound(组花册, 1) + 1
End Function




'========================================================================================
'设置信息：市板
'========================================================================================
Function STCALL花册管理_重制花天P9子程重置信息1市板( _
          组花册 As Variant _
        ) As Integer
    Dim CIDL As String
    Dim 值市日 As Date
    Dim 值市板 As String
    Dim X As Integer
    For X = LBound(组花册, 1) To UBound(组花册, 1)
        '----------------------------------------------------------------
        CIDL = 组花册(X, 位列花天CIDL)
        值市日 = 组花册(X, 位列花天市日)
        '----------------------------------------------------------------
        '市板分类
        If UBCID是中股指(CIDL) = True Then
            值市板 = 常市板指        ' Qd = index
        ElseIf UBCID是中股基(CIDL) = True Then
            值市板 = 常市板基        ' Qe = ETF
        ElseIf UBCID是中股票(CIDL) = True Then
            If InStr(组花册(X, 位列花天代称), "ST") > 0 Or InStr(组花册(X, 位列花天代称), "退") > 0 Then
                值市板 = 常市板票Qst
            ElseIf 组花册(X, 位列花天是否中股300) = "Y" Then
                值市板 = 常市板票Qif  ' Qif = 沪深300
            ElseIf 组花册(X, 位列花天是否中证500) = "Y" Then
                值市板 = 常市板票Qic  ' Qic = 中证500
            ElseIf 组花册(X, 位列花天是否中证1000) = "Y" Then
                值市板 = 常市板票Qim  ' Qim = 中证1000
            ElseIf 组花册(X, 位列花天是否中证2000) = "Y" Then
                值市板 = 常市板票Qit  ' Qit = 中证2000
            Else
                值市板 = 常市板票Qin  ' Qin = 中证非
            End If
        Else
            值市板 = ""
        End If
        组花册(X, 位列花天市板) = 值市板
        '----------------------------------------------------------------
        '为指数和ETF设置市日
        '----------------------------------------------------------------
        If UBCID是中股指(CIDL) = True Or UBCID是中股基(CIDL) = True Then
            组花册(X, 位列花天市日) = 组花册(X, 花列甲道 - 1 + 位os基市期)
        End If
        '----------------------------------------------------------------
    Next
    STCALL花册管理_重制花天P9子程重置信息1市板 = UBound(组花册, 1) - LBound(组花册, 1) + 1
End Function


'========================================================================================
'========================================================================================
'设置信息：在池（金银非）
'========================================================================================
'========================================================================================
Function STCALL花册管理_重制花天P9子程重置信息2在池( _
          组花册 As Variant _
        ) As String
'========================================================================================
'制作池列表
'========================================================================================
                        '制作池：池金
                        '用于周线级别长线操作，使用恒定【底仓】持有，不计较每日波动，遇到坑可以适当增加【浮仓】，出坑后平掉【浮仓】
                        Dim 典码已在池金 As New Dictionary
                        计数池金 = UTL数据转换_集WS名2典码(典码已在池金, 常池名金)
                        '----------------------------------------------------------------
                        '制作池：池银
                        '用于备选操作，优先级低于【池金】
                        Dim 典码已在池银 As New Dictionary
                        计数池银 = UTL数据转换_集WS名2典码(典码已在池银, 常池名银)
                        '----------------------------------------------------------------
                        '制作池：池铜
                        '用于备选操作，优先级低于【池金】
                        Dim 典码已在池铜 As New Dictionary
                        计数池铜 = UTL数据转换_集WS名2典码(典码已在池铜, 常池名铜)
                        '----------------------------------------------------------------
                        '制作池：池黑
                        '用于备选操作，每月进行一次甄别，是否从黑名单取出来
                        Dim 典码已在池黑 As New Dictionary
                        计数池黑 = UTL数据转换_集WS名2典码(典码已在池黑, 常池名黑)
                        '----------------------------------------------------------------
                        '----------------------------------------------------------------
                        '制作池：今池
                        '用于备选操作，每周进行一次甄别
                        Dim 典码已在池今 As New Dictionary
                        计数池今 = UTL数据转换_集WS名2典码(典码已在池今, 常池名今)
'========================================================================================
'设置信息：先清理（必须非空）再设置
'========================================================================================
    Dim CIDL As String
    Dim X As Integer
    For X = LBound(组花册, 1) To UBound(组花册, 1)
                        '----------------------------------------------------------------
                        '注意20230101：如有新列表就进行更新，否则保持原有信息。
                        If 计数池金 > 0 And 组花册(X, 位列花天在池) = 常池名金 Then 组花册(X, 位列花天在池) = ""
                        If 计数池银 > 0 And 组花册(X, 位列花天在池) = 常池名银 Then 组花册(X, 位列花天在池) = ""
                        If 计数池铜 > 0 And 组花册(X, 位列花天在池) = 常池名铜 Then 组花册(X, 位列花天在池) = ""
                        If 计数池黑 > 0 And 组花册(X, 位列花天在池) = 常池名黑 Then 组花册(X, 位列花天在池) = ""
                        '----------------------------------------------------------------
                        If 计数池今 > 0 Then 组花册(X, 位列花天今池) = ""
                        '----------------------------------------------------------------
    Next
    '------------------------------------------------------------------------------------
    For X = LBound(组花册, 1) To UBound(组花册, 1)
                        CIDL = 组花册(X, 位列花天CIDL)
                        '----------------------------------------------------------------
                        '标注是否已在池：金银非黑为互斥关系
                        If 典码已在池金.Exists(CIDL) = True Then
                            组花册(X, 位列花天在池) = 常池名金
                        ElseIf 典码已在池银.Exists(CIDL) = True Then
                            组花册(X, 位列花天在池) = 常池名银
                        ElseIf 典码已在池铜.Exists(CIDL) = True Then
                            组花册(X, 位列花天在池) = 常池名铜
                        ElseIf 典码已在池黑.Exists(CIDL) = True Then
                            组花册(X, 位列花天在池) = 常池名黑
                        End If
                        '----------------------------------------------------------------
                        If 典码已在池今.Exists(CIDL) = True Then
                            组花册(X, 位列花天今池) = 常池名今
                        End If
                        '----------------------------------------------------------------
    Next
    '------------------------------------------------------------------------------------
    Set 典码已在池今 = Nothing
    Set 典码已在池金 = Nothing
    Set 典码已在池银 = Nothing
    Set 典码已在池铜 = Nothing
    Set 典码已在池黑 = Nothing
'========================================================================================
'计数
'========================================================================================
    For X = LBound(组花册, 1) To UBound(组花册, 1)
                        CIDL = 组花册(X, 位列花天CIDL)
                        '----------------------------------------------------------------
                        '标注是否已在池：金银非黑为互斥关系
                        If 组花册(X, 位列花天在池) = 常池名金 Then
                            典码已在池金.Add Item:=X, Key:=CIDL
                        ElseIf 组花册(X, 位列花天在池) = 常池名银 Then
                            典码已在池银.Add Item:=X, Key:=CIDL
                        ElseIf 组花册(X, 位列花天在池) = 常池名铜 Then
                            典码已在池铜.Add Item:=X, Key:=CIDL
                        ElseIf 组花册(X, 位列花天在池) = 常池名黑 Then
                            典码已在池黑.Add Item:=X, Key:=CIDL
                        End If
                        '----------------------------------------------------------------
                        If 组花册(X, 位列花天今池) = 常池名今 Then
                            典码已在池今.Add Item:=X, Key:=CIDL
                        End If
                        '----------------------------------------------------------------
    Next
    '------------------------------------------------------------------------------------
    Dim MSG As String
    MSG = "更新在池："
    MSG = MSG & vbCrLf & ">>池今：" & 典码已在池今.Count
'    MSG = MSG & vbCrLf & ">>池金：" & 典码已在池金.Count
'    MSG = MSG & vbCrLf & ">>池银：" & 典码已在池银.Count
'    MSG = MSG & vbCrLf & ">>池铜：" & 典码已在池铜.Count
    MSG = MSG & vbCrLf & ">>池黑：" & 典码已在池黑.Count
    '------------------------------------------------------------------------------------
    Set 典码已在池今 = Nothing
    Set 典码已在池金 = Nothing
    Set 典码已在池银 = Nothing
    Set 典码已在池铜 = Nothing
    Set 典码已在池黑 = Nothing
'========================================================================================
'返回
'========================================================================================
    STCALL花册管理_重制花天P9子程重置信息2在池 = MSG
End Function
'########################################################################################
'########################################################################################
'##################################     设置信息     ####################################
'########################################################################################
'########################################################################################





'========================================================================================
'========================================================================================
'格式化HX
'更新信息：代称、行业、市板
'========================================================================================
'========================================================================================
Function STCALL花册工具_花册格程( _
          WS花册 As Worksheet _
        , Optional ByVal 基列 As Integer = 1 _
        , Optional ByVal 基行 As Integer = 1 _
        , Optional 基色底 As Long = 常色十靛 _
        ) As Integer
'========================================================================================
'全局设置
'========================================================================================
    With WS花册
        .Tab.Color = 基色底
        .Rows.Hidden = False
        .Columns.Hidden = False
        .Cells.ClearFormats
        .Cells.Font.Size = 9
    End With
    '------------------------------------------------------------------------------------
    '调整与冻结
    '------------------------------------------------------------------------------------
    Call PBASE格程工具_表冻结锁定(WS花册, 基列, 2)
'========================================================================================
'花册：格式化
'========================================================================================
    '------------------------------------------------------------------------------------
    '首行
    '------------------------------------------------------------------------------------
    WS花册.Rows(基列).Font.Bold = True
    With WS花册
        '---------------------------------
        .Cells(1, 位列花天CIDL) = "CIDL"
        .Cells(1, 位列花天CIDS) = "CIDS"
        .Cells(1, 位列花天代称) = "代称"
        .Cells(1, 位列花天市板) = "市板"
        .Cells(1, 位列花天市日) = "市日"
        .Cells(1, 位列花天交易所码) = "交易所码"
        .Cells(1, 位列花天市场板类) = "市场板类"
        '---------------------------------
        .Cells(1, 位列花天地区新浪) = "地区新浪"
        .Cells(1, 位列花天行业新浪) = "行业新浪"
        .Cells(1, 位列花天行业益盟) = "行业益盟"
        .Cells(1, 位列花天概念益盟) = "概念益盟"
        .Cells(1, 位列花天对应大势) = "对应大势"
        '---------------------------------
        .Cells(1, 位列花天是否上证50) = "IH"
        .Cells(1, 位列花天是否中股300) = "IF"
        .Cells(1, 位列花天是否中证500) = "IC"
        .Cells(1, 位列花天是否中证1000) = "Im"
        .Cells(1, 位列花天是否中证2000) = "It"
        .Cells(1, 位列花天是否创业板50) = "创业板50"
        .Cells(1, 位列花天是否成分) = "成分"
        .Cells(1, 位列花天是否港股通) = "港股通"
        .Cells(1, 位列花天是否MSCI中国) = "MSCI中国"
        '---------------------------------
        .Cells(1, 位列花天仓宝福) = "福仓"
        .Cells(1, 位列花天仓宝彦) = "彦仓"
        .Cells(1, 位列花天仓宝合) = "仓合"
        .Cells(1, 位列花天仓周) = "仓周"
        '---------------------------------
        .Cells(1, 位列花天今池) = "今池"
        .Cells(1, 位列花天在池) = "在池"
        '---------------------------------
        .Cells(1, 位列花天量比) = "量比"
        .Cells(1, 位列花天换手) = "换手"
        .Cells(1, 位列花天交量) = "交量"
        .Cells(1, 位列花天流市) = "流市"
        .Cells(1, 位列花天总市) = "总市"
        .Cells(1, 位列花天停牌) = "停牌"
        '---------------------------------
    End With
    '------------------------------------------------------------------------------------
    '边框
    '------------------------------------------------------------------------------------
    With WS花册.Columns(基列)
            With .Columns(位列花天市日).Borders(xlEdgeRight)
                .Color = 常色主黑
                .Weight = xlThin
            End With
            With .Columns(位列花天市场板类).Borders(xlEdgeRight)
                .Color = 常色主黑
                .Weight = xlThin
            End With
            With .Columns(位列花天仓宝福).Borders(xlEdgeLeft)
                .Color = 常色主黑
                .Weight = xlThin
            End With
            With .Columns(位列花天是否上证50).Borders(xlEdgeLeft)
                .Color = 常色主黑
                .Weight = xlThin
            End With
            With .Columns(位列花天今池).Borders(xlEdgeLeft)
                .Color = 常色主靛
                .Weight = xlThin
            End With
            With .Columns(位列花天在池).Borders(xlEdgeRight)
                .Color = 常色主黑
                .Weight = xlThin
            End With
    End With
    '------------------------------------------------------------------------------------
    '列
    '------------------------------------------------------------------------------------
    With WS花册.Cells(基列, 位列花天CIDL).Resize(1, 花宽主道 - 基列 + 1).EntireColumn
        .HorizontalAlignment = xlRight
        .Interior.Color = 常色七灰
        .ColumnWidth = 2
        .Hidden = True
    End With
    With WS花册.Columns(基列)
        .Columns(位列花天CIDL).HorizontalAlignment = xlLeft
        .Columns(位列花天代称).HorizontalAlignment = xlLeft
        .Columns(位列花天代称).Interior.TintAndShade = 0.2
        
        .Columns(位列花天换手).NumberFormatLocal = 全设格式of一位
        .Columns(位列花天量比).NumberFormatLocal = 全设格式of零位
        .Columns(位列花天流市).NumberFormatLocal = 全设格式of零位
        .Columns(位列花天总市).NumberFormatLocal = 全设格式of零位
    End With
    With WS花册.Columns(基列)
        '---------------------------------
        .Columns(位列花天CIDL).ColumnWidth = 8
        .Columns(位列花天代称).ColumnWidth = 10
        .Columns(位列花天市日).ColumnWidth = 9
        .Columns(位列花天市日).NumberFormatLocal = 全设格式of日期
        .Columns(位列花天交易所码).ColumnWidth = 5
        .Columns(位列花天市场板类).ColumnWidth = 6
        .Columns(位列花天地区新浪).ColumnWidth = 6
        .Columns(位列花天行业新浪).ColumnWidth = 8
        .Columns(位列花天行业益盟).ColumnWidth = 10
        .Columns(位列花天概念益盟).ColumnWidth = 0.1
        .Columns(位列花天CIDS).ColumnWidth = 10
        .Columns(位列花天CIDS).Hidden = True
        .Columns(位列花天CIDS).NumberFormatLocal = 全设格式of代码
        .Columns(位列花天市板).ColumnWidth = 4
        .Columns(位列花天对应大势).ColumnWidth = 8
        '---------------------------------
        .Columns(位列花天是否上证50).ColumnWidth = 2
        .Columns(位列花天是否中股300).ColumnWidth = 2
        .Columns(位列花天是否中证500).ColumnWidth = 2
        .Columns(位列花天是否中证1000).ColumnWidth = 2
        .Columns(位列花天是否中证2000).ColumnWidth = 2
        .Columns(位列花天是否创业板50).ColumnWidth = 2
        .Columns(位列花天是否成分).ColumnWidth = 2
        .Columns(位列花天是否港股通).ColumnWidth = 2
        .Columns(位列花天是否MSCI中国).ColumnWidth = 2
        '---------------------------------
        .Columns(位列花天仓宝福).ColumnWidth = 4
        .Columns(位列花天仓宝彦).ColumnWidth = 4
        .Columns(位列花天仓宝合).ColumnWidth = 4
        .Columns(位列花天仓周).ColumnWidth = 4
        '---------------------------------
        .Columns(位列花天今池).ColumnWidth = 2
        .Columns(位列花天在池).ColumnWidth = 2
        '---------------------------------
        .Columns(位列花天量比).ColumnWidth = 4
        .Columns(位列花天换手).ColumnWidth = 4
        .Columns(位列花天交量).ColumnWidth = 4
        .Columns(位列花天流市).ColumnWidth = 4
        .Columns(位列花天总市).ColumnWidth = 4
        .Columns(位列花天停牌).ColumnWidth = 4
        '---------------------------------
    End With
    '列：隐藏
    With WS花册.Columns(基列)
        .Columns(位列花天对应大势).Hidden = True
        .Columns(位列花天量比).Hidden = True
        .Columns(位列花天换手).Hidden = True
        .Columns(位列花天交量).Hidden = True
        .Columns(位列花天流市).Hidden = True
        .Columns(位列花天总市).Hidden = True
        .Columns(位列花天停牌).Hidden = True
    End With
    '------------------------------------------------------------------------------------
    '排序
    '------------------------------------------------------------------------------------
    If WS花册.Name = 常花美股 Then
        WS花册.Columns("C:Z").Hidden = True
        WS花册.Columns(位列花天代称).ColumnWidth = 20
        WS花册.Columns(位列花天行业新浪).ColumnWidth = 20
    ElseIf WS花册.Name = 常花港股通 Then
        WS花册.Columns("C:Z").Hidden = True
        WS花册.Columns(位列花天代称).ColumnWidth = 16
    End If
'========================================================================================
'排序
'========================================================================================
    With WS花册.Cells
        .Sort _
            key1:=WS花册.Cells(1, 位列花天CIDL), order1:=xlAscending, _
            Header:=xlYes
    End With
'========================================================================================
'罗盘
'========================================================================================
    Call IQQQ跨码展擎_按列OS区域(WS花册, 花列甲道, 基色底:=基色底, 基色调:=0.5)
    Call IQQQ跨码展擎_按列OS区域(WS花册, 花列乙道, 基色底:=基色底, 基色调:=0.4)
    Call IQQQ跨码展擎_按列OS区域(WS花册, 花列丙道, 基色底:=基色底, 基色调:=0.3)
'========================================================================================
'清理
'========================================================================================
    WS花册.Activate
    ActiveWindow.Zoom = 80
End Function





'========================================================================================
'========================================================================================
'导入信息：全部股票列表
'导入文件：Tushare basics文件zdata.TSstock
'========================================================================================
'========================================================================================
Private Function STCALL花册管理_重制花天P1子程导入列表单票(WS花册 As Worksheet) As Integer
'========================================================================================
'TS：导入文件
'========================================================================================
    '------------------------------------------------------------------------------------
    '指定文件
    '------------------------------------------------------------------------------------
    Dim FILEOPEN As String
    FILEOPEN = 全设基夹根 & "\BaseTS中股票.csv"    '注20231231：输入文件必须是tushare列表
'    FILEOPEN = 全设基夹根 & "\PROstockbasic.csv"
    If UTL判断文件存在(FILEOPEN) = False Then
        Exit Function
    End If
'    '------------------------------------------------------------------------------------
'    '对话框选择
'    '------------------------------------------------------------------------------------
'    Dim FILEOPEN
'    FILEOPEN = Application.GetOpenFilename("csv文件,*.csv", , "请选择tushare文件PROstockbasic", , False)
'    If FILEOPEN = False Then
'        Exit Function
'    End If
'========================================================================================
    UTL宏工具_BEGIN
'========================================================================================
    Dim 位列TS代码 As Integer
    Dim 位列TS代称 As Integer
    Dim 位列TS地区新浪 As Integer
    Dim 位列TS行业新浪 As Integer
    Dim 位列TS交易所码 As Integer
    Dim 位列TS市场板类 As Integer
    Dim 位列TS上市状态 As Integer
    Dim 位列TS上市始日 As Integer
    Dim 位列TS是否港通 As Integer
    '------------------------------------------------------------------------------------
    '导入数组
    '------------------------------------------------------------------------------------
    Dim WBTS As Workbook
    Set WBTS = GetObject(FILEOPEN)
    Dim ARRTS  As Variant
    With WBTS.ActiveSheet
        ARRTS = .Range("A1").CurrentRegion
        位列TS代码 = .Rows(1).Find(What:="ts_code").Column
        位列TS代称 = .Rows(1).Find(What:="name").Column
        位列TS地区新浪 = .Rows(1).Find(What:="area").Column
        位列TS行业新浪 = .Rows(1).Find(What:="industry").Column
        位列TS交易所码 = .Rows(1).Find(What:="exchange").Column
        位列TS市场板类 = .Rows(1).Find(What:="market").Column
        位列TS上市状态 = .Rows(1).Find(What:="list_status").Column
        位列TS上市始日 = .Rows(1).Find(What:="list_date").Column
    End With
    WBTS.Close False
    Set WBTS = Nothing
'========================================================================================
'TS：输出中间工作表
'========================================================================================
'    '------------------------------------------------------------------------------------
'    '建立工作簿
'    '------------------------------------------------------------------------------------
'    Dim WSTS As Worksheet
'    Call PBASE格程工具_表操工表新增(WSTS, "IOTS", WB:=ThisWorkbook, 基色底:=常色十红)
'    '------------------------------------------------------------------------------------
'    '输出数组
'    '------------------------------------------------------------------------------------
'    Call UTL数据转换_集ARR2WS(ARRTS, WSTS)
'    '------------------------------------------------------------------------------------
'    '格式化
'    '------------------------------------------------------------------------------------
'    WSTS.Rows(1).Font.Bold = True
'    WSTS.Columns(位列TS代码).NumberFormatLocal = 全设格式of代码
'    WSTS.Columns.AutoFit
'    '------------------------------------------------------------------------------------
'    '按照代码进行排序
'    '------------------------------------------------------------------------------------
'    WSTS.Cells.Sort key1:=WSTS.Cells(1, 位列TS代码), order1:=xlAscending, Header:=xlYes
'    '------------------------------------------------------------------------------------
'    WSTS.Activate
'    ActiveWindow.Zoom = 80
'    Debug.Print WSTS.Cells(65536, 位列TS代码).End(xlUp).Row
'    Set WSTS = Nothing
'========================================================================================
'花册：导入股票列表
'========================================================================================
    Dim sdate As String
    Dim CIDV As Variant
    Dim CIDL As String
    '====================================================================================
    '合并 TSstock
    '====================================================================================
    Dim 计数导入 As Integer
    Dim 主列行号 As Integer
    Dim 遍历序号 As Integer
    
    计数导入 = 0
    For 遍历序号 = LBound(ARRTS, 1) + 1 To UBound(ARRTS, 1)
    If ARRTS(遍历序号, 位列TS交易所码) = "SSE" _
    Or ARRTS(遍历序号, 位列TS交易所码) = "SZSE" _
    Or ARRTS(遍历序号, 位列TS交易所码) = "BSE" _
    Then
    '注释20220806：剔除北交所，仅保留上交所与深交所
        '--------------------------------------------------------------------------------
        计数导入 = 计数导入 + 1
        主列行号 = 计数导入 + 1
        '--------------------------------------------------------------------------------
        '处理代码
        '--------------------------------------------------------------------------------
        CIDV = ARRTS(遍历序号, 位列TS代码)
        CIDL = VBA.LCase(Mid$(CIDV, InStr(CIDV, ".") + 1)) & Left$(CIDV, 6)
        WS花册.Cells(主列行号, 位列花天CIDS) = CIDV
        WS花册.Cells(主列行号, 位列花天CIDL) = CIDL
        '--------------------------------------------------------------------------------
        '市日
        sdate = ARRTS(遍历序号, 位列TS上市始日)
        If sdate Like "########" Then
            WS花册.Cells(主列行号, 位列花天市日) = DateSerial(Left$(sdate, 4), Mid$(sdate, 5, 2), Mid$(sdate, 7, 2))
        End If
        '--------------------------------------------------------------------------------
        WS花册.Cells(主列行号, 位列花天代称) = ARRTS(遍历序号, 位列TS代称)
        WS花册.Cells(主列行号, 位列花天交易所码) = ARRTS(遍历序号, 位列TS交易所码)
        WS花册.Cells(主列行号, 位列花天市场板类) = ARRTS(遍历序号, 位列TS市场板类)
        WS花册.Cells(主列行号, 位列花天地区新浪) = ARRTS(遍历序号, 位列TS地区新浪)
        WS花册.Cells(主列行号, 位列花天行业新浪) = ARRTS(遍历序号, 位列TS行业新浪)
        '--------------------------------------------------------------------------------
        '衍生对应大势
        '待完成：重新划分 上证50 沪深300 中证500 等细分指数
        '--------------------------------------------------------------------------------
        If ARRTS(遍历序号, 位列TS交易所码) = "SSE" Then
            If ARRTS(遍历序号, 位列TS市场板类) = "科创板" Then
                WS花册.Cells(主列行号, 位列花天对应大势) = "科创50"
            ElseIf ARRTS(遍历序号, 位列TS市场板类) = "主板" Then
                WS花册.Cells(主列行号, 位列花天对应大势) = "上证指数"
            Else
                WS花册.Cells(主列行号, 位列花天对应大势) = "上证指数"
            End If
        ElseIf ARRTS(遍历序号, 位列TS交易所码) = "SZSE" Then
            If ARRTS(遍历序号, 位列TS市场板类) = "创业板" Then
                WS花册.Cells(主列行号, 位列花天对应大势) = "创业板指"     '399006
            ElseIf ARRTS(遍历序号, 位列TS市场板类) = "主板" Or ARRTS(遍历序号, 位列TS市场板类) = "中小板" Then
                WS花册.Cells(主列行号, 位列花天对应大势) = "深证成指"
            Else
                WS花册.Cells(主列行号, 位列花天对应大势) = "深证成指"
            End If
        ElseIf ARRTS(遍历序号, 位列TS交易所码) = "BSE" Then
                WS花册.Cells(主列行号, 位列花天对应大势) = "北交50"
        End If
        '--------------------------------------------------------------------------------
        Debug.Print "花册花天单票列表导入>>>"; 遍历序号
        '--------------------------------------------------------------------------------
    End If
    Next
    Erase ARRTS
'========================================================================================
    STCALL花册管理_重制花天P1子程导入列表单票 = 计数导入
    UTL宏工具_END
End Function
'========================================================================================
'========================================================================================
'导入信息：全部指数列表
'导入文件：zdata中指数列表
'========================================================================================
'========================================================================================
Private Function STCALL花册管理_重制花天P1子程导入列表指数(WS花册 As Worksheet) As Integer
'========================================================================================
'zdata：导入列表
'========================================================================================
    Dim FILEOPEN As String
    FILEOPEN = 全设基夹中股
    If UTL判断路径存在(FILEOPEN) = False Then
        MsgBox FILEOPEN & "文件夹不存在！"
        Exit Function
    End If
    '------------------------------------------------------------------------------------
    '导入数组
    '------------------------------------------------------------------------------------
    Dim 典集指码 As New Dictionary
    Dim 原件名称 As String
    Dim 原件代码 As String
    Dim 原件期类 As String
    '------------------------------------------------------------------------------------
    '过滤：指数列表
    '------------------------------------------------------------------------------------
    Dim FSO As New FileSystemObject
    Dim gfile As file
    For Each gfile In FSO.GetFolder(FILEOPEN).Files
        '--------------------------------------------------------------------------------
'        原件名称 = UCase(FSO.GetBaseName(gfile.Path))
'        原件代码 = LCase(Left$(原件名称, 8))
'        原件期类 = UCase(Mid$(原件名称, 9, 1))
'        If 原件期类 = 常期类为日 Then
'            典集指码.Add Item:=原件代码, Key:=原件代码
'        End If
        '--------------------------------------------------------------------------------
        原件名称 = UCase(FSO.GetBaseName(gfile.Path))
        原件代码 = LCase(原件名称)
        典集指码.Add Item:=原件代码, Key:=原件代码
        '--------------------------------------------------------------------------------
    Next
    Set FSO = Nothing
    '------------------------------------------------------------------------------------
    '测试：指数列表
    '------------------------------------------------------------------------------------
'    Dim I As Integer
'    For I = 1 To 典集指码.Count
'        Debug.Print I, 典集指码.Keys(I - 1)
'    Next
'========================================================================================
'花册：指数列表清理
'========================================================================================
    Dim CIDL As String
    Dim 行号遍历 As Integer
    For 行号遍历 = PBASE格程工具_表参末行指定(WS花册, 位列花天CIDL) To 2 Step -1
        CIDL = WS花册.Cells(行号遍历, 位列花天CIDL).Value
        If UBCID是中股指(CIDL) = True Or UBCID是中股基(CIDL) = True Then
            WS花册.Rows(行号遍历).Delete
            Debug.Print "花册花天指数列表 清理>>>"; 行号遍历
        End If
    Next
'========================================================================================
'花册：指数列表导入
'========================================================================================
    Dim 目标行号 As Integer
    目标行号 = PBASE格程工具_表参末行指定(WS花册, 位列花天CIDL)
    '------------------------------------------------------------------------------------
    Dim 计数导入 As Integer
    计数导入 = 0
    Dim i As Integer
    For i = 1 To 典集指码.Count
        '--------------------------------------------------------------------------------
        CIDL = 典集指码.Keys(i - 1)
        CIDV = VBA.UCase(Right(CIDL, 6) & "." & Left$(CIDL, 2))
        '--------------------------------------------------------------------------------
        '处理代码
        '--------------------------------------------------------------------------------
        '处理代码：指数
        If (CIDL Like 常通配全码上指) Then
            计数导入 = 计数导入 + 1
            目标行号 = 目标行号 + 1
            WS花册.Cells(目标行号, 位列花天CIDL) = CIDL
            WS花册.Cells(目标行号, 位列花天CIDS) = CIDV
            WS花册.Cells(目标行号, 位列花天行业新浪) = "上证指数"
            WS花册.Cells(目标行号, 位列花天对应大势) = "上证指数"     '"sh000001"
        ElseIf (CIDL Like 常通配全码深指) Then
            计数导入 = 计数导入 + 1
            目标行号 = 目标行号 + 1
            WS花册.Cells(目标行号, 位列花天CIDL) = CIDL
            WS花册.Cells(目标行号, 位列花天CIDS) = CIDV
            WS花册.Cells(目标行号, 位列花天行业新浪) = "深证指数"
            WS花册.Cells(目标行号, 位列花天对应大势) = "深证成指"     '"sz399001"
        '处理代码：ETF
        ElseIf (CIDL Like 常通配全码上ETF) Then
            计数导入 = 计数导入 + 1
            目标行号 = 目标行号 + 1
            WS花册.Cells(目标行号, 位列花天CIDL) = CIDL
            WS花册.Cells(目标行号, 位列花天CIDS) = CIDV
            WS花册.Cells(目标行号, 位列花天行业新浪) = "上证ETF"
            WS花册.Cells(目标行号, 位列花天对应大势) = "上证指数"     '"sh000001"
        ElseIf (CIDL Like 常通配全码深ETF) Then
            计数导入 = 计数导入 + 1
            目标行号 = 目标行号 + 1
            WS花册.Cells(目标行号, 位列花天CIDL) = CIDL
            WS花册.Cells(目标行号, 位列花天CIDS) = CIDV
            WS花册.Cells(目标行号, 位列花天行业新浪) = "深证ETF"
            WS花册.Cells(目标行号, 位列花天对应大势) = "深证成指"     '"sz399001"
        End If
        '--------------------------------------------------------------------------------
        Debug.Print "花册花天指数列表 导入>>>"; i
    Next
    '------------------------------------------------------------------------------------
    典集指码.RemoveAll
    Set 典集指码 = Nothing
'========================================================================================
    STCALL花册管理_重制花天P1子程导入列表指数 = 计数导入
End Function
'========================================================================================
'========================================================================================
'========================================================================================
'########################################################################################
'########################################################################################
'##################################     花册管理     ####################################
'########################################################################################
'########################################################################################








'########################################################################################
'########################################################################################
'############################     花册工具_提取典码     #################################
'########################################################################################
'########################################################################################
Function STCALL花册工具_提取典码花天按市池( _
          典码称 As Dictionary _
        , Optional 包含市指 As Boolean = False _
        , Optional 包含市基 As Boolean = False _
        , Optional 包含市票 As Boolean = False _
        , Optional 是否池金 As Boolean = True _
        , Optional 是否池银 As Boolean = True _
        , Optional 是否池铜 As Boolean = True _
        , Optional 是否池黑 As Boolean = True _
        , Optional 是否池外 As Boolean = True _
        , Optional 测试限数 As Integer = -1 _
        ) As Integer
'========================================================================================
    典码称.RemoveAll
'========================================================================================
'验证文件存在
'========================================================================================
    Dim WS花册 As Worksheet
    If STBASE外簿工具_花册链接(WS花册, 常花中股) = False Then
        Debug.Print 常花中股 & "不存在"
        Exit Function
    End If
'========================================================================================
'导入数据
'========================================================================================
    Dim 组花册 As Variant
    Call UTL数据转换_集WS2ARR(组花册, WS花册, 始行:=2, 始列:=1, 总列:=花宽主道)
'========================================================================================
'遍历
'========================================================================================
    Dim X As Integer
    For X = LBound(组花册, 1) To UBound(组花册, 1)
        CIDL = 组花册(X, 位列花天CIDL)
        代称 = 组花册(X, 位列花天代称)
        '--------------------------------------------------------------------------------
        是否提取 = False
        If 组花册(X, 位列花天市板) = 常市板指 Then
            If 包含市指 = True Then 是否提取 = True
        ElseIf 组花册(X, 位列花天市板) = 常市板基 Then
            If 包含市基 = True Then 是否提取 = True
        Else
            If 包含市票 = True Then
                是否提取 = True
            End If
        End If
        If 是否提取 = True Then
            If 组花册(X, 位列花天在池) = 常池名金 Then
                是否提取 = 是否池金
            ElseIf 组花册(X, 位列花天在池) = 常池名银 Then
                是否提取 = 是否池银
            ElseIf 组花册(X, 位列花天在池) = 常池名铜 Then
                是否提取 = 是否池铜
            ElseIf 组花册(X, 位列花天在池) = 常池名黑 Then
                是否提取 = 是否池黑
            Else
                是否提取 = 是否池外
            End If
        End If
        '--------------------------------------------------------------------------------
        If 是否提取 = True Then
            If 典码称.Exists(CIDL) = False Then 典码称.Add Key:=CIDL, Item:=代称
        End If
        '--------------------------------------------------------------------------------
        If 测试限数 > 0 And 典码称.Count > 测试限数 Then Exit For         '测试专用
        Debug.Print X, CIDL
        '--------------------------------------------------------------------------------
    Next
    Erase 组花册
'========================================================================================
'返回
'========================================================================================
    STCALL花册工具_提取典码花天按市池 = 典码称.Count
End Function


Function STCALL花册工具_提取典码花天按采样( _
          典码称 As Dictionary _
        , Optional ByVal 采样列号 As Integer = 0 _
        , Optional ByVal 采样列值 As String = "" _
        ) As Integer
'========================================================================================
'验证文件存在
'========================================================================================
    Dim WS花册 As Worksheet
    If STBASE外簿工具_花册链接(WS花册, 常花中股) = False Then
        Debug.Print 常花中股 & "不存在"
        Exit Function
    End If
'========================================================================================
'导入数据
'========================================================================================
    Dim 组花册 As Variant
    Call UTL数据转换_集WS2ARR(组花册, WS花册, 始行:=2, 始列:=1, 总列:=花宽主道)
'========================================================================================
'遍历
'========================================================================================
    Dim X As Integer
    For X = LBound(组花册, 1) To UBound(组花册, 1)
        CIDL = 组花册(X, 位列花天CIDL)
        代称 = 组花册(X, 位列花天代称)
        '--------------------------------------------------------------------------------
        采样总数 = 0
        If UBCID是中股票(CIDL) = True Or UBCID是中股基(CIDL) = True Or UBCID是中股指(CIDL) = True Then
        If 组花册(X, 采样列号) = 采样列值 Then
            采样总数 = 采样总数 + 1
            If 典码称.Exists(CIDL) = False Then 典码称.Add Key:=CIDL, Item:=代称
        End If
        End If
        '--------------------------------------------------------------------------------
    Next
    Erase 组花册
'========================================================================================
'返回
'========================================================================================
    STCALL花册工具_提取典码花天按采样 = 典码称.Count
End Function
'########################################################################################
'########################################################################################
'############################     花册工具_提取典码     #################################
'########################################################################################
'########################################################################################





'########################################################################################
'########################################################################################
'##################################     花册查询     ####################################
'########################################################################################
'########################################################################################
'========================================================================================
'========================================================================================
'格式化：补充名称与行业
'========================================================================================
'========================================================================================
'Function STCALL花册工具_花天查询全表信息( _
'          信息类型 As String _
'        , 去簿 As Worksheet _
'        , 去列 As Integer _
'        , Optional 主列 As Integer = 位qt代码 _
'        ) As Boolean
''========================================================================================
''设置去簿信息
''========================================================================================
'    Dim 末行  As Integer
'    末行 = 去簿.Cells(65536, 主列).End(xlUp).Row
'    If 末行 <= 1 Then GoTo 返点
''========================================================================================
''设置参数
''========================================================================================
'    Dim 匹配信息主列  As Integer
'    匹配信息主列 = 位列花天CIDL
'
'    Dim 匹配信息来列 As Integer
'    If 信息类型 = "代称" Then
'        匹配信息来列 = 位列花天代称
'    ElseIf 信息类型 = "地区新浪" Then
'        匹配信息来列 = 位列花天地区新浪
'    ElseIf 信息类型 = "行业新浪" Then
'        匹配信息来列 = 位列花天行业新浪
'    ElseIf 信息类型 = "行业益盟" Then
'        匹配信息来列 = 位列花天行业益盟
'    ElseIf 信息类型 = "概念益盟" Then
'        匹配信息来列 = 位列花天概念益盟
'    ElseIf 信息类型 = "市板" Then
'        匹配信息来列 = 位列花天市板
'    End If
''========================================================================================
''读取类源信息
''========================================================================================
'    Dim 信组 As Variant
'    Dim 信典 As New Dictionary
'    Dim CIDL As String
'    '------------------------------------------------------------------------------------
'    '获取信组
'    '------------------------------------------------------------------------------------
'    Call UTL数据转换_集WS2ARR(信组, ThisWorkbook.Sheets(常花中股), 总列:=花宽主道)
'    '------------------------------------------------------------------------------------
'    '制作信典
'    '------------------------------------------------------------------------------------
'    Dim X As Integer
'    For X = LBound(信组, 1) To UBound(信组, 1)
'        CIDL = 信组(X, 匹配信息主列)
'        If Len(CIDL) > 0 Then
'            信典.Add Item:=信组(X, 匹配信息来列), Key:=CIDL
'        End If
'    Next X
'    Erase 信组
''========================================================================================
''设置去簿信息
''========================================================================================
'    For X = 2 To 末行
'        CIDL = 去簿.Cells(X, 主列)
'        If LCase(CIDL) Like 常通配全码代码 Then
'            If 信典.Exists(CIDL) Then
'                去簿.Cells(X, 去列).Value = 信典(CIDL)
'            End If
'        End If
'    Next X
'    '------------------------------------------------------------------------------------
'    信典.RemoveAll
'    Set 信典 = Nothing
''========================================================================================
''返回
''========================================================================================
'返点:
'End Function




Private Sub 测试_STCALL花册工具_花天查询日基势局()
    Dim CIDL As String
    CIDL = "sh000002"
    Dim 值势局 As String
    值势局 = STCALL花册工具_花天查询日基势局(CIDL)
    Debug.Print "SSS:", 值势局
    值势局 = STCALL花册工具_花天查询神谕字段(CIDL, "cCCC", 位qt代称)
    值日层联类 = STCALL花册工具_花天查询神谕字段(CIDL, "cCCC", 位谕of日层联动)
    Debug.Print "SSS:", 值势局, 值日层联类
End Sub
'========================================================================================
'========================================================================================
'根据代码进行实时结算获取实时势局
'========================================================================================
'========================================================================================
Function STCALL花册工具_花天查询神谕字段(CIDL As String, Optional 实结类型 As String = "cCCC", Optional 位谕of待查字段 As Integer = 位qt代称) As String
        '--------------------------------------------------------------------------------
        '获取变量
        '--------------------------------------------------------------------------------
        Dim 采样典码 As New Dictionary
        采样典码.Add Item:=CIDL, Key:=CIDL
        Dim 谕组 As Variant
        Call IQQQ跨码据擎_数程生成全息(谕组, 常花中股, 实结类型:=实结类型, 采样典码:=采样典码)
        If VBA.IsEmpty(谕组) = True Then Exit Function
        STCALL花册工具_花天查询神谕字段 = 谕组(1, 位谕of待查字段)
        '--------------------------------------------------------------------------------
        Erase 谕组
        Set 采样典码 = Nothing
End Function
Function STCALL花册工具_花天查询日基势局(CIDL As String, Optional 今收 As Double = 0) As String
        '--------------------------------------------------------------------------------
        '获取变量
        '--------------------------------------------------------------------------------
        Dim 提取行元 As Range
        Dim ARROS(1 To 花宽单道) As Variant
        
        Dim WS花册 As Worksheet
        If STBASE外簿工具_花册链接(WS花册, 常花中股) Then
            With WS花册
                Set 提取行元 = .Columns(1).Find(What:=CIDL)
                If 提取行元 Is Nothing Then
                    Exit Function
                End If
                For i = 1 To 花宽单道
                    ARROS(i) = .Cells(提取行元.Row, 花列甲道).Cells(1, i)
                Next
                Set 提取行元 = Nothing
            End With
        End If
        '--------------------------------------------------------------------------------
        '进行实时结算
        '--------------------------------------------------------------------------------
        If 今收 <> 0 Then
            ARROS(位os临期) = Date
            ARROS(位os临收) = 今收
            Call STBASE结算引擎_单点结算核程(ARROS)
        End If
        '--------------------------------------------------------------------------------
        '返回
        '--------------------------------------------------------------------------------
        Dim 值势局 As String
        值势局 = ARROS(位os局势日基)
        STCALL花册工具_花天查询日基势局 = 值势局
End Function


Function STCALL花册工具_花天查询单码名称(CIDL As String) As String
    Dim WS花册 As Worksheet
    If STBASE外簿工具_花册链接(WS花册, 常花中股) = False Then Exit Function
    Dim RG As Range
    Set RG = WS花册.Columns(位列花天CIDL).Find(CIDL)
    If Not RG Is Nothing Then
        STCALL花册工具_花天查询单码名称 = WS花册.Cells(RG.Row, 位列花天代称)
    End If
    Set RG = Nothing
End Function
'Function STCALL花册工具_花天查询单码行业(CIDL As String) As String
'    Dim RG As Range
'    Set RG = ThisWorkbook.Sheets(常花中股).Columns(位列花天CIDL).Find(CIDL)
'    If Not RG Is Nothing Then
'        STCALL花册工具_花天查询单码行业 = ThisWorkbook.Sheets(常花中股).Cells(RG.Row, 位列花天行业新浪)
'    End If
'    Set RG = Nothing
'End Function
'Function STCALL花册工具_花天查询单码市日(CIDL As String) As Date
'    Dim RG As Range
'    Set RG = ThisWorkbook.Sheets(常花中股).Columns(位列花天CIDL).Find(CIDL)
'    If Not RG Is Nothing Then
'        STCALL花册工具_花天查询单码市日 = ThisWorkbook.Sheets(常花中股).Cells(RG.Row, 位列花天市日)
'    End If
'    Set RG = Nothing
'End Function
'========================================================================================
'########################################################################################
'########################################################################################
'##################################     花册查询     #####################################
'########################################################################################
'########################################################################################











'########################################################################################
'########################################################################################
'#################################  花册工具  基础功能  ##################################
'########################################################################################
'########################################################################################
''========================================================================================
''========================================================================================
''读取HXOS
''========================================================================================
''========================================================================================
'Function STCALL花册工具_花天读取罗盘(ARRHXOS As Variant, 指定期类 As String) As Boolean
'    '------------------------------------------------------------------------------------
'    Dim 列定位 As Integer
'    If 指定期类 = 常期类为日 Then
'        列定位 = 花列甲道
'    ElseIf 指定期类 = 常期类为周 Then
'        列定位 = 花列乙道
'    End If
'    '------------------------------------------------------------------------------------
'    If UTL判断工表存在(常花中股) Then
'        Call UTL数据转换_集WS2ARR(ARRHXOS, ThisWorkbook.Sheets(常花中股), 始行:=2, 始列:=列定位, 总列:=花宽单道)
'    End If
'    '------------------------------------------------------------------------------------
'End Function
'########################################################################################
'########################################################################################
'#################################  花册工具  基础功能  ##################################
'########################################################################################
'########################################################################################

