Attribute VB_Name = "ROS据管_DM1结算管理"


'########################################################################################
'########################################################################################
'#################################   结算管理  全新结算    ##############################
'########################################################################################
'########################################################################################
'========================================================================================
'统一进行导入结算
'========================================================================================
Sub STBASE结算管理_全新结算调程花天()
    TTT = Timer
    '------------------------------------------------------------------------------------
    '------------------------------------------------------------------------------------
    Dim 指定花册 As String
    指定花册 = 常花中股
    Dim 指定文夹 As String
    指定文夹 = 全设基夹中股
    Dim 指定头码 As String
    指定头码 = 常查询代码中股
    Dim 基色底 As Long
    基色底 = 常色主靛
    '------------------------------------------------------------------------------------
    Dim 指定结期上限 As Date
    指定结期上限 = Date   '"2022/8/17" '
    Dim 指定结期下限 As Date
    '注20240215：为测试节约时间，在非交易日缩短结算时间
    If 时程结期判断IS类日(Date) = True Then
        指定结期下限 = 常结期下限市场
    Else
        指定结期下限 = "2010/1/1"
    End If
    指定结期下限 = 常结期下限市场
    '------------------------------------------------------------------------------------
    '------------------------------------------------------------------------------------
    Dim MSG As String
    MSG = MSG & "【调始时刻】" & Format(Time, "Long Time") & vbCrLf
    '------------------------------------------------------------------------------------
    '结算区域：罗盘
    '------------------------------------------------------------------------------------
    MSG = MSG & STBASE结算引擎_全新结算正程(指定花册, 指定文夹, 基色底:=基色底, 指定结期下限:=指定结期下限, 指定结期上限:=指定结期上限, 指定头码:=指定头码)
    '结算区域：主道基本信息
    MSG = MSG & vbCrLf
    MSG = MSG & STCALL花册管理_重制花天P9正程设置信息(是否更新市板:=True, 是否更新在池:=True, 是否更新停牌:=True, 是否更新代称:=True)
    '------------------------------------------------------------------------------------
    '结算区域：藏库
    '------------------------------------------------------------------------------------
    MSG = MSG & vbCrLf
    MSG = MSG & STBASE藏库引擎_更新主程(指定期类:=常期类为日, 是否新建藏库:=True, 是否更新全量:=True, 是否更新源AK:=True)
    '------------------------------------------------------------------------------------
    '结算区域：历统时
    '------------------------------------------------------------------------------------
    MSG = MSG & vbCrLf
    MSG = MSG & STBASE结算引擎_历统时正程(指定花册, 指定结期上限:=指定结期上限)
    '------------------------------------------------------------------------------------
    '------------------------------------------------------------------------------------
    MSG = MSG & vbCrLf
    MSG = MSG & "【调终时刻】" & Format(Time, "Long Time") & vbCrLf
    MSG = MSG & "【总计耗时】" & CLng(Timer - TTT) & vbCrLf
    Debug.Print MSG
    ThisWorkbook.Activate
    MsgBox MSG, vbOKOnly, "结算中枢 全新结算"
    '------------------------------------------------------------------------------------
End Sub




'########################################################################################
'########################################################################################
'#############################     外盘管理_花册     ####################################
'########################################################################################
'########################################################################################
'========================================================================================
'########################################################################################
'#############################     外盘管理_花中期       ################################
'########################################################################################
Sub STBASE结算管理_全新结算调程花中期()
    UTL宏工具_BEGIN
'========================================================================================
'花册：建立（外部花册）
'========================================================================================
    Dim WS花册 As Worksheet
    If STBASE外簿工具_花册链接(WS花册, 常花中期) = False Then
        UTL宏工具_END
        Exit Sub
    End If
    Dim 花册簿 As Workbook
    Set 花册簿 = WS花册.Parent
    Call PBASE格程工具_表操工表新增(WS花册, 常花中期, wb:=花册簿, 基色底:=常色四紫)
'========================================================================================
'TS：导入文件
'========================================================================================
    Dim FILEOPEN
'    FILEOPEN = Application.GetOpenFilename("csv文件,*.csv", , "请选择由python下载的文件", , False)
'    If FILEOPEN = False Then
'        UTL宏工具_END
'        Exit Sub
'    End If
    '------------------------------------------------------------------------------------
    '设置原始列号
    '------------------------------------------------------------------------------------
    Dim 位列TS代码 As Integer
    Dim 位列TS代称 As Integer
    Dim 位列TS交所 As Integer
    '------------------------------------------------------------------------------------
    '导入数组
    '------------------------------------------------------------------------------------
    FILEOPEN = 全设基夹根 & "\BaseAS中期.csv"
    Dim WBTS As Workbook
    Set WBTS = GetObject(FILEOPEN)
    Dim ARRTS  As Variant
    With WBTS.ActiveSheet
        ARRTS = .Range("A1").CurrentRegion
        位列TS代码 = .Rows(1).Find(What:="symbol").Column
        位列TS代称 = .Rows(1).Find(What:="name").Column
        位列TS交所 = .Rows(1).Find(What:="exchange").Column
    End With
    WBTS.Close False
    Set WBTS = Nothing
'========================================================================================
'花册：导入股票列表
'========================================================================================
    Dim sdate As String
    Dim 市日 As Date
    Dim CIDV As Variant
    Dim CIDL As String
    '====================================================================================
    '合并 TSstock
    '====================================================================================
    Dim 计数导入 As Integer
    Dim 主列行号 As Integer
    Dim 遍历序号 As Integer
    
    计数导入 = 0
    For 遍历序号 = LBound(ARRTS, 1) + 1 To UBound(ARRTS, 1)
        '--------------------------------------------------------------------------------
        计数导入 = 计数导入 + 1
        主列行号 = 计数导入 + 1
        '--------------------------------------------------------------------------------
        '处理代码
        '--------------------------------------------------------------------------------
        CIDV = ARRTS(遍历序号, 位列TS代码)
        CIDL = "fx" & CIDV
        WS花册.Cells(主列行号, 位列花天CIDS) = CIDV
        WS花册.Cells(主列行号, 位列花天CIDL) = CIDL
        '--------------------------------------------------------------------------------
        WS花册.Cells(主列行号, 位列花天代称) = ARRTS(遍历序号, 位列TS代称)
        WS花册.Cells(主列行号, 位列花天交易所码) = ARRTS(遍历序号, 位列TS交所)
        '--------------------------------------------------------------------------------
        Debug.Print "花册单票列表导入>>>"; 遍历序号
        '--------------------------------------------------------------------------------
    Next
    Erase ARRTS
'========================================================================================
'花册：格式化
'========================================================================================
    Call STCALL花册工具_花册格程(WS花册)
'========================================================================================
'清理
'========================================================================================
    STBASE外簿工具_花册关闭 花册簿, 常花中期, 是否保存修改:=True
    Set WS花册 = Nothing
    '------------------------------------------------------------------------------------
    UTL宏工具_END
'========================================================================================
''    MsgBox "导入" _
''            & vbCrLf & "计数单票 >>" & 计数导入 _
''            , vbOKOnly _
''            , "导入花册"
''========================================================================================
    '------------------------------------------------------------------------------------
    Dim 指定花册 As String
    指定花册 = 常花中期
    Dim 指定文夹 As String
    指定文夹 = 全设基夹中期
    Dim 指定头码 As String
    指定头码 = "fxIH0"
    Dim 指定结期上限 As Date
    指定结期上限 = Date
    Dim 基色底 As Long
    基色底 = 常色六青
    '------------------------------------------------------------------------------------
    Dim MSG As String
    MSG = STBASE结算引擎_全新结算正程(指定花册, 指定文夹, 基色底:=基色底, 指定结期上限:=指定结期上限, 指定头码:=指定头码)
    Dim WS花册尾 As Worksheet
    If STBASE外簿工具_花册链接(WS花册尾, 指定花册) Then
        WS花册尾.Columns("C:Z").Hidden = True
        WS花册尾.Columns(位列花天CIDL).ColumnWidth = 8
        WS花册尾.Columns(位列花天交易所码).ColumnWidth = 5
        WS花册尾.Columns(位列花天CIDS).ColumnWidth = 4
    End If
    STBASE外簿工具_花册保存 指定花册
    '------------------------------------------------------------------------------------
    Debug.Print MSG
    'MsgBox MSG, vbOKOnly, "结算中枢 全新结算"
End Sub
'########################################################################################
'#############################     外盘管理_花中期    ###################################
'########################################################################################



'########################################################################################
'#############################     外盘管理_花港股指     ################################
'########################################################################################
Sub STBASE结算管理_全新结算调程花港股指()
    UTL宏工具_BEGIN
'========================================================================================
'花册：建立（外部花册）
'========================================================================================
    Dim WS花册 As Worksheet
    If STBASE外簿工具_花册链接(WS花册, 常花港股指) = False Then
        UTL宏工具_END
        Exit Sub
    End If
    Dim 花册簿 As Workbook
    Set 花册簿 = WS花册.Parent
    Call PBASE格程工具_表操工表新增(WS花册, 常花港股指, wb:=花册簿, 基色底:=常色四紫)
'========================================================================================
'TS：导入文件
'========================================================================================
    Dim FILEOPEN
'    FILEOPEN = Application.GetOpenFilename("csv文件,*.csv", , "请选择由python下载的文件", , False)
'    If FILEOPEN = False Then
'        UTL宏工具_END
'        Exit Sub
'    End If
    '------------------------------------------------------------------------------------
    '设置原始列号
    '------------------------------------------------------------------------------------
    Dim 位列TS代码 As Integer
    Dim 位列TS代称 As Integer
    '------------------------------------------------------------------------------------
    '导入数组
    '------------------------------------------------------------------------------------
    FILEOPEN = 全设基夹根 & "\BaseAS港股指.csv"
    Dim WBTS As Workbook
    Set WBTS = GetObject(FILEOPEN)
    Dim ARRTS  As Variant
    With WBTS.ActiveSheet
        ARRTS = .Range("A1").CurrentRegion
        位列TS代码 = .Rows(1).Find(What:="代码").Column
        位列TS代称 = .Rows(1).Find(What:="名称").Column
    End With
    WBTS.Close False
    Set WBTS = Nothing
'========================================================================================
'花册：导入股票列表
'========================================================================================
    Dim sdate As String
    Dim 市日 As Date
    Dim CIDV As Variant
    Dim CIDL As String
    '====================================================================================
    '合并 TSstock
    '====================================================================================
    Dim 计数导入 As Integer
    Dim 主列行号 As Integer
    Dim 遍历序号 As Integer
    
    计数导入 = 0
    For 遍历序号 = LBound(ARRTS, 1) + 1 To UBound(ARRTS, 1)
        '--------------------------------------------------------------------------------
        计数导入 = 计数导入 + 1
        主列行号 = 计数导入 + 1
        '--------------------------------------------------------------------------------
        '处理代码
        '--------------------------------------------------------------------------------
        CIDV = ARRTS(遍历序号, 位列TS代码)
        CIDL = "HKIX." & CIDV
        WS花册.Cells(主列行号, 位列花天CIDS) = CIDV
        WS花册.Cells(主列行号, 位列花天CIDL) = CIDL
        '--------------------------------------------------------------------------------
        WS花册.Cells(主列行号, 位列花天代称) = ARRTS(遍历序号, 位列TS代称)
        '--------------------------------------------------------------------------------
        Debug.Print "花册单票列表导入>>>"; 遍历序号
        '--------------------------------------------------------------------------------
    Next
    Erase ARRTS
'========================================================================================
'花册：格式化
'========================================================================================
    Call STCALL花册工具_花册格程(WS花册)
'========================================================================================
'清理
'========================================================================================
    STBASE外簿工具_花册关闭 花册簿, 常花港股指, 是否保存修改:=True
    Set WS花册 = Nothing
    '------------------------------------------------------------------------------------
    UTL宏工具_END
'========================================================================================
''    MsgBox "导入" _
''            & vbCrLf & "计数单票 >>" & 计数导入 _
''            , vbOKOnly _
''            , "导入花册"
'''========================================================================================
''End Sub
''Private Sub STBASE结算管理_全新结算调程花港股指()
    '------------------------------------------------------------------------------------
    Dim 指定花册 As String
    指定花册 = 常花港股指
    Dim 指定文夹 As String
    指定文夹 = 全设基夹港股
    Dim 指定头码 As String
    指定头码 = "HKIX.HSCI"
    Dim 指定结期上限 As Date
    指定结期上限 = Date
    Dim 基色底 As Long
    基色底 = 常色六青
    '------------------------------------------------------------------------------------
    Dim MSG As String
    MSG = STBASE结算引擎_全新结算正程(指定花册, 指定文夹, 基色底:=基色底, 指定结期上限:=指定结期上限, 指定头码:=指定头码)
    Dim WS花册尾 As Worksheet
    If STBASE外簿工具_花册链接(WS花册尾, 指定花册) Then
        WS花册尾.Columns("C:Z").Hidden = True
        WS花册尾.Columns(位列花天CIDL).ColumnWidth = 12
        WS花册尾.Columns(位列花天代称).ColumnWidth = 30
        WS花册尾.Columns(位列花天代称).HorizontalAlignment = xlLeft
        WS花册尾.Columns(位列花天CIDS).ColumnWidth = 8
    End If
    STBASE外簿工具_花册保存 指定花册
    '------------------------------------------------------------------------------------
    Debug.Print MSG
    'MsgBox MSG, vbOKOnly, "结算中枢 全新结算"
End Sub
'########################################################################################
'#############################     外盘管理_花港股指     ################################
'########################################################################################



'########################################################################################
'#############################     外盘管理_花港股通     ################################
'########################################################################################
Sub STBASE结算管理_全新结算调程花港股通()
    UTL宏工具_BEGIN
'========================================================================================
'花册：建立（外部花册）
'========================================================================================
    Dim WS花册 As Worksheet
    If STBASE外簿工具_花册链接(WS花册, 常花港股通) = False Then
        UTL宏工具_END
        Exit Sub
    End If
    Dim 花册簿 As Workbook
    Set 花册簿 = WS花册.Parent
    Call PBASE格程工具_表操工表新增(WS花册, 常花港股通, wb:=花册簿, 基色底:=常色四紫)
'========================================================================================
'TS：导入文件
'========================================================================================
    Dim FILEOPEN
'    FILEOPEN = Application.GetOpenFilename("csv文件,*.csv", , "请选择由python下载的文件", , False)
'    If FILEOPEN = False Then
'        UTL宏工具_END
'        Exit Sub
'    End If
    '------------------------------------------------------------------------------------
    '设置原始列号
    '------------------------------------------------------------------------------------
    Dim 位列TS代码 As Integer
    Dim 位列TS代称 As Integer
    '------------------------------------------------------------------------------------
    '导入数组
    '------------------------------------------------------------------------------------
    FILEOPEN = 全设基夹根 & "\BaseAS港股通.csv"
    Dim WBTS As Workbook
    Set WBTS = GetObject(FILEOPEN)
    Dim ARRTS  As Variant
    With WBTS.ActiveSheet
        ARRTS = .Range("A1").CurrentRegion
        位列TS代码 = .Rows(1).Find(What:="代码").Column
        位列TS代称 = .Rows(1).Find(What:="名称").Column
    End With
    WBTS.Close False
    Set WBTS = Nothing
'========================================================================================
'花册：导入股票列表
'========================================================================================
    Dim sdate As String
    Dim 市日 As Date
    Dim CIDV As Variant
    Dim CIDL As String
    '====================================================================================
    '合并 TSstock
    '====================================================================================
    Dim 计数导入 As Integer
    Dim 主列行号 As Integer
    Dim 遍历序号 As Integer
    
    计数导入 = 0
    For 遍历序号 = LBound(ARRTS, 1) + 1 To UBound(ARRTS, 1)
        '--------------------------------------------------------------------------------
        计数导入 = 计数导入 + 1
        主列行号 = 计数导入 + 1
        '--------------------------------------------------------------------------------
        '处理代码
        '--------------------------------------------------------------------------------
        CIDV = ARRTS(遍历序号, 位列TS代码)
        CIDL = "r_hk" & Format$(CIDV, "00000")
        WS花册.Cells(主列行号, 位列花天CIDS) = CIDV
        WS花册.Cells(主列行号, 位列花天CIDL) = CIDL
        '--------------------------------------------------------------------------------
        WS花册.Cells(主列行号, 位列花天代称) = ARRTS(遍历序号, 位列TS代称)
        '--------------------------------------------------------------------------------
        Debug.Print "花册单票列表导入>>>"; 遍历序号
        '--------------------------------------------------------------------------------
    Next
    Erase ARRTS
'========================================================================================
'花册：格式化
'========================================================================================
    Call STCALL花册工具_花册格程(WS花册)
'========================================================================================
'清理
'========================================================================================
    STBASE外簿工具_花册关闭 花册簿, 常花港股通, 是否保存修改:=True
    Set WS花册 = Nothing
    '------------------------------------------------------------------------------------
    UTL宏工具_END
'========================================================================================
''    MsgBox "导入" _
''            & vbCrLf & "计数单票 >>" & 计数导入 _
''            , vbOKOnly _
''            , "导入花册"
'''========================================================================================
''End Sub
''Private Sub STBASE结算管理_全新结算调程花港股通()
    '------------------------------------------------------------------------------------
    Dim 指定花册 As String
    指定花册 = 常花港股通
    Dim 指定文夹 As String
    指定文夹 = 全设基夹港股
    Dim 指定头码 As String
    指定头码 = 常查询代码港股
    Dim 指定结期上限 As Date
    指定结期上限 = Date
    Dim 基色底 As Long
    基色底 = 常色六青
    '------------------------------------------------------------------------------------
    Dim MSG As String
    MSG = STBASE结算引擎_全新结算正程(指定花册, 指定文夹, 基色底:=基色底, 指定结期上限:=指定结期上限, 指定头码:=指定头码)
    Dim WS花册尾 As Worksheet
    If STBASE外簿工具_花册链接(WS花册尾, 指定花册) Then
        WS花册尾.Columns("C:Z").Hidden = True
        WS花册尾.Columns(位列花天CIDL).ColumnWidth = 12
        WS花册尾.Columns(位列花天代称).ColumnWidth = 16
    End If
    STBASE外簿工具_花册保存 指定花册
    '------------------------------------------------------------------------------------
    Debug.Print MSG
    'MsgBox MSG, vbOKOnly, "结算中枢 全新结算"
End Sub
'########################################################################################
'#############################     外盘管理_花港股通     ################################
'########################################################################################


'########################################################################################
'#############################     外盘管理_花美股票     ################################
'########################################################################################
Sub STBASE结算管理_全新结算调程花美股票()
    UTL宏工具_BEGIN
'========================================================================================
'花册：建立（外部花册）
'========================================================================================
    Dim WS花册 As Worksheet
    If STBASE外簿工具_花册链接(WS花册, 常花美股) = False Then
        UTL宏工具_END
        Exit Sub
    End If
    Dim 花册簿 As Workbook
    Set 花册簿 = WS花册.Parent
    Call PBASE格程工具_表操工表新增(WS花册, 常花美股, wb:=花册簿, 基色底:=常色四紫)
'========================================================================================
'TS：导入文件
'========================================================================================
    Dim FILEOPEN
    FILEOPEN = Application.GetOpenFilename("csv文件,*.csv", , "请选择由富途证券导出的美股列表", , False)
    If FILEOPEN = False Then
        UTL宏工具_END
        Exit Sub
    End If
    '------------------------------------------------------------------------------------
    '设置原始列号
    '------------------------------------------------------------------------------------
    Dim 位列TS代码 As Integer
    Dim 位列TS代称 As Integer
    Dim 位列TS行业 As Integer
    Dim 位列TS流通市值 As Integer
    '------------------------------------------------------------------------------------
    '导入数组
    '------------------------------------------------------------------------------------
    Dim WBTS As Workbook
    Set WBTS = GetObject(FILEOPEN)
    Dim ARRTS  As Variant
    With WBTS.ActiveSheet
        ARRTS = .Range("A1").CurrentRegion
        位列TS代码 = .Rows(1).Find(What:="代码").Column
        位列TS代称 = .Rows(1).Find(What:="名称").Column
        '位列TS行业 = .Rows(1).Find(what:="所属行业").Column
        位列TS流通市值 = .Rows(1).Find(What:="总市值").Column
    End With
    WBTS.Close False
    Set WBTS = Nothing
'========================================================================================
'花册：导入股票列表
'========================================================================================
    Dim sdate As String
    Dim 市日 As Date
    Dim CIDV As Variant
    Dim CIDL As String
    '====================================================================================
    '合并 TSstock
    '====================================================================================
    Dim 计数导入 As Integer
    Dim 主列行号 As Integer
    Dim 遍历序号 As Integer
    
    计数导入 = 0
    For 遍历序号 = LBound(ARRTS, 1) + 1 To UBound(ARRTS, 1)
'        If InStr(ARRTS(遍历序号, 位列TS流通市值), "亿") > 0 Then
'            值流通市值 = VBA.Replace(ARRTS(遍历序号, 位列TS流通市值), "亿", "E8")
'        ElseIf InStr(ARRTS(遍历序号, 位列TS流通市值), "万") > 0 Then
'            值流通市值 = VBA.Replace(ARRTS(遍历序号, 位列TS流通市值), "万", "E4")
'        Else
'            值流通市值 = 0
'        End If
'        值流通市值 = Round(值流通市值 / 100000000, 0)
        值流通市值 = ARRTS(遍历序号, 位列TS流通市值)
        
        If 值流通市值 >= 100 Or InStr(ARRTS(遍历序号, 位列TS代称), "(ADR)") > 0 Then
        '--------------------------------------------------------------------------------
            计数导入 = 计数导入 + 1
            主列行号 = 计数导入 + 1
            '-------------------------------------------------------------------------------
            '处理代码
            '-------------------------------------------------------------------------------
            CIDV = ARRTS(遍历序号, 位列TS代码)
            CIDL = "s_us" & Mid$(CIDV, 5)
            WS花册.Cells(主列行号, 位列花天CIDS) = CIDV
            WS花册.Cells(主列行号, 位列花天CIDL) = CIDL
    '        '--------------------------------------------------------------------------------
    '        '市日
    '        '--------------------------------------------------------------------------------
    '        sdate = ARRTS(遍历序号, 位列TS上市始日)
    '        If sdate Like "########" Then
    '            市日 = DateSerial(Left$(sdate, 4), Mid$(sdate, 5, 2), Mid$(sdate, 7, 2))
    '        Else
    '            市日 = 0
    '        End If
    '        WS花册.Cells(主列行号, 位列花天市日) = 市日
    '        '--------------------------------------------------------------------------------
            WS花册.Cells(主列行号, 位列花天代称) = ARRTS(遍历序号, 位列TS代称)
'            WS花册.Cells(主列行号, 位列花天行业新浪) = ARRTS(遍历序号, 位列TS行业)
        '--------------------------------------------------------------------------------
        End If
        Debug.Print "花册单票列表导入>>>"; 遍历序号
        '--------------------------------------------------------------------------------
    Next
    Erase ARRTS
'========================================================================================
'花册：格式化
'========================================================================================
    Call STCALL花册工具_花册格程(WS花册)
'========================================================================================
'清理
'========================================================================================
    STBASE外簿工具_花册关闭 花册簿, 常花美股, 是否保存修改:=True
    Set WS花册 = Nothing
    '------------------------------------------------------------------------------------
    UTL宏工具_END
'========================================================================================
''    MsgBox "导入" _
''            & vbCrLf & "计数单票 >>" & 计数导入 _
''            , vbOKOnly _
''            , "导入花册"
'''========================================================================================
''End Sub
''Private Sub STBASE结算管理_全新结算调程花美股票()
    '------------------------------------------------------------------------------------
    Dim 指定花册 As String
    指定花册 = 常花美股
    Dim 指定文夹 As String
    指定文夹 = 全设基夹美股
    Dim 指定头码 As String
    指定头码 = 常查询代码美股
    Dim 指定结期上限 As Date
    指定结期上限 = Date
    Dim 基色底 As Long
    基色底 = 常色六青
    '------------------------------------------------------------------------------------
    Dim MSG As String
    MSG = STBASE结算引擎_全新结算正程(指定花册, 指定文夹, 基色底:=基色底, 指定结期上限:=指定结期上限, 指定头码:=指定头码)
    Dim WS花册尾 As Worksheet
    If STBASE外簿工具_花册链接(WS花册尾, 指定花册) Then
        WS花册尾.Columns("C:Z").Hidden = True
        WS花册尾.Columns(位列花天CIDL).ColumnWidth = 12
        WS花册尾.Columns(位列花天代称).ColumnWidth = 16
    End If
    STBASE外簿工具_花册保存 指定花册
    '------------------------------------------------------------------------------------
    Debug.Print MSG
    'MsgBox MSG, vbOKOnly, "结算中枢 全新结算"
End Sub
'########################################################################################
'#############################     外盘管理_花美股票     ################################
'########################################################################################
'========================================================================================
'########################################################################################
'########################################################################################
'#############################     外盘管理_花册     ####################################
'########################################################################################
'########################################################################################





'========================================================================================
'========================================================================================
'通用调用程序：导入结算
'========================================================================================
'========================================================================================
Function STBASE结算引擎_全新结算正程( _
          ByVal 指定花册 As String _
        , ByVal 指定文夹 As String _
        , Optional ByVal 指定结期上限 As Date = 常结期上限市场 _
        , Optional ByVal 指定结期下限 As Date = 常结期下限市场 _
        , Optional ByVal 基色底 As Long _
        , Optional ByVal 指定头码 As String = 常查询代码中股 _
        ) As String
'========================================================================================
'前置验证
'========================================================================================
    Dim MSG As String
    '------------------------------------------------------------------------------------
    '验证容积
    '------------------------------------------------------------------------------------
'    If 位os容积 > 花宽单道 Then
'        MSG = "OS容积不足：" & 位os容积 & " > " & 花宽单道
'        TCALL结算引擎_全新结算正程 = MSG
'        Exit Function
'    End If
    '------------------------------------------------------------------------------------
    '前置验证：文件夹
    '------------------------------------------------------------------------------------
    If UTL判断路径存在(指定文夹) = False Then
        MSG = "CSV文件夹不存在：" & 指定文夹
        STBASE结算引擎_全新结算正程 = MSG
        Exit Function
    End If
    '------------------------------------------------------------------------------------
    '前置验证：花册
    '------------------------------------------------------------------------------------
    Dim WS花册 As Worksheet
    If 指定花册 = 常花中期 Or 指定花册 = 常花港股指 Or 指定花册 = 常花港股通 Or 指定花册 = 常花美股 Or 指定花册 = 常花中股 Then
        If STBASE外簿工具_花册链接(WS花册, 指定花册) = False Then
            MSG = "外部花册链接失败：" & 指定花册
            STBASE结算引擎_全新结算正程 = MSG
            Exit Function
        End If
    Else
        If UTL判断工表存在(指定花册) = False Then
            MSG = "对应花册不存在：" & 指定花册
            STBASE结算引擎_全新结算正程 = MSG
            Exit Function
        End If
        Set WS花册 = ThisWorkbook.Sheets(指定花册)
    End If
'========================================================================================
    UTL宏工具_BEGIN
    TTT = Timer
'========================================================================================
'数据处理
'========================================================================================
    '====================================================================================
    '进行结算
    '====================================================================================
    '推断结算日：保证其是库中能够确切取到的最大结期
    指定结期上限 = STBASE取据引擎查时戳由外库(指定结期上限:=指定结期上限)
    '------------------------------------------------------------------------------------
    Dim 组结算 As Variant
    Dim 计数导入 As Integer
    计数导入 = STBASE结算引擎_全新结算数程由外库(组结算, WS花册, 指定结期上限:=指定结期上限, 指定结期下限:=指定结期下限)
    '====================================================================================
    '输出数据
    '====================================================================================
    '设置停牌
    Dim MSG停牌 As String
    MSG停牌 = STCALL花册管理_重制花天P9子程重置信息8停牌(组结算, 法道基列:=1, 指定花册:=指定花册, 指定头码:=指定头码)
    Call UTL数据转换_集ARR2WS(组结算, WS花册, 始行:=2, 始列:=花列甲道)
    Erase 组结算
    '====================================================================================
    '格式化
    '====================================================================================
    Call STCALL花册工具_花册格程(WS花册, 基色底:=基色底)
    Set WS花册 = Nothing
'========================================================================================
'清理
'========================================================================================
    MSG = MSG & vbCrLf & "【任务】导入花册"
    MSG = MSG & vbCrLf & "【花册】" & 指定花册
    MSG = MSG & vbCrLf & "【文夹】" & 指定文夹
    MSG = MSG & vbCrLf & "【计数导入】" & 计数导入
    MSG = MSG & vbCrLf & "【计数停牌】" & MSG停牌
    MSG = MSG & vbCrLf & "【全新结算耗时】" & CInt(Timer - TTT) & vbCrLf
'========================================================================================
'返回
'========================================================================================
    ThisWorkbook.Save
    UTL宏工具_END
    '------------------------------------------------------------------------------------
    STBASE结算引擎_全新结算正程 = MSG
End Function
Function STBASE结算引擎_全新结算数程由外库( _
          ByRef 组结算 As Variant _
        , ByRef WS花册 As Worksheet _
        , Optional ByVal 指定结期上限 As Date = 常结期上限市场 _
        , Optional ByVal 指定结期下限 As Date = 常结期下限市场 _
        ) As Integer
'========================================================================================
'读取类源信息
'========================================================================================
    '------------------------------------------------------------------------------------
    '获取信组
    '------------------------------------------------------------------------------------
    Dim 组花册 As Variant
    Call UTL数据转换_集WS2ARR(组花册, WS花册, 总列:=花宽主道)
'========================================================================================
'变量声明
'========================================================================================
    '数组：到点结算
    ReDim 组结算(LBound(组花册, 1) To UBound(组花册, 1), 1 To 花宽单道 * 3) As Variant
    '数组：单点结算
    Dim ARRCSVD As Variant
    Dim ARROSD(1 To 花宽单道) As Variant
    Dim ARROSW(1 To 花宽单道) As Variant
    Dim ARROSM(1 To 花宽单道) As Variant
    '====================================
    Dim CIDL As String
    Dim 计期已结算本码 As Integer
    Dim 计数已结算到位  As Integer
    Dim 计数未结算到位  As Integer
    Dim 结日更新 As Date
    Dim 结日记录 As Date
    Dim i As Integer
    Dim 导入代称 As String
'========================================================================================
'循环导入
'========================================================================================
    Dim 遍历序号 As Integer
    For 遍历序号 = LBound(组花册, 1) To UBound(组花册, 1)
        '-----------------------------------------------------------------------------
        CIDL = 组花册(遍历序号, 位列花天CIDL)
        导入代称 = 组花册(遍历序号, 位列花天代称)
        '================================================================================
        '进行结算
        '================================================================================
        If UBCID是代码(CIDL) Then
            '============================================================================
            ARROSD(位os代码) = CIDL
            ARROSD(位os期类) = 常期类为日
            ARROSW(位os代码) = CIDL
            ARROSW(位os期类) = 常期类为周
            ARROSM(位os代码) = CIDL
            ARROSM(位os期类) = 常期类为月
            '----------------------------------------------------------------------------
            计数日类 = STBASE取据引擎_工具取据由外库(ARRCSVD, CIDL, 指定结期上限:=指定结期上限, 指定结期下限:=指定结期下限)
            If 计数日类 > 0 Then
                计期已结算本码 = STBASE结算引擎_区间基码数程(ARRCSVD, ARROSD, ARROSW, ARROSM, 指定结期上限:=指定结期上限, 指定结期下限:=指定结期下限)
            End If
            '----------------------------------------------------------------------------
            For i = 1 To 花宽单道
                组结算(遍历序号, i) = ARROSD(i)
                组结算(遍历序号, 花宽单道 * 1 + i) = ARROSW(i)
                组结算(遍历序号, 花宽单道 * 2 + i) = ARROSM(i)
            Next i
            Erase ARROSD
            Erase ARROSW
            Erase ARROSM
            '============================================================================
            结日记录 = 组结算(遍历序号, 位os基市期)
            结日更新 = 组结算(遍历序号, 位os结期)
            If 结日更新 = 指定结期上限 Then
                计数已结算到位 = 计数已结算到位 + 1
            Else
                计数未结算到位 = (遍历序号 - LBound(组结算, 1) + 1) - 计数已结算到位
            End If
            Debug.Print "结算管理_全新结算由外库>>" & UBound(组花册, 1) & "/" & 遍历序号 & " 已到位:" & 计数已结算到位 & " 未到位:" & 计数未结算到位 & ">>" _
                & "[" & Format(结日记录, "yyyy/mm/dd") & "--" & Format(结日更新, "yyyy/mm/dd") & "]= " & Format(计期已结算本码, "@@@@") _
                & "  " & CIDL & "  " & 导入代称
            '----------------------------------------------------------------------------
            'If 遍历序号 > 20 Then Exit For
            '============================================================================
        End If
        '================================================================================
    Next 遍历序号
'========================================================================================
'返回
'========================================================================================
    Erase 组花册
    STBASE结算引擎_全新结算数程由外库 = 计数已结算到位
End Function
'########################################################################################
'########################################################################################
'#################################   结算管理  全新结算    ##############################
'########################################################################################
'########################################################################################




'########################################################################################
'########################################################################################
'#################################   结算管理  历统时      ##############################
'########################################################################################
'########################################################################################
'========================================================================================
'========================================================================================
'功能：对花册OS进行历统跨时
'========================================================================================
'========================================================================================
Sub STBASE结算引擎_历统时正程调程()
    MSG = STBASE结算引擎_历统时正程(常花中股, 指定结期上限:=Date)
    MsgBox MSG
End Sub
Function STBASE结算引擎_历统时正程( _
          Optional ByVal 指定花册 As String = 常花中股 _
        , Optional ByVal 指定结期上限 As Date = 常结期上限市场 _
        , Optional ByVal 指定结期下限 As Date = 常结期下限市场 _
        ) As String
'========================================================================================
'制作字典
'========================================================================================
    Dim WS花册 As Worksheet
    If 指定花册 = 常花中期 Or 指定花册 = 常花港股指 Or 指定花册 = 常花港股通 Or 指定花册 = 常花美股 Or 指定花册 = 常花中股 Then
        If STBASE外簿工具_花册链接(WS花册, 指定花册) = False Then
            MsgBox "对应花册不存在"
            Exit Function
        End If
    Else
        If UTL判断工表存在(指定花册) = False Then
            MsgBox "对应花册不存在"
            Exit Function
        End If
        Set WS花册 = ThisWorkbook.Sheets(指定花册)
    End If
    Dim 组花册 As Variant
    Call UTL数据转换_集WS2ARR(组花册, WS花册, 始行:=2, 始列:=1, 总列:=花宽主道)
    '------------------------------------------------------------------------------------
    '制作字典
    '------------------------------------------------------------------------------------
    Dim 典码称 As New Dictionary
    Dim 典码行 As New Dictionary
    Dim X As Integer
    For X = LBound(组花册, 1) To UBound(组花册, 1)
        CIDL = 组花册(X, 位列花天CIDL)
        代称 = 组花册(X, 位列花天代称)
        If UBCID是中股(CIDL) = True Then
            典码称.Add Key:=CIDL, Item:=代称
            典码行.Add Key:=CIDL, Item:=X
        End If
        'If 典码称.Count > 50 Then Exit For
    Next
    Dim 码数 As Integer
    码数 = 典码称.Count
'========================================================================================
    UTL宏工具_BEGIN
    Dim MSG As String
    TT = Timer
'========================================================================================
'加工数据
'========================================================================================
    Dim 组历统时 As Variant
    Call 历研统时引擎2数程(组历统时, 典码称, 指定结期上限:=指定结期上限)
    '------------------------------------------------------------------------------------
    ReDim 组历统时花册(LBound(组花册, 1) To UBound(组花册, 1), 位统时列总始 To 位统时列总终) As Variant
    '------------------------------------------------------------------------------------
    For X = LBound(组历统时, 1) To UBound(组历统时, 1)
        CIDL = 组历统时(X, 位统时列CIDL)
        If 典码行.Exists(CIDL) = True Then
            定行花册 = 典码行(CIDL)
            For Y = 位统时列总始 To 位统时列总终
                组历统时花册(定行花册, Y) = 组历统时(X, Y)
            Next
        End If
    Next
    Set 典码称 = Nothing
    Set 典码行 = Nothing
'========================================================================================
'输出到花册
'========================================================================================
    Dim 结期统终 As Date
    结期统终 = 组历统时花册(1, 位统时列结期)
    '------------------------------------------------------------------------------------
    Call STCALL花册工具_花册格程(WS花册, 基色底:=常色主靛)
    Call 历研统时引擎5格程按列(WS花册, 始列:=花列统道)
    '------------------------------------------------------------------------------------
    Call UTL数据转换_集ARR2WS(组历统时花册, WS花册, 始行:=2, 始列:=花列统道)
    Erase 组历统时花册
    Set WS花册 = Nothing
'========================================================================================
'返回
'========================================================================================
    UTL宏工具_END
    '------------------------------------------------------------------------------------
    MSG = MSG & "【任务】历统跨时" & vbCrLf
    MSG = MSG & "【历统码数】" & 码数 & vbCrLf
    MSG = MSG & "【历统终期】" & 结期统终 & vbCrLf
    MSG = MSG & "【历统跨时耗时】" & CLng(Timer - TT) & vbCrLf
    '------------------------------------------------------------------------------------
    STBASE结算引擎_历统时正程 = MSG
End Function
'########################################################################################
'########################################################################################
'#################################   结算管理  历统时      ##############################
'########################################################################################
'########################################################################################











'########################################################################################
'########################################################################################
'#################################  结算管理  基腾实时结算  #############################
'########################################################################################
'########################################################################################
'========================================================================================
'========================================================================================
'功能：实时结算
'因为用实时日线数据进行结算，所以无法正确更新周类与月类的K线数据
'注意20230101：包含两部分，一部分是更新临时数据，一部分是结算。前一部分必须做，后一部分根据实结模式进行处理。
'注意20230201：增加外部控制，只有实结类型日类为S时，才进行以下结算，为了保证SCC能够得到正确结果。
'========================================================================================
'========================================================================================
Function STBASE结算引擎_实时结算数程基腾( _
          ByRef 组结算 As Variant _
        , ByVal 法道基列 As Integer _
        , Optional ByRef 组行情 As Variant _
        , Optional ByVal 是否结算 As Boolean = True _
        ) As Integer
'========================================================================================
'验证非空
'========================================================================================
    If VBA.IsEmpty(组结算) = True Then Exit Function
'========================================================================================
'获取行情
'========================================================================================
    Dim 是否退出清理  As Boolean
    If VBA.IsMissing(组行情) Then
        组行情 = 组结算
        是否退出清理 = True
    End If
'========================================================================================
'变量声明
'========================================================================================
    Dim 法道基位 As Integer
    法道基位 = 法道基列 - 1
    '====================================
    Dim 当日 As Date, 临日 As Date
    Dim 当收#, 当开#, 当高#, 当低#
    Dim 今量 As Double
    '====================================
    Dim ARROS(1 To 花宽单道) As Variant
    Dim 指定期类 As String
    Dim 结日记录 As Date
    Dim 是否停牌 As Boolean
    Dim 计数已结算  As Integer
    计期已结算 = 0
'========================================================================================
'遍历
'========================================================================================
    Dim 遍历序号 As Integer
    For 遍历序号 = LBound(组结算, 1) To UBound(组结算, 1)
        '================================================================================
        '查询当天行情信息
        '================================================================================
        CIDL = 组行情(遍历序号, 位qt代码)
        是否停牌 = IIf(组行情(遍历序号, 位qt停牌) = "S", True, False)
        
        If UBCID是代码(CIDL) And 是否停牌 = False Then
            '----------------------------------------------------------------------------
            '获取结算向量
            '----------------------------------------------------------------------------
            For i = 1 To 花宽单道
                ARROS(i) = 组结算(遍历序号, 法道基位 + i)
            Next i
            结日记录 = ARROS(位os结期)
            指定期类 = ARROS(位os期类)
            临日 = ARROS(位os临期)
            '----------------------------------------------------------------------------
            '读取数据
            '----------------------------------------------------------------------------
            当日 = 组行情(遍历序号, 位qt今期)
            当收 = 组行情(遍历序号, 位qt今收)
            当开 = 组行情(遍历序号, 位qt今开)
            当高 = 组行情(遍历序号, 位qt今高)
            当低 = 组行情(遍历序号, 位qt今低)
            '----------------------------------------------------------------------------
            '步骤：更新【临】
            '注意20220829：可以不区分期类，直接用周类逻辑进行更新，因为只要结算过临信息就被清零。
            '----------------------------------------------------------------------------
            If 当日 > 临日 Then
                    '---------------------------------------------------------------------
                    If 指定期类 = 常期类为日 Then
                            ARROS(位os临期) = 当日
                            ARROS(位os临收) = 当收
                            ARROS(位os临开) = 当开
                            ARROS(位os临高) = 当高
                            ARROS(位os临低) = 当低
                    Else
                        If 当日 - STBASE取据引擎_工具期类第几日(当日, 指定期类) = 临日 - STBASE取据引擎_工具期类第几日(临日, 指定期类) Then
                            '属于同一期，本期非首个交易日
                            ARROS(位os临期) = 当日
                            ARROS(位os临收) = 当收
                            If 当高 > ARROS(位os临高) Then ARROS(位os临高) = 当高
                            If 当低 < ARROS(位os临低) Then ARROS(位os临低) = 当低
                        Else
                            If ARROS(位os临收) > 0 Then
                                '前期信息未清零，有可能前结算时已停牌，应先结算再更新
                                计期已结算 = 计期已结算 + STBASE结算引擎_单点结算核程(ARROS)
                                'If 是否统时 = True Then Call STBASE结算引擎_单点统时核程(ARROS)
                            End If
                            '本期首个交易日 (所有临时价格已经在上期正式结算中清零)
                            ARROS(位os临期) = 当日
                            ARROS(位os临收) = 当收
                            ARROS(位os临开) = 当开
                            ARROS(位os临高) = 当高
                            ARROS(位os临低) = 当低
                        End If
                    End If
                    '---------------------------------------------------------------------
                    '计算：值临PR
                    '注20241020：因为不会进入正式结算，所以必须放在外面，与临数据共同赋值。
                    '---------------------------------------------------------------------
                    If ARROS(位os结收) <> 0 Then
                        ARROS(位os临幅PR) = Round((ARROS(位os临收) / ARROS(位os结收) - 1) * 100, 2)
                        ARROS(位os临幅HR) = Round((ARROS(位os临高) / ARROS(位os结收) - 1) * 100, 2)
                        ARROS(位os临幅LR) = Round((ARROS(位os临低) / ARROS(位os结收) - 1) * 100, 2)
                    End If
                    '---------------------------------------------------------------------
            End If
            '----------------------------------------------------------------------------
            '步骤：进行结算（与区间结算不同）
            '----------------------------------------------------------------------------
            If 当日 > ARROS(位os结期) Then
                    If 是否结算 = True Then 计数已结算 = 计数已结算 + STBASE结算引擎_单点结算核程(ARROS)
            End If
            '----------------------------------------------------------------------------
            '回写结算向量
            '----------------------------------------------------------------------------
            '补丁：如果没有及时进行【每日结算】，会导致今涨不正确（用了不正确的前收）
            If ARROS(位os期类) = 常期类为日 Then
                ARROS(位os结幅PR0) = 组行情(遍历序号, 位qt今涨幅)
            End If
            '衍生
            Call STBASE结算引擎_单点衍生核程(ARROS)
            '回写
            For i = LBound(ARROS) To UBound(ARROS)
                组结算(遍历序号, 法道基位 + i) = ARROS(i)
            Next i
            Erase ARROS
            '----------------------------------------------------------------------------
            Debug.Print "结算管理_实时结算由腾实>>" & 遍历序号 & ">>" & CIDL & "  [" & 结日记录 & ">>" & 当日 & "]=" & 计数已结算
            '----------------------------------------------------------------------------
        End If
    Next 遍历序号
'========================================================================================
'清理
'========================================================================================
    If 是否退出清理 = True Then
        Erase 组行情
    End If
'========================================================================================
'返回
'========================================================================================
    STBASE结算引擎_实时结算数程基腾 = 计数已结算
End Function
'########################################################################################
'########################################################################################
'#################################  结算管理  基腾实时结算  #############################
'########################################################################################
'########################################################################################













