Attribute VB_Name = "WMH_T历研统时_B1指标矩阵"
Option Explicit



Sub XL历研阶析前调_市板全()
    Call XL历研阶析前调模板
End Sub
Sub XL历研阶析前调_市板Qi()      '指数
    Call XL历研阶析前调模板(常市板指)
End Sub
Sub XL历研阶析前调_市板Qe()      '基金ETF
    Call XL历研阶析前调模板(常市板基)
End Sub
Sub XL历研阶析前调_市板Qif()     '沪深300
    Call XL历研阶析前调模板(常市板票Qif)
End Sub
Sub XL历研阶析前调_市板Qic()     '中证500
    Call XL历研阶析前调模板(常市板票Qic)
End Sub
Sub XL历研阶析前调_市板Qim()     '中证1000
    Call XL历研阶析前调模板(常市板票Qim)
End Sub
Sub XL历研阶析前调_市板Qit()     '中证2000
    Call XL历研阶析前调模板(常市板票Qit)
End Sub
Sub XL历研阶析前调_市板Qin()     '中证非
    Call XL历研阶析前调模板(常市板票Qin)
End Sub
Sub XL历研阶析前调_市板Qst()     'ST/退
    Call XL历研阶析前调模板(常市板票Qst)
End Sub


'待完成：期类为周，K线低点与均线的交叉情况
'研究的目的是：虽然选择交叉的均线十分有效，但是在持有过程中，K线的低点会与均线交叉，造成心理因素退出持有
'研究结果：找到安全（低点不会达到）、有效（均线相交具有重要性）。对于每只股票，找到对应的重要性均线，以及适用于持仓的均线组合
'########################################################################################
'########################################################################################
'#################################  统时全码  遍历分析  ################################
'########################################################################################
'########################################################################################
'========================================================================================
'========================================================================================
'功能：针对市板进行分析
'========================================================================================
'========================================================================================
Function XL历研阶析前调模板( _
          Optional 被研市板 As String = "" _
        , Optional 阶标左型 As String = "阶纬" _
        , Optional 是否外簿 As Boolean = True _
        , Optional 阈值市日 As Date = #1/1/2013# _
        )
'========================================================================================
'确定码集
'========================================================================================
    Dim MSG As String
    '------------------------------------------------------------------------------------
    '确定来源工表
    '------------------------------------------------------------------------------------
    Dim MSFM As Worksheet
    If STBASE外簿工具_花册链接(MSFM, 常花中股) = False Then Exit Function
    '------------------------------------------------------------------------------------
    '确定码集
    '------------------------------------------------------------------------------------
    Dim 被研码集 As New Dictionary
    Dim CIDL As String
    Dim 代称 As String
    Dim 市日 As Date
    
    Dim 行号遍历 As Integer
    For 行号遍历 = 2 To MSFM.[a65536].End(xlUp).Row
        CIDL = MSFM.Cells(行号遍历, 位列花天CIDL).Value
        代称 = MSFM.Cells(行号遍历, 位列花天代称).Value
        市日 = MSFM.Cells(行号遍历, 位列花天市日).Value
        
        If UBCID是代码(CIDL) _
        And 被研码集.Exists(CIDL) = False _
        And (Len(市日) > 0 And 市日 < 阈值市日) _
        Then
            If Len(被研市板) = 0 Then
                被研码集.Add Key:=CIDL, Item:=代称
            ElseIf MSFM.Cells(行号遍历, 位列花天市板) = 被研市板 Then
                被研码集.Add Key:=CIDL, Item:=代称
            End If
        End If
    Next
    Set MSFM = Nothing
'========================================================================================
'设置工簿
'========================================================================================
    Dim wb As Workbook
    If 是否外簿 = False Then
        Set wb = ThisWorkbook
    Else
        Set wb = Workbooks.Add
    End If
'========================================================================================
'分析：交叉表
'========================================================================================
    Call XLSOP统时全码_标析正程(常期类为周, 被研码集, wb, 阶标左型:="月局", 阶标右型:="周局", 被研主题:="周类局局交叉分布情况", 基色底:=常色主黄)
    '------------------------------------------------------------------------------------
    Call XLSOP统时全码_标析正程(常期类为日, 被研码集, wb, 阶标左型:="周局", 阶标右型:="日局", 被研主题:="日类局局交叉分布情况", 基色底:=常色十橙)
    Call XLSOP统时全码_标析正程(常期类为日, 被研码集, wb, 阶标左型:="月局", 阶标右型:="日局", 被研主题:="日类局局交叉分布情况", 基色底:=常色十橙)
    Call XLSOP统时全码_标析正程(常期类为日, 被研码集, wb, 阶标左型:="月局", 阶标右型:="周局", 被研主题:="日类局局交叉分布情况", 基色底:=常色十橙)
'========================================================================================
'分析：均线重要性分析
'========================================================================================
    Dim WSSUM As Worksheet
    Dim WSJXX As Worksheet
    Dim 被研期类  As String
    Dim 基色底  As Long
    '------------------------------------------------------------------------------------
    '均重：月线
    '------------------------------------------------------------------------------------
    被研期类 = 常期类为月
    基色底 = 常色十靛
    Call PBASE格程工具_表操工表新增(WSSUM, "Jxs" & 被研期类, wb, 基色底:=基色底)
    Call PBASE格程工具_表操工表新增(WSJXX, "Jxx" & 被研期类, wb, 基色底:=基色底)
    Call XLSOP统时全码_线重正程(被研期类, 被研码集, WSJXX, WSSUM)
    '------------------------------------------------------------------------------------
    '均重：周线
    '------------------------------------------------------------------------------------
    被研期类 = 常期类为周
    基色底 = 常色主靛
    Call PBASE格程工具_表操工表新增(WSSUM, "Jxs" & 被研期类, wb, 基色底:=基色底)
    Call PBASE格程工具_表操工表新增(WSJXX, "Jxx" & 被研期类, wb, 基色底:=基色底)
    Call XLSOP统时全码_线重正程(被研期类, 被研码集, WSJXX, WSSUM)
    '------------------------------------------------------------------------------------
    '均重：日线
    '------------------------------------------------------------------------------------
    被研期类 = 常期类为日
    基色底 = 常色主碧
    Call PBASE格程工具_表操工表新增(WSSUM, "Jxs" & 被研期类, wb, 基色底:=基色底)
    Call PBASE格程工具_表操工表新增(WSJXX, "Jxx" & 被研期类, wb, 基色底:=基色底)
    Call XLSOP统时全码_线重正程(被研期类, 被研码集, WSJXX, WSSUM)
    '------------------------------------------------------------------------------------
    Set WSJXX = Nothing
    Set WSSUM = Nothing
'========================================================================================
'保存：外部存档
'========================================================================================
    Dim 工簿简称 As String
    Dim 工簿路径 As String
    
    工簿简称 = String(3, "J") & 被研市板 & "." & Format$(Now, "YYYYMMDDhhnn")
    工簿路径 = ThisWorkbook.Path & "\" & 工簿简称 & ".xlsx"
    '------------------------------------------------------------------------------------
    '进行保存
    '------------------------------------------------------------------------------------
    If wb.Name <> ThisWorkbook.Name Then
        MSG = MSG & vbCrLf & PBASE格程工具_表操保存外簿(wb, 工簿简称)
        MSG = MSG & vbCrLf
        'WB.Close
    End If
    '------------------------------------------------------------------------------------
    Set wb = Nothing
'========================================================================================
End Function
'########################################################################################
'########################################################################################
'#################################  统时全码  遍历分析  ################################
'########################################################################################
'########################################################################################













'阶阶矩阵标标[AMMJC]：阶标按照代码进行分布
'阶阶矩阵标涨[AMMJJ]：阶阶阶化关系统计
'########################################################################################
'########################################################################################
'#################################  统时全码  阶阶矩阵  ##################################
'########################################################################################
'########################################################################################
'========================================================================================
'========================================================================================
'功能：标析
'========================================================================================
'========================================================================================
Function XLSOP统时全码_标析正程( _
          期类 As String _
        , 典被研代码 As Dictionary _
        , wb As Workbook _
        , 阶标左型 As String _
        , 阶标右型 As String _
        , Optional 被研主题 As String = "乾局" _
        , Optional ByVal 基色底 As Long = 常色主碧 _
        ) As Integer
'========================================================================================
'设置典集
'========================================================================================
    Dim 典阶标 As New Dictionary
    Dim 典数阶标 As Integer
    典数阶标 = XLSOP统时全码基程_设置典阶标(典阶标, 期类, 阶标左型:=阶标左型, 阶标右型:=阶标右型)
    '------------------------------------------------------------------------------------
    Dim 典阶涨 As New Dictionary
    Dim 典数阶涨 As Integer
    典数阶涨 = XLSOP统时全码基程_设置典阶涨(典阶涨, 期类)
'========================================================================================
'阶阶数组：初始赋值
'========================================================================================
    Dim X As Integer
    Dim Y As Integer
    Dim Z As Integer
    Dim i As Integer
    '------------------------------------------------------------------------------------
    '阶阶矩阵：初始坐标赋值
    '------------------------------------------------------------------------------------
    Dim AMMJJ As Variant
    ReDim AMMJJ(0 To 典数阶标 + 1, 0 To 典数阶标 + 1, 1 To 3) As Variant
    For Z = 1 To 3
        AMMJJ(0, 0, Z) = 期类
        For i = 1 To 典数阶标
            AMMJJ(i, 0, Z) = 典阶标.Keys(i - 1)
            AMMJJ(0, i, Z) = 典阶标.Keys(i - 1)
        Next
    Next
    '------------------------------------------------------------------------------------
    '阶涨矩阵：初始坐标赋值
    '------------------------------------------------------------------------------------
    Dim AMMJF As Variant
    ReDim AMMJF(0 To 典数阶标 + 1, 0 To 典数阶涨 + 1, 1 To 3) As Variant
    For Z = 1 To 3
        AMMJF(0, 0, Z) = 期类
        For X = 1 To 典数阶标
            AMMJF(X, 0, Z) = 典阶标.Keys(X - 1)
        Next
        For Y = 1 To 典数阶涨
            AMMJF(0, Y, Z) = 典阶涨.Items(Y - 1)
        Next
    Next
'========================================================================================
'生成数据
'========================================================================================
    Dim ANNJSL As Variant
    ReDim ANNJSL(1 To 典被研代码.Count, 1 To 位阶码矩列展始 - 1 + 典数阶标) As Variant
    Dim ANNJSR As Variant
    ReDim ANNJSR(1 To 典被研代码.Count, 1 To 位阶码矩列展始 - 1 + 典数阶标) As Variant
    '------------------------------------------------------------------------------------
    '生成数据
    '------------------------------------------------------------------------------------
    Dim 被研代码 As String
    Dim 被研代称 As String
    Dim 计数导入 As Integer
    For 计数导入 = 1 To 典被研代码.Count
        '--------------------------------------------------------------------------------
        被研代码 = 典被研代码.Keys(计数导入 - 1)
        被研代称 = 典被研代码.Items(计数导入 - 1)
        '--------------------------------------------------------------------------------
        '数据生成
        '--------------------------------------------------------------------------------
        ReDim ARRJSL(1 To 位阶码矩列展始 - 1 + 典数阶标) As Variant
        ReDim ARRJSR(1 To 位阶码矩列展始 - 1 + 典数阶标) As Variant
        Call XLSOP统时全码_标析引擎(ARRJSL, ARRJSR, AMMJJ, AMMJF, 典阶标, 典阶涨, 被研代码, 期类, 阶标左型:=阶标左型, 阶标右型:=阶标右型)
        '--------------------------------------------------------------------------------
        '数据输出：左
        '--------------------------------------------------------------------------------
        For i = 1 To 位阶码矩列展始 - 1 + 典数阶标
            ANNJSL(计数导入, i) = ARRJSL(i)
            ANNJSR(计数导入, i) = ARRJSL(i)
        Next
        ANNJSL(计数导入, 位阶码矩列代称) = 被研代称
        ANNJSL(计数导入, 位阶码矩列市板) = 阶标左型
        ANNJSR(计数导入, 位阶码矩列代称) = 被研代称
        ANNJSR(计数导入, 位阶码矩列市板) = 阶标右型
        '-----------------------------------------------------------------------------
        DoEvents
        Debug.Print "标析>>" & 期类 & ">>" & 计数导入, 被研代码, 被研代称
        '--------------------------------------------------------------------------------
    Next
'========================================================================================
'格式化：阶标分布
'========================================================================================
    '作用：分析该期类左坐标的分布情况
    Dim WSJSL As Worksheet
    Call PBASE格程工具_表操工表新增(WSJSL, "JS." & 期类 & 阶标左型, wb, 基色底:=常色主黑)
    Call UTL数据转换_集ARR2WS(ANNJSL, WSJSL)
    Call XLSOP统时全码_标析格程阶标分布(WSJSL, 典阶标)
    Set WSJSL = Nothing
    '------------------------------------------------------------------------------------
    '作用：分析该期类右坐标的分布情况
    Dim WSJSR As Worksheet
    Call PBASE格程工具_表操工表新增(WSJSR, "JS." & 期类 & 阶标右型, wb, 基色底:=常色主黑)
    Call UTL数据转换_集ARR2WS(ANNJSR, WSJSR)
    Call XLSOP统时全码_标析格程阶标分布(WSJSR, 典阶标)
    Set WSJSR = Nothing
'========================================================================================
'格式化：阶阶矩阵
'========================================================================================
    Dim WSJJ As Worksheet
    Call PBASE格程工具_表操工表新增(WSJJ, "JJ." & 期类 & 阶标左型 & 阶标右型, wb, 基色底)
    With WSJJ
        .Cells.Interior.ColorIndex = 1
        .Cells.Font.Size = 10
        .Columns(1).Font.Color = 基色底
        With .Cells(1, 1)
            .Value = 期类 & "期类：" & 阶标左型 & " * " & 阶标右型
            .Font.Size = 15
            .Font.Bold = True
        End With
    End With
    '------------------------------------------------------------------------------------
    '格式化：阶阶矩阵标标
    '------------------------------------------------------------------------------------
    Call XLSOP统时全码_标析格程标标矩阵(WSJJ, AMMJJ, 典阶标, 基行:=3)
    '------------------------------------------------------------------------------------
    '格式化：阶阶矩阵标涨
    '------------------------------------------------------------------------------------
    Call XLSOP统时全码_标析格程标涨矩阵(WSJJ, AMMJF, 典阶标, 典阶涨)
    '------------------------------------------------------------------------------------
    '格式化
    '------------------------------------------------------------------------------------
    ActiveWindow.Zoom = 80
    If InStr(阶标左型, "局") > 0 Then
        WSJJ.Columns.ColumnWidth = 4
        WSJJ.Columns(1).ColumnWidth = 6
        WSJJ.Columns(典数阶标 + 2).ColumnWidth = 10
    Else
        WSJJ.Columns.ColumnWidth = 4
        WSJJ.Columns.AutoFit
    End If
'========================================================================================
'返回
'========================================================================================
    Set 典阶标 = Nothing
    Set 典阶涨 = Nothing
    XLSOP统时全码_标析正程 = 计数导入
'========================================================================================
End Function







'========================================================================================
'========================================================================================
'格式化：阶标分布
'========================================================================================
'========================================================================================
Function XLSOP统时全码_标析格程阶标分布( _
          WSJC As Worksheet _
        , 典阶标 As Dictionary _
        , Optional ByVal 基色底 As Long = 常色主碧 _
        ) As Integer
'========================================================================================
'格式化
'========================================================================================
    Dim 典数阶标 As Integer
    典数阶标 = 典阶标.Count
    '------------------------------------------------------------------------------------
    '格式化：列
    '------------------------------------------------------------------------------------
    WSJC.Cells.Interior.ColorIndex = 1
    WSJC.Cells.Font.Size = 10
    WSJC.Columns(位阶码矩列代码).Font.ColorIndex = 1
    WSJC.Columns(位阶码矩列代称).Font.ColorIndex = 15
    WSJC.Columns(位阶码矩列市板).Font.ColorIndex = 1
    WSJC.Columns(位阶码矩列期类).Font.ColorIndex = 1
    WSJC.Columns(位阶码矩列累龄).Font.ColorIndex = 1
    WSJC.Columns(位阶码矩列代码).ColumnWidth = 0.2
    WSJC.Columns(位阶码矩列代称).ColumnWidth = 9
    WSJC.Columns(位阶码矩列市板).ColumnWidth = 6
    WSJC.Columns(位阶码矩列期类).ColumnWidth = 4
    WSJC.Columns(位阶码矩列累龄).ColumnWidth = 4
    WSJC.Columns(位阶码矩列始日).Hidden = True
    WSJC.Columns(位阶码矩列终日).Hidden = True
    '------------------------------------------------------------------------------------
    '格式化：标题
    '------------------------------------------------------------------------------------
    For i = 1 To 典数阶标
        WSJC.Cells(位阶码矩行标题, i + 位阶码矩列展始 - 1) = 典阶标.Keys(i - 1)
    Next
    WSJC.Cells(位阶码矩行标题, 位阶码矩行开始) = "代码"
    WSJC.Cells(位阶码矩行标题, 位阶码矩列代码) = "代称"
    WSJC.Cells(位阶码矩行标题, 位阶码矩列市板) = "阶标"
    WSJC.Cells(位阶码矩行标题, 位阶码矩列期类) = "期类"
    WSJC.Cells(位阶码矩行标题, 位阶码矩列累龄) = "累龄"
    WSJC.Cells(位阶码矩行标题, 位阶码矩列始日) = "始日"
    WSJC.Cells(位阶码矩行标题, 位阶码矩列终日) = "终日"
    WSJC.Cells(位阶码矩行标题, 位阶码矩列累龄) = "累龄"
    WSJC.Rows(1).Font.ColorIndex = 2
'========================================================================================
'输出矩阵：阶码矩阵
'========================================================================================
    Dim 累龄 As Integer
    Dim 色度 As Double
    Dim i As Integer
    Dim X As Integer
    Dim Y As Integer
    '------------------------------------------------------------------------------------
    X = 1
    For Y = 1 To 典数阶标
        With WSJC.Cells(X, 位阶码矩列展始).Offset(0, 典数阶标).Cells(1, Y)
            .Value = .Offset(0, -1 * 典数阶标)
        End With
    Next
    For X = PBASE格程工具_表参末行指定(WSJC, 1) To 位阶码矩行开始 Step -1
        累龄 = WSJC.Cells(X, 位阶码矩列累龄)
        If 累龄 = 0 Then
            WSJC.Rows(X).Delete
        Else
            For Y = 1 To 典数阶标
                With WSJC.Cells(X, 位阶码矩列展始).Cells(1, Y).Offset(0, 典数阶标)
                    .Value = Round(100 * .Offset(0, -1 * 典数阶标) / 累龄, 1)
                    If .Value > 30 Then
                        .Interior.Color = 常色六青
                        色度 = .Value / 100
                        .Interior.TintAndShade = 色度
                    ElseIf .Value > 10 Then
                        .Interior.Color = 常色主靛
                        色度 = .Value / 100
                        .Interior.TintAndShade = 色度
                    ElseIf .Value > 5 Then
                        .Interior.Color = 常色八43
                        色度 = .Value / 100
                        .Interior.TintAndShade = 色度
                    ElseIf .Value > 1 Then
                        .Interior.ColorIndex = 50
                        色度 = .Value / 100
                        .Interior.TintAndShade = 色度
                    ElseIf .Value > 0 Then
                        .Interior.ColorIndex = 51
                    Else
                        .Interior.ColorIndex = 1
                    End If
                    .Font.Color = .Interior.Color
                End With
            Next
        End If
    Next
    WSJC.Cells(1, 位阶码矩列展始).Resize(1, 典数阶标).Columns.ColumnWidth = 6
    WSJC.Cells(1, 位阶码矩列展始).Resize(1, 典数阶标).Columns.Hidden = True
    WSJC.Cells(1, 位阶码矩列展始).Offset(0, 典数阶标).Resize(1, 典数阶标).Columns.ColumnWidth = 2
'========================================================================================
'格式化：排序
'========================================================================================
    With WSJC
        .Sort.SortFields.Clear
        .Sort.SortFields.Add Key:=.Columns(位阶码矩列代码) _
            , SortOn:=xlSortOnValues, Order:=xlAscending _
            , DataOption:=xlSortNormal
        .Sort.SortFields.Add Key:=.Columns(位阶码矩列期类) _
            , SortOn:=xlSortOnValues, Order:=xlAscending, CustomOrder:="M,W,D" _
            , DataOption:=xlSortNormal
    End With
    With WSJC.Sort
        .SetRange WSJC.UsedRange
        .Header = xlYes
        .MatchCase = False
        .Orientation = xlTopToBottom
        .SortMethod = xlPinYin
        .Apply
    End With
'========================================================================================
'格式化：整体
'========================================================================================
    Call PBASE格程工具_表冻结锁定(WSJC, 缩放:=100)
'========================================================================================
End Function




'========================================================================================
'========================================================================================
'格式化：不同指标转换之间的矩阵
'========================================================================================
'========================================================================================
Function XLSOP统时全码_标析格程标标矩阵( _
          WSJJ As Worksheet _
        , AMMJJ As Variant _
        , 典阶标 As Dictionary _
        , Optional 基行 As Integer = 1 _
        , Optional 基列 As Integer = 1 _
        , Optional ByVal 基色底 As Long = 常色主黄 _
        ) As Integer
'========================================================================================
'参数
'========================================================================================
    Dim 典数阶标 As Integer
    典数阶标 = 典阶标.Count
    '------------------------------------------------------------------------------------
    Dim 维行  As Integer
    Dim 维列 As Integer
    维行 = 典数阶标
    维列 = 典数阶标
    '------------------------------------------------------------------------------------
    Dim 总值本行 As Long
    Dim 总值本列 As Long
    Dim 总值本矩 As Long
'########################################################################################
'########################################################################################
'主题：总数
'########################################################################################
'########################################################################################
    With WSJJ.Rows(基行).Borders(xlEdgeTop)
        .LineStyle = xlContinuous
        .Color = 基色底
        .Weight = xlThin
    End With
'========================================================================================
'输出矩阵: 全占比
'========================================================================================
        WSJJ.Cells(基行, 基列) = "全占比：按矩阵汇总"
        基行 = 基行 + 1
        '--------------------------------------------------------------------------------
        For X = 1 To 维行 + 2
            WSJJ.Cells(基行, 基列).Cells(X, 1) = AMMJJ(X - 1, 0, 位阶阶矩三维数和)
        Next
        For Y = 1 To 维列 + 2
            WSJJ.Cells(基行, 基列).Cells(1, Y) = AMMJJ(0, Y - 1, 位阶阶矩三维数和)
        Next
        '--------------------------------------------------------------------------------
        总值本矩 = AMMJJ(维行 + 1, 维列 + 1, 位阶阶矩三维数和)
        For X = 1 To 维行 + 1
            For Y = 1 To 维列 + 1
                If 总值本矩 > 0 Then
                    WSJJ.Cells(基行, 基列).Cells(X + 1, Y + 1) = Round(AMMJJ(X, Y, 位阶阶矩三维数和) / 总值本矩, 3) * 100
                End If
            Next
        Next
        For X = 1 To 维行
            For Y = 1 To 维列
                With WSJJ.Cells(基行, 基列).Cells(X + 1, Y + 1)
                    .Interior.Color = 常色四蓝
                    If .Value > 10 Then
                        .Interior.TintAndShade = 0.8
                    ElseIf .Value > 5 Then
                        .Interior.TintAndShade = 0.5
                    ElseIf .Value > 1 Then
                        .Interior.TintAndShade = 0.1
                    Else
                        .Interior.TintAndShade = -0.5
                    End If
                End With
            Next
        Next
        '--------------------------------------------------------------------------------
        '格式化
        '--------------------------------------------------------------------------------
        WSJJ.Cells(基行, 基列).Resize(维行 + 2, 维列 + 2).NumberFormatLocal = 全设格式of零位
        WSJJ.Cells(基行, 基列).Resize(维行 + 2, 维列 + 2).Font.ColorIndex = 2
        WSJJ.Cells(基行, 基列).Offset(1, 1).Resize(维行, 维列).Font.ColorIndex = 1
        WSJJ.Cells(基行, 基列).Offset(1, 1).Resize(维行, 维列).Borders.ColorIndex = 1
        基行 = 基行 + 维行 + 3
'========================================================================================
'输出矩阵: 行占比
'========================================================================================
        WSJJ.Cells(基行, 基列) = "行占比：按行汇总"
        基行 = 基行 + 1
        '--------------------------------------------------------------------------------
        For X = 1 To 维行 + 2
            WSJJ.Cells(基行, 基列).Cells(X, 1) = AMMJJ(X - 1, 0, 位阶阶矩三维数和)
        Next
        For Y = 1 To 维列 + 2
            WSJJ.Cells(基行, 基列).Cells(1, Y) = AMMJJ(0, Y - 1, 位阶阶矩三维数和)
        Next
        '--------------------------------------------------------------------------------
        For X = 1 To 维行 + 1
            总值本行 = AMMJJ(X, 维列 + 1, 位阶阶矩三维数和)
            For Y = 1 To 维列 + 1
                If 总值本行 > 0 Then
                    WSJJ.Cells(基行, 基列).Cells(X + 1, Y + 1) = Round(AMMJJ(X, Y, 位阶阶矩三维数和) / 总值本行, 3) * 100
                End If
            Next
        Next
        For X = 1 To 维行
            For Y = 1 To 维列
                With WSJJ.Cells(基行, 基列).Cells(X + 1, Y + 1)
                    .Interior.Color = 常色八蓝
                    If .Value > 10 Then
                        .Interior.TintAndShade = 0.8
                    ElseIf .Value > 5 Then
                        .Interior.TintAndShade = 0.5
                    ElseIf .Value > 1 Then
                        .Interior.TintAndShade = 0.1
                    Else
                        .Interior.TintAndShade = -0.5
                    End If
                End With
            Next
        Next
        '--------------------------------------------------------------------------------
        '格式化
        '--------------------------------------------------------------------------------
        WSJJ.Cells(基行, 基列).Resize(维行 + 2, 维列 + 2).NumberFormatLocal = 全设格式of零位
        WSJJ.Cells(基行, 基列).Resize(维行 + 2, 维列 + 2).Font.ColorIndex = 2
        WSJJ.Cells(基行, 基列).Offset(1, 1).Resize(维行, 维列).Font.ColorIndex = 1
        WSJJ.Cells(基行, 基列).Offset(1, 1).Resize(维行, 维列).Borders.ColorIndex = 1
        基行 = 基行 + 维行 + 3
'========================================================================================
'输出矩阵: 列占比
'========================================================================================
        WSJJ.Cells(基行, 基列) = "列占比：按列汇总"
        基行 = 基行 + 1
        '--------------------------------------------------------------------------------
        For X = 1 To 维行 + 2
            WSJJ.Cells(基行, 基列).Cells(X, 1) = AMMJJ(X - 1, 0, 位阶阶矩三维数和)
        Next
        For Y = 1 To 维列 + 2
            WSJJ.Cells(基行, 基列).Cells(1, Y) = AMMJJ(0, Y - 1, 位阶阶矩三维数和)
        Next
        '--------------------------------------------------------------------------------
        For Y = 1 To 维列 + 1
            总值本列 = AMMJJ(维行 + 1, Y, 位阶阶矩三维数和)
            For X = 1 To 维行 + 1
                If 总值本列 > 0 Then
                    WSJJ.Cells(基行, 基列).Cells(X + 1, Y + 1) = Round(AMMJJ(X, Y, 位阶阶矩三维数和) / 总值本列, 3) * 100
                End If
            Next
        Next
        For X = 1 To 维行
            For Y = 1 To 维列
                With WSJJ.Cells(基行, 基列).Cells(X + 1, Y + 1)
                    .Interior.Color = 常色八蓝
                    If .Value > 10 Then
                        .Interior.TintAndShade = 0.8
                    ElseIf .Value > 5 Then
                        .Interior.TintAndShade = 0.5
                    ElseIf .Value > 1 Then
                        .Interior.TintAndShade = 0.1
                    Else
                        .Interior.TintAndShade = -0.5
                    End If
                End With
            Next
        Next
        '--------------------------------------------------------------------------------
        '格式化
        '--------------------------------------------------------------------------------
        WSJJ.Cells(基行, 基列).Resize(维行 + 2, 维列 + 2).NumberFormatLocal = 全设格式of零位
        WSJJ.Cells(基行, 基列).Resize(维行 + 2, 维列 + 2).Font.ColorIndex = 2
        WSJJ.Cells(基行, 基列).Offset(1, 1).Resize(维行, 维列).Font.ColorIndex = 1
        WSJJ.Cells(基行, 基列).Offset(1, 1).Resize(维行, 维列).Borders.ColorIndex = 1
        基行 = 基行 + 维行 + 3
''========================================================================================
''输出矩阵：数和矩阵（无参考意义）
''========================================================================================
'        WSJJ.Cells(基行, 基列) = "标标交叉分布（绝对数）"
'        基行 = 基行 + 1
'        '------------------------------------------------------------------------------------
'        '输出
'        '------------------------------------------------------------------------------------
'        For X = 1 To 维行 + 2
'        For Y = 1 To 维列 + 2
'            WSJJ.Cells(基行, 基列).Cells(X, Y) = AMMJJ(X - 1, Y - 1, 位阶阶矩三维数和)
'        Next
'        Next
'        '------------------------------------------------------------------------------------
'        '矩阵：汇总绝对值
'        '------------------------------------------------------------------------------------
'        总值本矩 = WSJJ.Cells(基行, 基列).Cells(维行 + 2, 维列 + 2)
'        For X = 1 To 维行
'            For Y = 1 To 维列
'                With WSJJ.Cells(基行, 基列).Offset(1, 1).Cells(X, Y)
'                    .Interior.Color = 常色二灰
'                    If .Value > 0.1 * 总值本矩 Then
'                        .Interior.TintAndShade = 0.8
'                    ElseIf .Value > 0.05 * 总值本矩 Then
'                        .Interior.TintAndShade = 0.5
'                    ElseIf .Value > 0.01 * 总值本矩 Then
'                        .Interior.TintAndShade = 0.1
'                    Else
'                        .Interior.TintAndShade = -0.5
'                    End If
'                End With
'            Next
'        Next
'        '------------------------------------------------------------------------------------
'        '格式化
'        '------------------------------------------------------------------------------------
'        WSJJ.Cells(基行, 基列).Resize(维行 + 2, 维列 + 2).NumberFormatLocal = 全设格式of零位
'        WSJJ.Cells(基行, 基列).Resize(维行 + 2, 维列 + 2).Font.ColorIndex = 2
'        WSJJ.Cells(基行, 基列).Offset(1, 1).Resize(维行, 维列).Font.ColorIndex = 1
'        WSJJ.Cells(基行, 基列).Offset(1, 1).Resize(维行, 维列).Borders.ColorIndex = 1
'        基行 = 基行 + 维行 + 3
'########################################################################################
'########################################################################################
'主题：涨数
'########################################################################################
'########################################################################################
    With WSJJ.Rows(基行).Borders(xlEdgeTop)
        .LineStyle = xlContinuous
        .Color = 基色底
        .Weight = xlThin
    End With
''========================================================================================
''输出矩阵: 涨数矩阵
''========================================================================================
'        WSJJ.Cells(基行, 基列) = "涨数矩阵（绝对数）"
'        基行 = 基行 + 1
'        '--------------------------------------------------------------------------------
'        '原样输出
'        '--------------------------------------------------------------------------------
'        For X = 1 To 维行 + 2
'        For Y = 1 To 维列 + 2
'            WSJJ.Cells(基行, 基列).Cells(X, Y) = AMMJJ(X - 1, Y - 1, 位阶阶矩三维涨数)
'        Next
'        Next
'        '--------------------------------------------------------------------------------
'        'UTL展示幅度
'        '--------------------------------------------------------------------------------
'        总值本矩 = WSJJ.Cells(基行, 基列).Cells(维行 + 2, 维列 + 2)
'        For X = 1 To 维行
'            For Y = 1 To 维列
'                With WSJJ.Cells(基行, 基列).Cells(X + 1, Y + 1)
'                    If .Value > 0.01 * 总值本矩 Then
'                        .Value = CLng(.Value)
'                        .Interior.ColorIndex = 36
'                    Else
'                        .Interior.Color = 常色四青
'                    End If
'                End With
'            Next
'        Next
'        WSJJ.Cells(基行, 基列).Resize(维行 + 2, 维列 + 2).Font.ColorIndex = 2
'        WSJJ.Cells(基行, 基列).Offset(1, 1).Resize(维行, 维列).Font.ColorIndex = 1
'        基行 = 基行 + 维行 + 3
'========================================================================================
'输出矩阵: 涨比例矩阵
'========================================================================================
        WSJJ.Cells(基行, 基列) = "涨比例矩阵（百分比）"
        基行 = 基行 + 1
        '--------------------------------------------------------------------------------
        For X = 1 To 维行 + 2
            WSJJ.Cells(基行, 基列).Cells(X, 1) = AMMJJ(X - 1, 0, 位阶阶矩三维数和)
        Next
        For Y = 1 To 维列 + 2
            WSJJ.Cells(基行, 基列).Cells(1, Y) = AMMJJ(0, Y - 1, 位阶阶矩三维数和)
        Next
        '--------------------------------------------------------------------------------
        For X = 1 To 维行 + 1
        For Y = 1 To 维列 + 1
            With WSJJ.Cells(基行, 基列).Cells(X + 1, Y + 1)
                If AMMJJ(X, Y, 位阶阶矩三维数和) > 0 Then
                    .Value = Round(100 * AMMJJ(X, Y, 位阶阶矩三维涨数) / AMMJJ(X, Y, 位阶阶矩三维数和), 0)
                    If .Value > 75 Then
                        .Interior.Color = 常色八黄
                    ElseIf .Value > 50 Then
                        .Interior.Color = 常色五黄
                    ElseIf .Value > 25 Then
                        .Interior.Color = 常色三黄
                    ElseIf .Value > 0 Then
                        .Interior.Color = 常色一黄
                    Else
                        .Interior.Color = 常色四青
                    End If
                Else
                        .Interior.Color = 常色四灰
                End If
            End With
        Next
        Next
        '--------------------------------------------------------------------------------
        '格式化
        '--------------------------------------------------------------------------------
        WSJJ.Cells(基行, 基列).Resize(维行 + 2, 维列 + 2).NumberFormatLocal = 全设格式of零位
        WSJJ.Cells(基行, 基列).Resize(维行 + 2, 维列 + 2).Font.ColorIndex = 1
        WSJJ.Cells(基行, 基列).Resize(维行 + 2, 1).Font.ColorIndex = 2
        WSJJ.Cells(基行, 基列).Resize(1, 维列 + 2).Font.ColorIndex = 2
        WSJJ.Cells(基行, 基列).Offset(1, 1).Resize(维行, 维列).Borders.ColorIndex = 1
        基行 = 基行 + 维行 + 5
'########################################################################################
'########################################################################################
'主题：涨幅
'########################################################################################
'########################################################################################
    With WSJJ.Rows(基行).Borders(xlEdgeTop)
        .LineStyle = xlContinuous
        .Color = 基色底
        .Weight = xlThin
    End With
'========================================================================================
'输出矩阵: 涨幅矩阵
'========================================================================================
'        WSJJ.Cells(基行, 基列) = "涨幅矩阵（绝对数）"
'        基行 = 基行 + 1
'        '--------------------------------------------------------------------------------
'        '原样输出
'        '--------------------------------------------------------------------------------
'        For X = 1 To 维行 + 2
'        For Y = 1 To 维列 + 2
'            WSJJ.Cells(基行, 基列).Cells(X, Y) = AMMJJ(X - 1, Y - 1, 位阶阶矩三维涨和)
'        Next
'        Next
'        '--------------------------------------------------------------------------------
'        'UTL展示幅度
'        '--------------------------------------------------------------------------------
'        总值本矩 = WSJJ.Cells(基行, 基列).Cells(维行 + 2, 维列 + 2)
'        For X = 1 To 维行
'            For Y = 1 To 维列
'                With WSJJ.Cells(基行, 基列).Cells(X + 1, Y + 1)
'                    If .Value > 0 Then
'                        .Value = CLng(.Value)
'                        .Interior.ColorIndex = 36
'                    ElseIf .Value < 0 Then
'                        .Value = CLng(.Value)
'                        .Interior.ColorIndex = 35
'                    Else
'                        .Interior.ColorIndex = 15
'                    End If
'                End With
'            Next
'        Next
'        WSJJ.Cells(基行, 基列).Resize(维行 + 2, 维列 + 2).Font.ColorIndex = 2
'        WSJJ.Cells(基行, 基列).Offset(1, 1).Resize(维行, 维列).Font.ColorIndex = 1
'        基行 = 基行 + 维行 + 3
'========================================================================================
'输出矩阵: 涨幅矩阵平均
'========================================================================================
        WSJJ.Cells(基行, 基列) = "涨幅平均矩阵"
        基行 = 基行 + 1
        '--------------------------------------------------------------------------------
        For X = 1 To 维行 + 2
            WSJJ.Cells(基行, 基列).Cells(X, 1) = AMMJJ(X - 1, 0, 位阶阶矩三维数和)
        Next
        For Y = 1 To 维列 + 2
            WSJJ.Cells(基行, 基列).Cells(1, Y) = AMMJJ(0, Y - 1, 位阶阶矩三维数和)
        Next
        '--------------------------------------------------------------------------------
        For X = 1 To 维行 + 1
        For Y = 1 To 维列 + 1
            With WSJJ.Cells(基行, 基列).Cells(X + 1, Y + 1)
                If AMMJJ(X, Y, 位阶阶矩三维数和) > 0 Then
                    .Value = Round(AMMJJ(X, Y, 位阶阶矩三维涨和) / AMMJJ(X, Y, 位阶阶矩三维数和), 1)
                    If .Value >= 0 Then
                        If .Value > 2 Then
                            .Interior.Color = 常色八黄
                        ElseIf .Value > 1 Then
                            .Interior.Color = 常色五黄
                        ElseIf .Value > 0.5 Then
                            .Interior.Color = 常色三黄
                        Else
                            .Interior.Color = 常色一黄
                        End If
                    Else
                            .Interior.Color = 常色四青
                    End If
                Else
                            .Interior.Color = 常色二灰
                End If
            End With
        Next
        Next
        '--------------------------------------------------------------------------------
        '格式化
        '--------------------------------------------------------------------------------
        WSJJ.Cells(基行, 基列).Resize(维行 + 2, 维列 + 2).NumberFormatLocal = 全设格式of一位
        WSJJ.Cells(基行, 基列).Resize(维行 + 2, 维列 + 2).Font.ColorIndex = 1
        WSJJ.Cells(基行, 基列).Resize(维行 + 2, 1).Font.ColorIndex = 2
        WSJJ.Cells(基行, 基列).Resize(1, 维列 + 2).Font.ColorIndex = 2
        WSJJ.Cells(基行, 基列).Offset(1, 1).Resize(维行, 维列).Borders.ColorIndex = 1
        基行 = 基行 + 维行 + 5
'========================================================================================
'格式化
'========================================================================================
    WSJJ.Activate
    ActiveWindow.Zoom = 50
    WSJJ.Columns.ColumnWidth = 3
    'WSJJ.Columns.AutoFit
    WSJJ.Columns(1).ColumnWidth = 10
    WSJJ.Columns(维列 + 2).ColumnWidth = 7
'========================================================================================
End Function





'========================================================================================
'========================================================================================
'格式化：指标与涨幅之间的转换矩阵
'========================================================================================
'========================================================================================
Function XLSOP统时全码_标析格程标涨矩阵( _
          WSJJ As Worksheet _
        , AMMJF As Variant _
        , 典阶标 As Dictionary _
        , 典阶涨 As Dictionary _
        , Optional 基行 As Integer = 1 _
        , Optional 基列 As Integer = 1 _
        , Optional ByVal 基色底 As Long = 常色主黄 _
        ) As Integer
'========================================================================================
    基行 = PBASE格程工具_表参末行指定(WSJJ, 1) + 5
    基列 = 1
'========================================================================================
'格式化
'========================================================================================
    Dim 维行  As Integer
    Dim 维列 As Integer
    维行 = 典阶标.Count
    维列 = 典阶涨.Count
    '------------------------------------------------------------------------------------
    Dim 总值本行 As Long
    Dim 总值本列 As Long
    Dim 总值本矩 As Long
    '------------------------------------------------------------------------------------
'########################################################################################
'########################################################################################
'主题：总数
'########################################################################################
'########################################################################################
    With WSJJ.Rows(基行).Borders(xlEdgeTop)
        .LineStyle = xlContinuous
        .Color = 基色底
        .Weight = xlThin
    End With
''========================================================================================
''输出矩阵：数和矩阵
''========================================================================================
'        WSJJ.Cells(基行, 基列) = "阶涨交叉分布（绝对数）"
'        基行 = 基行 + 1
'        '------------------------------------------------------------------------------------
'        '输出
'        '------------------------------------------------------------------------------------
'        For X = 1 To 维行 + 2
'        For Y = 1 To 维列 + 2
'            WSJJ.Cells(基行, 基列).Cells(X, Y) = AMMJF(X - 1, Y - 1, 位阶涨矩三维数和)
'        Next
'        Next
'        '------------------------------------------------------------------------------------
'        '矩阵：汇总绝对值
'        '------------------------------------------------------------------------------------
'        'UTL展示幅度
'        总值本矩 = WSJJ.Cells(基行, 基列).Cells(维行 + 2, 维列 + 2)
'        For X = 1 To 维行
'            For Y = 1 To 维列
'                With WSJJ.Cells(基行, 基列).Offset(1, 1).Cells(X, Y)
'                    If .Value > 0.005 * 总值本矩 Then
'                        .Interior.ColorIndex = 37
'                    ElseIf .Value > 0 Then
'                        .Interior.ColorIndex = 41
'                        .Font.Color = .Interior.Color
'                        .Interior.TintAndShade = -0.1
'                    Else
'                        .Interior.ColorIndex = 41
'                    End If
'                End With
'            Next
'        Next
'        '------------------------------------------------------------------------------------
'        '格式化
'        '------------------------------------------------------------------------------------
'        WSJJ.Cells(基行, 基列).Resize(维行 + 1, 维列 + 1).Borders.ColorIndex = 1
'        WSJJ.Cells(基行, 基列).Resize(维行 + 2, 维列 + 2).Font.ColorIndex = 2
'        WSJJ.Cells(基行, 基列).Offset(1, 1).Resize(维行, 维列).Font.ColorIndex = 1
'        基行 = 基行 + 维行 + 3
'========================================================================================
'输出矩阵: 行占比
'========================================================================================
        WSJJ.Cells(基行, 基列) = "行占比：按行汇总"
        基行 = 基行 + 1
        '--------------------------------------------------------------------------------
        For X = 1 To 维行 + 2
            WSJJ.Cells(基行, 基列).Cells(X, 1) = AMMJF(X - 1, 0, 位阶阶矩三维数和)
        Next
        For Y = 1 To 维列 + 2
            WSJJ.Cells(基行, 基列).Cells(1, Y) = AMMJF(0, Y - 1, 位阶阶矩三维数和)
        Next
        '------------------------------------------------------------------------------------
        For X = 1 To 维行 + 1
            总值本行 = AMMJF(X, 维列 + 1, 位阶阶矩三维数和)
            For Y = 1 To 维列 + 1
                If 总值本行 > 0 Then
                    WSJJ.Cells(基行, 基列).Cells(X + 1, Y + 1) = Round(AMMJF(X, Y, 位阶阶矩三维数和) / 总值本行, 3) * 100
                End If
            Next
        Next
        For X = 1 To 维行
            For Y = 1 To 维列
                With WSJJ.Cells(基行, 基列).Cells(X + 1, Y + 1)
                    .Interior.Color = 常色八蓝
                    If .Value > 10 Then
                        .Interior.TintAndShade = 0.8
                    ElseIf .Value > 5 Then
                        .Interior.TintAndShade = 0.5
                    ElseIf .Value > 1 Then
                        .Interior.TintAndShade = 0.1
                    Else
                        .Interior.TintAndShade = -0.5
                    End If
                End With
            Next
        Next
        '--------------------------------------------------------------------------------
        '格式化
        '--------------------------------------------------------------------------------
        WSJJ.Cells(基行, 基列).Resize(维行 + 2, 维列 + 2).NumberFormatLocal = 全设格式of零位
        WSJJ.Cells(基行, 基列).Resize(维行 + 2, 维列 + 2).Font.ColorIndex = 2
        WSJJ.Cells(基行, 基列).Offset(1, 1).Resize(维行, 维列).Font.ColorIndex = 1
        WSJJ.Cells(基行, 基列).Offset(1, 1).Resize(维行, 维列).Borders.ColorIndex = 1
        基行 = 基行 + 维行 + 3
'========================================================================================
'输出矩阵: 列占比
'========================================================================================
        WSJJ.Cells(基行, 基列) = "列占比：按列汇总"
        基行 = 基行 + 1
        '------------------------------------------------------------------------------------
        For X = 1 To 维行 + 2
            WSJJ.Cells(基行, 基列).Cells(X, 1) = AMMJF(X - 1, 0, 位阶阶矩三维数和)
        Next
        For Y = 1 To 维列 + 2
            WSJJ.Cells(基行, 基列).Cells(1, Y) = AMMJF(0, Y - 1, 位阶阶矩三维数和)
        Next
        '------------------------------------------------------------------------------------
        For Y = 1 To 维列 + 1
            总值本列 = AMMJF(维行 + 1, Y, 位阶阶矩三维数和)
            For X = 1 To 维行 + 1
                If 总值本列 > 0 Then
                    WSJJ.Cells(基行, 基列).Cells(X + 1, Y + 1) = Round(AMMJF(X, Y, 位阶阶矩三维数和) / 总值本列, 3) * 100
                End If
            Next
        Next
        For X = 1 To 维行
            For Y = 1 To 维列
                With WSJJ.Cells(基行, 基列).Cells(X + 1, Y + 1)
                    .Interior.Color = 常色八蓝
                    If .Value > 10 Then
                        .Interior.TintAndShade = 0.8
                    ElseIf .Value > 5 Then
                        .Interior.TintAndShade = 0.5
                    ElseIf .Value > 1 Then
                        .Interior.TintAndShade = 0.1
                    Else
                        .Interior.TintAndShade = -0.5
                    End If
                End With
            Next
        Next
        '--------------------------------------------------------------------------------
        '格式化
        '--------------------------------------------------------------------------------
        WSJJ.Cells(基行, 基列).Resize(维行 + 2, 维列 + 2).NumberFormatLocal = 全设格式of零位
        WSJJ.Cells(基行, 基列).Resize(维行 + 2, 维列 + 2).Font.ColorIndex = 2
        WSJJ.Cells(基行, 基列).Offset(1, 1).Resize(维行, 维列).Font.ColorIndex = 1
        WSJJ.Cells(基行, 基列).Offset(1, 1).Resize(维行, 维列).Borders.ColorIndex = 1
        基行 = 基行 + 维行 + 3
'========================================================================================
'输出矩阵: 全占比
'注释20211111：参考意义不大，注销
'========================================================================================
        WSJJ.Cells(基行, 基列) = "全占比：按矩阵汇总"
        基行 = 基行 + 1
        '------------------------------------------------------------------------------------
        For X = 1 To 维行 + 2
            WSJJ.Cells(基行, 基列).Cells(X, 1) = AMMJF(X - 1, 0, 位阶阶矩三维数和)
        Next
        For Y = 1 To 维列 + 2
            WSJJ.Cells(基行, 基列).Cells(1, Y) = AMMJF(0, Y - 1, 位阶阶矩三维数和)
        Next
        '------------------------------------------------------------------------------------
        总值本矩 = AMMJF(维行 + 1, 维列 + 1, 位阶阶矩三维数和)
        For X = 1 To 维行 + 1
            For Y = 1 To 维列 + 1
                If 总值本矩 > 0 Then
                    WSJJ.Cells(基行, 基列).Cells(X + 1, Y + 1) = Round(AMMJF(X, Y, 位阶阶矩三维数和) / 总值本矩, 3) * 100
                End If
            Next
        Next
        For X = 1 To 维行
            For Y = 1 To 维列
                With WSJJ.Cells(基行, 基列).Cells(X + 1, Y + 1)
                    .Interior.Color = 常色八蓝
                    If .Value > 10 Then
                        .Interior.TintAndShade = 0.8
                    ElseIf .Value > 5 Then
                        .Interior.TintAndShade = 0.5
                    ElseIf .Value > 1 Then
                        .Interior.TintAndShade = 0.1
                    Else
                        .Interior.TintAndShade = -0.5
                    End If
                End With
            Next
        Next
        '--------------------------------------------------------------------------------
        '格式化
        '--------------------------------------------------------------------------------
        WSJJ.Cells(基行, 基列).Resize(维行 + 2, 维列 + 2).NumberFormatLocal = 全设格式of零位
        WSJJ.Cells(基行, 基列).Resize(维行 + 2, 维列 + 2).Font.ColorIndex = 2
        WSJJ.Cells(基行, 基列).Offset(1, 1).Resize(维行, 维列).Font.ColorIndex = 1
        WSJJ.Cells(基行, 基列).Offset(1, 1).Resize(维行, 维列).Borders.ColorIndex = 1
        基行 = 基行 + 维行 + 3
'########################################################################################
'########################################################################################
'主题：涨幅
'########################################################################################
'########################################################################################
    With WSJJ.Rows(基行).Borders(xlEdgeTop)
        .LineStyle = xlContinuous
        .Color = 基色底
        .Weight = xlThin
    End With
''========================================================================================
''输出矩阵: 涨幅矩阵
''========================================================================================
'        WSJJ.Cells(基行, 基列) = "涨幅矩阵（绝对数）"
'        基行 = 基行 + 1
'        '------------------------------------------------------------------------------------
'        '原样输出
'        '------------------------------------------------------------------------------------
'        For X = 1 To 维行 + 2
'        For Y = 1 To 维列 + 2
'            WSJJ.Cells(基行, 基列).Cells(X, Y) = AMMJF(X - 1, Y - 1, 位阶涨矩三维涨和)
'        Next
'        Next
'        '------------------------------------------------------------------------------------
'        'UTL展示幅度
'        '------------------------------------------------------------------------------------
'        总值本矩 = WSJJ.Cells(基行, 基列).Cells(维行 + 2, 维列 + 2)
'        For X = 1 To 维行
'            For Y = 1 To 维列
'                With WSJJ.Cells(基行, 基列).Cells(X + 1, Y + 1)
'                    If .Value > 0 Then
'                        .Value = CLng(.Value)
'                        .Interior.ColorIndex = 36
'                    ElseIf .Value < 0 Then
'                        .Value = CLng(.Value)
'                        .Interior.ColorIndex = 35
'                    Else
'                        .Interior.ColorIndex = 15
'                    End If
'                End With
'            Next
'        Next
'        WSJJ.Rows(基行).Font.ColorIndex = 2
'        WSJJ.Rows(基行).Rows(维行 + 2).Font.ColorIndex = 2
'        基行 = 基行 + 维行 + 3
'========================================================================================
'输出矩阵: 涨幅矩阵平均
'========================================================================================
        WSJJ.Cells(基行, 基列) = "涨幅平均矩阵"
        基行 = 基行 + 1
        '--------------------------------------------------------------------------------
        For X = 1 To 维行 + 2
            WSJJ.Cells(基行, 基列).Cells(X, 1) = AMMJF(X - 1, 0, 位阶阶矩三维数和)
        Next
        For Y = 1 To 维列 + 2
            WSJJ.Cells(基行, 基列).Cells(1, Y) = AMMJF(0, Y - 1, 位阶阶矩三维数和)
        Next
        '--------------------------------------------------------------------------------
        For X = 1 To 维行 + 1
        For Y = 1 To 维列 + 1
            With WSJJ.Cells(基行, 基列).Cells(X + 1, Y + 1)
                If AMMJF(X, Y, 位阶阶矩三维数和) > 0 Then
                    .Value = Round(AMMJF(X, Y, 位阶阶矩三维涨和) / AMMJF(X, Y, 位阶阶矩三维数和), 1)
                    If .Value >= 0 Then
                        If .Value > 2 Then
                            .Interior.Color = 常色八黄
                        ElseIf .Value > 1 Then
                            .Interior.Color = 常色五黄
                        ElseIf .Value > 0.5 Then
                            .Interior.Color = 常色三黄
                        Else
                            .Interior.Color = 常色一黄
                        End If
                    Else
                            .Interior.Color = 常色四青
                    End If
                Else
                            .Interior.Color = 常色二灰
                End If
            End With
        Next
        Next
        '--------------------------------------------------------------------------------
        '格式化
        '--------------------------------------------------------------------------------
        WSJJ.Cells(基行, 基列).Resize(维行 + 2, 维列 + 2).NumberFormatLocal = 全设格式of一位
        WSJJ.Cells(基行, 基列).Resize(维行 + 2, 维列 + 2).Font.ColorIndex = 1
        WSJJ.Cells(基行, 基列).Resize(维行 + 2, 1).Font.ColorIndex = 2
        WSJJ.Cells(基行, 基列).Resize(1, 维列 + 2).Font.ColorIndex = 2
        WSJJ.Cells(基行, 基列).Offset(1, 1).Resize(维行, 维列).Borders.ColorIndex = 1
        基行 = 基行 + 维行 + 5
'========================================================================================
'格式化
'========================================================================================
    WSJJ.Activate
    ActiveWindow.Zoom = 50
    WSJJ.Columns.ColumnWidth = 4
'    WSJJ.Columns.AutoFit
    WSJJ.Columns(1).ColumnWidth = 10
    WSJJ.Columns(维列 + 2).ColumnWidth = 10
'========================================================================================
End Function






Function XLSOP统时全码_标析引擎( _
          ARRJSL As Variant _
        , ARRJSR As Variant _
        , AMMJJ As Variant _
        , AMMJF As Variant _
        , 典阶标 As Dictionary _
        , 典阶涨 As Dictionary _
        , 提取代码 As String _
        , 指定期类 As String _
        , Optional 阶标左型 As String = "月局" _
        , Optional 阶标右型 As String = "周局" _
        , Optional 指定结算日 As Date = "2050/1/1" _
        ) As Integer
'========================================================================================
'设置基础信息
'========================================================================================
    Dim 典数阶标 As Integer
    典数阶标 = 典阶标.Count
    Dim 典数阶涨 As Integer
    典数阶涨 = 典阶涨.Count
'========================================================================================
'获取行情数据
'========================================================================================
    Dim 指定结日 As Date
    指定结日 = Date
    Dim ARRCSV As Variant
    Dim 计数行情 As Integer
    计数行情 = STBASE取据引擎取据由外库(ARRCSV, 提取代码, 指定期类, 指定结日)
    If 计数行情 < 1 Then Exit Function
    '------------------------------------------------------------------------------------
    Dim 遍历下限 As Integer
    Dim 遍历上限 As Integer
    遍历下限 = LBound(ARRCSV, 1)
    遍历上限 = UBound(ARRCSV, 1)
    '====================================================================================
    '设置数据：OS信息
    '====================================================================================
    ARRJSL(位阶码矩列代码) = 提取代码
    ARRJSL(位阶码矩列期类) = 指定期类
    '累龄 记载 经过交易的期数
    ARRJSL(位阶码矩列累龄) = 计数行情
    '市日 记载 行情开始日期
    ARRJSL(位阶码矩列始日) = ARRCSV(遍历下限, 位列TS结期)
    '今日 记载 行情结束日期
    ARRJSL(位阶码矩列终日) = ARRCSV(遍历上限, 位列TS结期)
    '-------------------------------
    ARRJSR(位阶码矩列代码) = 提取代码
    ARRJSR(位阶码矩列期类) = 指定期类
    '累龄 记载 经过交易的期数
    ARRJSR(位阶码矩列累龄) = 计数行情
    '市日 记载 行情开始日期
    ARRJSR(位阶码矩列始日) = ARRCSV(遍历下限, 位列TS结期)
    '今日 记载 行情结束日期
    ARRJSR(位阶码矩列终日) = ARRCSV(遍历上限, 位列TS结期)
'========================================================================================
'变量声明    -----------------------------------------------------------------------------
'========================================================================================
    Dim 纵阶标 As String, 横阶标 As String
    '------------------------------------------------------------------------------------
    Dim 今收 As Double
    '------------------
    Dim 今涨 As Double
    Dim 前收 As Double
    Dim 前JZ#, 前JA#, 前JB#, 前JC#, 前JD#, 前JE#, 前JF#, 前JG#
    '------------------
    Dim 均基#
    Dim JZ#, JA#, JB#, JC#, JD#, JE#, JF#, JG#
    Dim BTZA%
    Dim BTZB%, BTAB%
    Dim BTZC%, BTAC%, BTBC%
    Dim BTAG%, BTAD%, BTCG%, BTCD%
    Dim BTEG%, BTAE%, BTFG%, BTCE%, BTDE%
    Dim BTAF%, BTCF%, BTDF%, BTEF%
    Dim 值局ZEFG$, 值局ZCDE$, 值局ZABC$
    '------------------------------------------------------------------------------------
    Dim 今仓 As Double, 前仓 As Double
    Dim 今资 As Long
    Dim 今手 As Double, 前手 As Double
'========================================================================================
'遍历文件    -----------------------------------------------------------------------------
'========================================================================================
    Dim 遍历序号 As Integer
    For 遍历序号 = 遍历下限 To 遍历上限
        '--------------------------------------------------------------------------------
        '迭代保存上一条信息
        前收 = 今收
        '--------------------------------------------------------------------------------
        '读取今日信息
        今收 = ARRCSV(遍历序号, 位列TS结收)
        '--------------------------------------------------------------------------------
        '计算：今涨
        If 前收 > 0 And 今收 > 0 Then 今涨 = (今收 / 前收 - 1) * 100
        今涨 = Round(今涨, 1)
        '--------------------------------------------------------------------------------
        
        
        
        
        '================================================================================
        '处理首行以后  -------------------------------------------------------------------
        '================================================================================
        If 遍历序号 > 遍历下限 Then
        

'########################################################################################
'########################################################################################
'##################################     统计核心     #####################################
'########################################################################################
'########################################################################################
'========================================================================================
'设置阶标
'========================================================================================
            If 指定期类 = 常期类为周 Then
                If 阶标左型 = "月局" Then
                    纵阶标 = 值局ZCDE
                ElseIf 阶标左型 = "周局" Then
                    纵阶标 = 值局ZABC
                End If
                If 阶标右型 = "月局" Then
                    横阶标 = 值局ZCDE
                ElseIf 阶标右型 = "周局" Then
                    横阶标 = 值局ZABC
                End If
            ElseIf 指定期类 = 常期类为日 Then
                If 阶标左型 = "月局" Then
                    纵阶标 = 值局ZEFG
                ElseIf 阶标左型 = "周局" Then
                    纵阶标 = 值局ZCDE
                ElseIf 阶标左型 = "日局" Then
                    纵阶标 = 值局ZABC
                End If
                If 阶标右型 = "月局" Then
                    横阶标 = 值局ZEFG
                ElseIf 阶标右型 = "周局" Then
                    横阶标 = 值局ZCDE
                ElseIf 阶标右型 = "日局" Then
                    横阶标 = 值局ZABC
                End If
            End If
'========================================================================================
'统计阶标
'========================================================================================
'    If 值局ZCDE = "2c" Or 值局ZCDE = "1b" Or 值局ZCDE = "1w" Then
            '============================================================================
            '设置矩阵：阶标分布
            '============================================================================
            '分析：纵坐标
            Dim 定阶码矩一维 As Integer
            Dim 定阶阶矩一维 As Integer
            Dim 定阶阶矩二维 As Integer
            Dim 阶阶一维 As Integer
            Dim 阶阶二维 As Integer
            Dim 定阶涨矩一维 As Integer
            Dim 定阶涨矩二维 As Integer
            Dim 阶涨一维 As Integer
            Dim 阶涨二维 As Integer
            '分析：纵坐标
            定阶码矩一维 = 典阶标(纵阶标) + 位阶码矩列展始 - 1
            ARRJSL(定阶码矩一维) = ARRJSL(定阶码矩一维) + 1
            '分析：横坐标
            定阶码矩一维 = 典阶标(横阶标) + 位阶码矩列展始 - 1
            ARRJSR(定阶码矩一维) = ARRJSR(定阶码矩一维) + 1
            '============================================================================
            '设置矩阵：标标
            '============================================================================
            定阶阶矩一维 = 典阶标(纵阶标)
            定阶阶矩二维 = 典阶标(横阶标)
            阶阶一维 = 典数阶标
            阶阶二维 = 典数阶标
            '----------------------------------------------------------------------------
            AMMJJ(定阶阶矩一维, 定阶阶矩二维, 位阶阶矩三维数和) = AMMJJ(定阶阶矩一维, 定阶阶矩二维, 位阶阶矩三维数和) + 1
            AMMJJ(定阶阶矩一维, 阶阶二维 + 1, 位阶阶矩三维数和) = AMMJJ(定阶阶矩一维, 阶阶二维 + 1, 位阶阶矩三维数和) + 1
            AMMJJ(阶阶一维 + 1, 定阶阶矩二维, 位阶阶矩三维数和) = AMMJJ(阶阶一维 + 1, 定阶阶矩二维, 位阶阶矩三维数和) + 1
            AMMJJ(阶阶一维 + 1, 阶阶二维 + 1, 位阶阶矩三维数和) = AMMJJ(阶阶一维 + 1, 阶阶二维 + 1, 位阶阶矩三维数和) + 1
            '----------------------------------------------------------------------------
            AMMJJ(定阶阶矩一维, 定阶阶矩二维, 位阶阶矩三维涨数) = AMMJJ(定阶阶矩一维, 定阶阶矩二维, 位阶阶矩三维涨数) + IIf(今涨 >= 0, 1, 0)
            AMMJJ(定阶阶矩一维, 阶阶二维 + 1, 位阶阶矩三维涨数) = AMMJJ(定阶阶矩一维, 阶阶二维 + 1, 位阶阶矩三维涨数) + IIf(今涨 >= 0, 1, 0)
            AMMJJ(阶阶一维 + 1, 定阶阶矩二维, 位阶阶矩三维涨数) = AMMJJ(阶阶一维 + 1, 定阶阶矩二维, 位阶阶矩三维涨数) + IIf(今涨 >= 0, 1, 0)
            AMMJJ(阶阶一维 + 1, 阶阶二维 + 1, 位阶阶矩三维涨数) = AMMJJ(阶阶一维 + 1, 阶阶二维 + 1, 位阶阶矩三维涨数) + IIf(今涨 >= 0, 1, 0)
            '----------------------------------------------------------------------------
            AMMJJ(定阶阶矩一维, 定阶阶矩二维, 位阶阶矩三维涨和) = AMMJJ(定阶阶矩一维, 定阶阶矩二维, 位阶阶矩三维涨和) + 今涨
            AMMJJ(定阶阶矩一维, 阶阶二维 + 1, 位阶阶矩三维涨和) = AMMJJ(定阶阶矩一维, 阶阶二维 + 1, 位阶阶矩三维涨和) + 今涨
            AMMJJ(阶阶一维 + 1, 定阶阶矩二维, 位阶阶矩三维涨和) = AMMJJ(阶阶一维 + 1, 定阶阶矩二维, 位阶阶矩三维涨和) + 今涨
            AMMJJ(阶阶一维 + 1, 阶阶二维 + 1, 位阶阶矩三维涨和) = AMMJJ(阶阶一维 + 1, 阶阶二维 + 1, 位阶阶矩三维涨和) + 今涨
            '============================================================================
            '设置矩阵：标涨
            '针对周类：要对月类进行限制2c
            '针对日类：要对月类、周类进行限制2c_2c
            '要划分形态：更细的形态
            '============================================================================
            定阶涨矩一维 = 典阶标(纵阶标)
            定阶涨矩二维 = 1
            For i = 1 To 典阶涨.Count
                If 今涨 >= CInt(典阶涨.Items(i - 1)) Then
                    定阶涨矩二维 = i
                    'Debug.Print I, CInt(典阶涨.Items(I - 1)), 今涨, 今涨 >= CInt(典阶涨.Items(I - 1))
                End If
            Next
            阶涨一维 = 典数阶标
            阶涨二维 = 典数阶涨
            '----------------------------------------------------------------------------
            AMMJF(定阶涨矩一维, 定阶涨矩二维, 位阶涨矩三维数和) = AMMJF(定阶涨矩一维, 定阶涨矩二维, 位阶涨矩三维数和) + 1
            AMMJF(定阶涨矩一维, 阶涨二维 + 1, 位阶涨矩三维数和) = AMMJF(定阶涨矩一维, 阶涨二维 + 1, 位阶涨矩三维数和) + 1
            AMMJF(阶涨一维 + 1, 定阶涨矩二维, 位阶涨矩三维数和) = AMMJF(阶涨一维 + 1, 定阶涨矩二维, 位阶涨矩三维数和) + 1
            AMMJF(阶涨一维 + 1, 阶涨二维 + 1, 位阶涨矩三维数和) = AMMJF(阶涨一维 + 1, 阶涨二维 + 1, 位阶涨矩三维数和) + 1
            '----------------------------------------------------------------------------
            AMMJF(定阶涨矩一维, 定阶涨矩二维, 位阶涨矩三维涨数) = AMMJF(定阶涨矩一维, 定阶涨矩二维, 位阶涨矩三维涨数) + IIf(今涨 >= 0, 1, 0)
            AMMJF(定阶涨矩一维, 阶涨二维 + 1, 位阶涨矩三维涨数) = AMMJF(定阶涨矩一维, 阶涨二维 + 1, 位阶涨矩三维涨数) + IIf(今涨 >= 0, 1, 0)
            AMMJF(阶涨一维 + 1, 定阶涨矩二维, 位阶涨矩三维涨数) = AMMJF(阶涨一维 + 1, 定阶涨矩二维, 位阶涨矩三维涨数) + IIf(今涨 >= 0, 1, 0)
            AMMJF(阶涨一维 + 1, 阶涨二维 + 1, 位阶涨矩三维涨数) = AMMJF(阶涨一维 + 1, 阶涨二维 + 1, 位阶涨矩三维涨数) + IIf(今涨 >= 0, 1, 0)
            '----------------------------------------------------------------------------
            AMMJF(定阶涨矩一维, 定阶涨矩二维, 位阶涨矩三维涨和) = AMMJF(定阶涨矩一维, 定阶涨矩二维, 位阶涨矩三维涨和) + 今涨
            AMMJF(定阶涨矩一维, 阶涨二维 + 1, 位阶涨矩三维涨和) = AMMJF(定阶涨矩一维, 阶涨二维 + 1, 位阶涨矩三维涨和) + 今涨
            AMMJF(阶涨一维 + 1, 定阶涨矩二维, 位阶涨矩三维涨和) = AMMJF(阶涨一维 + 1, 定阶涨矩二维, 位阶涨矩三维涨和) + 今涨
            AMMJF(阶涨一维 + 1, 阶涨二维 + 1, 位阶涨矩三维涨和) = AMMJF(阶涨一维 + 1, 阶涨二维 + 1, 位阶涨矩三维涨和) + 今涨
            '============================================================================
'        End If
'########################################################################################
'########################################################################################
'##################################     统计核心     #####################################
'########################################################################################
'########################################################################################
'========================================================================================
'########################################################################################
'########################################################################################
'##################################      OS核心      #####################################
'##################################   内容整体复制   #####################################
'########################################################################################
'########################################################################################
'========================================================================================
'计算：基础信息
'因为需要统计【昨天指标】对应的【今天涨幅】，所以需要将此部分放到【统计】的后面
'========================================================================================
            前JZ = JZ
            前JA = JA
            前JB = JB
            前JC = JC
            前JD = JD
            前JE = JE
            前JF = JF
            前JG = JG
            '----------------------------------------------------------------------------
            JZ = (1 / 3) * JZ + (2 / 3) * 今收
            均基 = JZ
            JA = (4 / 6) * JA + (2 / 6) * 均基
            JB = (11 / 13) * JB + (2 / 13) * 均基
            JC = (25 / 27) * JC + (2 / 27) * 均基
            JD = (59 / 61) * JD + (2 / 61) * 均基
            JE = (119 / 121) * JE + (2 / 121) * 均基
            JF = (239 / 241) * JF + (2 / 241) * 均基
            JG = (479 / 481) * JG + (2 / 481) * 均基
            JZ = Round(JZ, 3)
            JA = Round(JA, 3)
            JB = Round(JB, 3)
            JC = Round(JC, 3)
            JD = Round(JD, 3)
            JE = Round(JE, 3)
            JF = Round(JF, 3)
            JG = Round(JG, 3)
            '----------------------------------------------------------------------------
            BTZA = STBASE结算工具_衍生交叉天数(BTZA, JZ, JA)
            BTZB = STBASE结算工具_衍生交叉天数(BTZB, JZ, JB)
            BTAB = STBASE结算工具_衍生交叉天数(BTAB, JA, JB)
            BTZC = STBASE结算工具_衍生交叉天数(BTZC, JZ, JC)
            BTAC = STBASE结算工具_衍生交叉天数(BTAC, JA, JC)
            BTBC = STBASE结算工具_衍生交叉天数(BTBC, JB, JC)
            BTAG = STBASE结算工具_衍生交叉天数(BTAG, JZ, JD)
            BTAD = STBASE结算工具_衍生交叉天数(BTAD, JA, JD)
            BTCG = STBASE结算工具_衍生交叉天数(BTCG, JB, JD)
            BTCD = STBASE结算工具_衍生交叉天数(BTCD, JC, JD)
            BTEG = STBASE结算工具_衍生交叉天数(BTEG, JZ, JE)
            BTAE = STBASE结算工具_衍生交叉天数(BTAE, JA, JE)
            BTFG = STBASE结算工具_衍生交叉天数(BTFG, JB, JE)
            BTCE = STBASE结算工具_衍生交叉天数(BTCE, JC, JE)
            BTDE = STBASE结算工具_衍生交叉天数(BTDE, JD, JE)
            BTAF = STBASE结算工具_衍生交叉天数(BTAF, JA, JF)
            BTCF = STBASE结算工具_衍生交叉天数(BTCF, JC, JF)
            BTDF = STBASE结算工具_衍生交叉天数(BTDF, JD, JF)
            BTEF = STBASE结算工具_衍生交叉天数(BTEF, JE, JF)
            '===============================================================================
            '衍生：局系统
            '===============================================================================
            值局ZEFG = STBASE结算工具_衍生局(JZ, JE, JF, JG)
            值局ZCDE = STBASE结算工具_衍生局(JZ, JC, JD, JE)
            值局ZABC = STBASE结算工具_衍生局(JZ, JA, JB, JC)
'            If 值局ZABC = "2c" And 结收 < 前收 Then 值局ZABC = "2d"
'========================================================================================
'########################################################################################
'########################################################################################
'##################################      OS核心      #####################################
'##################################   内容整体复制   #####################################
'########################################################################################
'########################################################################################





        '================================================================================
        '处理首行  -----------------------------------------------------------------------
        '================================================================================
        ElseIf 遍历序号 = 遍历下限 Then
            今涨 = 0
            
            JZ = 今收
            JA = 今收
            JB = 今收
            JC = 今收
            JD = 今收
            JE = 今收
            JF = 今收
            
            值局ZEFG = "2c"
            值局ZCDE = "2c"
            值局ZABC = "2c"
        End If
        '================================================================================
    Next 遍历序号
'========================================================================================
'返回
'========================================================================================
    Erase ARRCSV
    '------------------------------------------------------------------------------------
    XLSOP统时全码_标析引擎 = 计数行情
'========================================================================================
End Function
'########################################################################################
'########################################################################################
'#################################  统时全码  阶阶矩阵  ##################################
'########################################################################################
'########################################################################################

















'########################################################################################
'########################################################################################
'####################################   统时全码基程   ###################################
'########################################################################################
'########################################################################################
'========================================================================================
'========================================================================================
'设置数组：指标系列
'========================================================================================
'========================================================================================
Function XLSOP统时全码基程_设置典阶标(典阶标 As Dictionary, 期类 As String, 阶标左型 As String, 阶标右型 As String)
'========================================================================================
    Dim 组阶标单期连续 As Variant
    组阶标单期连续 = Array( _
                  Array("青龙甲坚", "2c", "2e") _
                , Array("朱雀甲坚", "1b") _
                , Array("青龙乙建", "1w", "1v", "6v", "6w") _
                , Array("青龙丙试", "1e", "2i", "3h", "3u") _
                , Array("玄武丙试", "6u", "6h", "5i", "4e") _
                , Array("玄武乙建", "3w", "3v", "4v", "4w") _
                , Array("反向辛震", "4b") _
                , Array("玄武甲坚", "5e", "5c") _
                )
    组阶标单期连续 = Array( _
                  Array("青龙甲坚", "2c", "1b") _
                , Array("青龙乙建", "1w", "1v", "6v", "6w") _
                , Array("青龙丙试", "2i", "3h", "3u") _
                , Array("朱雀甲坚", "4e", "5e") _
                , Array("反向辛震", "2e", "1e") _
                , Array("玄武丙试", "6u", "6h", "5i") _
                , Array("玄武乙建", "3w", "3v", "4v", "4w") _
                , Array("玄武甲坚", "4b", "5c") _
                )
'    组阶标单期连续 = Array( _
'                  Array("青龙甲坚", "2c", "1b", "1w", "1v") _
'                , Array("朱雀甲坚", "6w", "6v", "5e", "4e") _
'                , Array("青龙乙建", "2i", "3h") _
'                , Array("青龙丙试", "3u") _
'                , Array("玄武丙试", "6u") _
'                , Array("玄武乙建", "6h", "5i") _
'                , Array("反向辛震", "1e", "2e", "3v", "3w") _
'                , Array("玄武甲坚", "4v", "4w", "4b", "5c") _
'                )
    Dim 组阶标单期日类 As Variant
    组阶标单期日类 = Array( _
                  Array("青龙甲坚", "2c", "2e", "3v", "1b", "1e", "1w", "6w") _
                , Array("朱雀甲坚", "1v", "6v", "5e") _
                , Array("青龙乙建", "2i", "3h") _
                , Array("青龙丙试", "3u", "4e") _
                , Array("玄武丙试", "6u") _
                , Array("玄武乙建", "6h", "5i") _
                , Array("反向辛震", "4v") _
                , Array("玄武甲坚", "3w", "4w", "4b", "5c") _
                )
'========================================================================================
'设置：阶标数组
'决定因素：期类、均线级别
'========================================================================================
    Dim 组阶标单期 As Variant
    组阶标单期 = 组阶标单期连续
'========================================================================================
'设置典集：阶标典集
'========================================================================================
    Dim 元素典集 As String
    Dim 序数典集 As Integer
    '------------------------------------------------------------------------------------
    序数典集 = 0
    Dim X As Integer
    Dim Y As Integer
    For X = LBound(组阶标单期, 1) To UBound(组阶标单期, 1)
    For Y = LBound(组阶标单期(X), 1) + 1 To UBound(组阶标单期(X), 1)
        序数典集 = 序数典集 + 1
        元素典集 = 组阶标单期(X)(Y)
        典阶标.Add Item:=序数典集, Key:=元素典集
    Next
    Next
    Erase 组阶标单期
'========================================================================================
'返回：个数
'========================================================================================
    XLSOP统时全码基程_设置典阶标 = 典阶标.Count
'========================================================================================
End Function


'========================================================================================
'========================================================================================
'设置数组：典阶涨
'========================================================================================
'========================================================================================
Function XLSOP统时全码基程_设置典阶涨(典阶涨 As Dictionary, 期类 As String)
'========================================================================================
    Dim 组阶涨 As Variant
    If 期类 = 常期类为日 Then
        组阶涨 = Array(-10, -9, -8, -7, -6, -5, -4, -3, -2, -1, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9)
    ElseIf 期类 = 常期类为周 Then
        组阶涨 = Array(-50, -30, -20, -10, -5, -3, -2, -1, 0, 1, 2, 3, 5, 10, 20, 30, 50)
    ElseIf 期类 = 常期类为月 Then
        组阶涨 = Array(-50, -30, -20, -10, -5, -3, -2, -1, 0, 1, 2, 3, 5, 10, 20, 30, 50)
    End If
    '------------------------------------------------------------------------------------
    'Dim 典阶涨 As New Dictionary
    序数典集 = 0
    Dim X As Integer
    For X = LBound(组阶涨) To UBound(组阶涨)
        序数典集 = 序数典集 + 1
        元素典集 = 组阶涨(X)
        典阶涨.Add Item:=元素典集, Key:=序数典集
    Next
    '------------------------------------------------------------------------------------
    Erase 组阶涨
'========================================================================================
'返回：个数
'========================================================================================
    XLSOP统时全码基程_设置典阶涨 = 典阶涨.Count
'========================================================================================
End Function
'########################################################################################
'########################################################################################
'####################################   统时全码基程   ###################################
'########################################################################################
'########################################################################################
