Attribute VB_Name = "WMH_T历研统时_A2累幅研究"
Option Explicit
'待完成：统计【不同周期】下排名
'/1/2/3/5/10/20/50/100
'========================================================================================
'待删除
'========================================================================================
Public Const 位历代码 = 1
Public Const 位历名称 = 2
Public Const 位历累幅一期 = 3
Public Const 位历累幅二期 = 4
Public Const 位历累幅三期 = 5
Public Const 位历累幅五期 = 6
Public Const 位历累幅十期 = 7
Public Const 位历累幅仁期 = 8
Public Const 位历累幅伍期 = 9
Public Const 位历累幅佰期 = 10
'---------------------------------
Public Const 位历总期 = 11
Public Const 位历首期 = 12
Public Const 位历首价 = 13
Public Const 位历尾期 = 14
Public Const 位历尾价 = 15
Public Const 位历顶序 = 16
Public Const 位历顶期 = 17
Public Const 位历顶价 = 18
Public Const 位历底序 = 19
Public Const 位历底期 = 20
Public Const 位历底价 = 21
Public Const 位历顶底比例 = 22
'---------------------------------
Public Const 位历涨停计数 = 23
Public Const 位历涨停最近 = 24
Public Const 位历跌停计数 = 25
Public Const 位历跌停最近 = 26
'---------------------------------
Public Const 位历全均振幅 = 28
Public Const 位历全均涨幅 = 29
Public Const 位历全均高幅 = 30
Public Const 位历全均低幅 = 31
'---------------------------------
Public Const 位历总列 = 34
'========================================================================================









'统计连续上涨、连续下跌、特殊形态、第二天改变方向
'上涨个数、下跌个数


'########################################################################################
'########################################################################################
'#####################################    待清理 原版历研  ##############################
'########################################################################################
'########################################################################################
'========================================================================================
'========================================================================================
'调用：针对ACTIVESHEET
'========================================================================================
'========================================================================================
'Sub 历调单程_单期期全当前()
'    Dim MSFM As Worksheet
'    Set MSFM = ActiveSheet
'    MSG = MSG & 历调过程正程(ThisWorkbook, 被研期类:=常期类为日, MSFM:=MSFM)
'    MSG = MSG & 历调过程正程(ThisWorkbook, 被研期类:=常期类为周, MSFM:=MSFM)
'    MSG = MSG & 历调过程正程(ThisWorkbook, 被研期类:=常期类为月, MSFM:=MSFM)
'    MsgBox MSG
'    Set MSFM = Nothing
'End Sub
Sub 历调单程_单期期日当前()
    Call 历调过程正程(ThisWorkbook, 被研期类:=常期类为日, MSFM:=ActiveSheet)
End Sub
Sub 历调单程_单期期周当前()
    Call 历调过程正程(ThisWorkbook, 被研期类:=常期类为日, MSFM:=ActiveSheet)
End Sub
'Sub 历调单程_单期期月当前()
'    Call 历调过程正程(ThisWorkbook, 被研期类:=常期类为月, MSFM:=ActiveSheet)
'End Sub





'========================================================================================
'========================================================================================
'调用：统一调用历史子程
'========================================================================================
'========================================================================================
Function 历调过程正程( _
          MBTO As Workbook _
        , Optional 被研期类 As String = 常期类为日 _
        , Optional 被研市板 As String = "" _
        , Optional MSFM As Worksheet _
        , Optional 指定表名输出 As String = "" _
        , Optional 是否测试模式 As Boolean = False _
        ) As String
'========================================================================================
    Dim TT As Single
    TT = Timer
    '------------------------------------------------------------------------------------
 '   UTL宏工具_BEGIN
'========================================================================================
'确定典码称
'========================================================================================
    '------------------------------------------------------------------------------------
    '确定来源工表
    '------------------------------------------------------------------------------------
    Dim 是否特定 As Boolean
    
    If MSFM Is Nothing Then
        If STBASE外簿工具_花册链接(MSFM, 常花中股) = False Then Exit Function
        是否特定 = False
    Else
        If Left$(MSFM.Name, 1) = 常簿缀选自 Or Left$(MSFM.Name, 1) = 常簿缀选临 Then
            DoEvents
            是否特定 = True
        Else
            历调过程正程 = "NP"
            GoTo 返点
        End If
    End If
    '------------------------------------------------------------------------------------
    '确定典码称
    '------------------------------------------------------------------------------------
    Dim 典码称 As New Dictionary
    Dim CIDL As String
    Dim 代称 As String
    Dim 行号遍历 As Integer
    
    If 是否特定 = True Then
        For 行号遍历 = 2 To PBASE格程工具_表参末行指定(MSFM)
            CIDL = MSFM.Cells(行号遍历, 位qt代码).Value
            代称 = MSFM.Cells(行号遍历, 位qt代称).Value
            If UBCID是代码(CIDL) Then
                If 典码称.Exists(CIDL) = False Then 典码称.Add Item:=代称, Key:=CIDL
            End If
        Next
    Else
        For 行号遍历 = 2 To PBASE格程工具_表参末行指定(MSFM)
            CIDL = MSFM.Cells(行号遍历, 位列花天CIDL).Value
            代称 = MSFM.Cells(行号遍历, 位列花天代称).Value
            If UBCID是代码(CIDL) And MSFM.Cells(行号遍历, 位列花天市板) Like 被研市板 Then
                If 典码称.Exists(CIDL) = False Then 典码称.Add Item:=代称, Key:=CIDL
            End If
            '仅用于测试提高效率
            If 是否测试模式 = True And 典码称.Count > 10 Then Exit For
        Next
    End If
    Set MSFM = Nothing
    '------------------------------------------------------------------------------------
    '清理
    '------------------------------------------------------------------------------------
    Dim 码数 As Integer
    码数 = 典码称.Count
    Dim MSG As String
'========================================================================================
'设置工作表
'========================================================================================
    '------------------------------------------------------------------------------------
    '目标工作表设置
    '------------------------------------------------------------------------------------
    Dim 表名输出 As String
    If Len(指定表名输出) = 0 Then
        表名输出 = 常簿缀历统 & UCase(被研期类) & 常簿缀历统 & "X"  'Mid$(被研市板, 2, 1)
    Else
        表名输出 = 指定表名输出
    End If
    Dim MSTO As Worksheet
    Call PBASE格程工具_表操工表新增(MSTO, 表名输出, wb:=MBTO)
    '------------------------------------------------------------------------------------
    '格式化
    '------------------------------------------------------------------------------------
    MSTO.Tab.ColorIndex = 21
    MSTO.Columns.ColumnWidth = 1
    MSTO.Cells.Font.Size = 11
    MSTO.Cells.Interior.Color = 常色主靛
    MSTO.Cells.Interior.TintAndShade = -0.8
'========================================================================================
'调用程序
'========================================================================================
    '------------------------------------------------------------------------------------
    '分程：获取行情
    '------------------------------------------------------------------------------------
    Call 历研统时引擎1主程(表名输出, 典码称, 常期类为日, 是否输出分表:=False)
    '------------------------------------------------------------------------------------
    '清理
    '------------------------------------------------------------------------------------
    典码称.RemoveAll
    Set 典码称 = Nothing
    Set MSTO = Nothing
'========================================================================================
'返回
'========================================================================================
返点:
    MSG = "历情统计>>" & 被研期类 & ">>" & 被研市板 & ">>" & 码数 & ">>" & CLng(Timer - TT) & vbCrLf
    Debug.Print MSG
    历调过程正程 = MSG
'========================================================================================
'   UTL宏工具_END
End Function
'########################################################################################
'########################################################################################
'#####################################    待清理 原版历研  ##############################
'########################################################################################
'########################################################################################




